{"file_name": "botpenguin.com_chatbot-templates", "text": "URL: https://botpenguin.com/chatbot-templates\nFREE Ready to Use Chatbot Templates | BotPenguin's Chatbot Creator\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nEngaging Chatbot Templates designed to enhance\nevery Customer Conversation\nSay goodbye to monotonous chats. Use these ready-to-deploy chatbot templates to deliver lively,\npersonalized, human-like conversations that your clients desire.\nGet Started FREE\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nWhat are Chatbot Templates?\nA chatbot template is a pre-designed conversation flow based on research and customer analysis for specific use cases and businesses. Simply modify it according to your brand guidelines and deploy it easily for conversations that result in conversions!\nFind the best Chatbot Templates for all Industries and Use Cases\nEnjoy free chatbot templates for engaging conversations with your customers that lead to maximum conversions!\nAll\nEcommerce\nFood Services\nRentals\nHotels\nTravel\nEducation\nGym and Fitness\nHealth and Wellness\nE-commerce template\nThe e-commerce chatbot template helps you showcase products, manage sales, and provide efficient customer support.\nMore details\nFlower shop chatbot\nCustomers can browse flowers and place orders easily using a flower shop chatbot template designed for delightful shopping experiences.\nMore details\nSolar Panels Chatbot\nThis Solar Panels chatbot assists customers in renting or purchasing panels, using an interactive chatbot template for smooth transactions.\nMore details\nOverseas Education Consultancy\nWith this chatbot template, overseas education consultants can manage queries, provide admission details, and book appointments efficiently.\nMore details\nChildren School Chatbot\nManage admissions smoothly by using a chatbot template for children’s schools, enabling inquiries and facility visit bookings.\nMore details\nE learning bot\nThis e-learning chatbot template displays courses, resolves queries, and offers personalized assistance to learners.\nMore details\nReal Estate Chatbote\nReal estate agents benefit from a chatbot template that allows quick responses to buyer and seller inquiries, improving lead management.\nMore details\nCoworking space bot\nUse this coworking space bot to leverage a chatbot template that assists customers in booking their ideal workspace with ease.\nMore details\nLegal Services Chatbot\nCustomers can book consultations and get legal help quickly with a legal services chatbot template tailored for fast interactions.\nMore details\nEvent Planners Chatbot\nThe Event Planners chatbot template makes it easy for customers to book appointments and get relevant information quickly.\nMore details\nUniversity/college Chatbot\nWith this university chatbot template, schools can manage enrollments, course inquiries, and deadlines smoothly.\nMore details\nDigital Marketing Agency\nProvide digital solutions efficiently with a chatbot template designed for digital marketing agencies.\nMore details\nRestaurant Table booking\nThe chatbot template for restaurant table booking helps you collect leads and simplifies reservations for customers.\nMore details\nHotel booking Chatbot\nThis Hotel Booking chatbot assists agents by instantly responding to inquiries, using a chatbot template designed to streamline reservations.\nMore details\nTravel agency Bot\nThe Travel Agency chatbot template simplifies planning by helping customers arrange trips and book travel packages smoothly.\nMore details\nDental Clinic bot\nThe Dental Clinic chatbot template helps customers inquire about services and book dentist appointments without hassle.\nMore details\nCar Rental Chatbot\nThe Car Rental chatbot template offers customers a seamless way to explore options and book cars with minimal effort.\nMore details\nHR Consultancy Chatbot\nThe HR Consultancy chatbot template makes it easier to manage candidates, post jobs, and handle recruitment activities with speed.\nMore details\nEatery order bot\nThe Eatery Order chatbot template helps showcase menus and improves order management for restaurants and cafes.\nMore details\nPersonal Trainer Chatbot\nCustomers can book sessions easily with a personal trainer chatbot template that handles inquiries and reservations effectively.\nMore details\nDietician Chatbot\nUse this chatbot template to streamline dietician bookings and inquiries, improving customer experience.\nMore details\nSAAS Enquiry Chatbot\nThe SaaS Enquiry chatbot template helps businesses schedule demos, answer questions, and provide detailed service information.\nMore details\nWebinar Registration Chatbot\nThe chatbot template for webinar registration makes it simple to book spots, resolve questions, and offer assistance.\nMore details\nCoaching institute bot\nThe Coaching Institute chatbot template provides an easy way to enroll students, showcase classes, and answer queries efficiently.\nMore details\nHospital Booking Chatbot\nWith a chatbot template for hospitals, patients can book appointments and receive reports quickly.\nMore details\nDoctor appointment Chatbot\nThe Doctor Appointment chatbot template helps customers book, reschedule, or cancel appointments conveniently.\nMore details\nHow to use a Chatbot Template?\nBotPenguin has designed the best chatbot templates, which are quick\nand simple to be used instantly for your business.\nChoose\nSelect from a wide range of chatbot templates designed for tasks like customer support, marketing, or lead generation.\nPersonalize\nTailor the chatbot and conversational flow according to your brand voice and tone.\nDeploy\nLaunch the chatbot on your desired platform and watch your customer engagement grow higher with every message.\nGet Started FREE\nHow BotPenguin’s Chatbot Features can Increase your overall ROI\nBotPenguin’s AI chatbot platform is designed to ensure all your teams exceed their business targets using the endless\nfunctionalities offered by the chatbot platform.\nOmnichannel Presence\nDeploy AI chatbots across all popular platforms, including websites, WhatsApp, Instagram, Facebook, Telegram, and more.\nIncreased Lead Capturing\nUse the AI chatbot to gather all relevant details of the user and transfer them easily to the integrated CRM.\nSeamless Appointment Booking\nProvide your customers the option to book appointments directly through the chatbot.\nAutomated Ticketing System\nLet customers generate support tickets easily from the chatbot which can be assigned to any available agent.\nAdvanced Marketing Automation\nRun drip campaigns, broadcast offers, and personalized product showcase using smart and targeted customer segmentation.\nAnalytical Dashboard\nKeep track of customer interactions and gain actionable insights from advanced analytical dashboards.\nGet Started FREE\nBoost daily sales with personalized Chatbot\nTemplates for E-commerce\nGet the best of Ecommerce marketing with free chatbot maker. Generate leads,\nengage efficiently, and sell better.\nEcommerce template\nThis e-commerce chatbot template helps you showcase your products, sell products, and provide customer support.\nFlower Shop Chatbot\nUsing this chatbot help customers pick flowers of their own choice and place orders easily.\nSolar Panels\nThis chatbot helps your customers rent/buy solar panels according to their needs while effectively marketing your business.\nGet Started FREE\nA chatbot template for every Educational Institute\nProvide seamless assistance to students looking to join your institute by being\navailable 24/7 using educational chatbot template.\nOverseas Education Consultancy\nThis chatbot helps customers make queries, book appointments and get university admission details.\nChildren School\nThis chatbot helps customers make inquiries, connect with admission consultants, and book facility visits.\nE-Learning\nThis chatbot lets you showcase your courses, resolve queries and provide assistance.\nGet Started FREE\nClose all property deals with the smart Real\nEstate Chatbot Template\nEngage with property seekers 24/7 by generating more leads, automating bookings and\npersonalizing conversations at every step of customer journey.\nReal Estate\nThis chatbot template assists agents in instantly responding to buyer and seller leads.\nCoworking\nThis chatbot template helps your customers rent the perfect space for their working needs.\nEvent Planner\nThis chatbot template lets your customers make appointments with you and get information.s\nGet Started FREE\nBe the best in business with Chatbot Template for Agencies\nProvide excellent consultation and expert advice using chatbot template for business professionals\nHR Consultancy\nUnburden your HR and keep it simple with this chatbot template to manage candidates, hire prospects and post jobs.\nSAAS\nThis chatbot template for SAAS businesses lets your customer make bookings for demos, raise queries, and find more information.\nDigital Marketing\nA chatbot template to help you provide early consultation to clients and improve conversion rates.\nGet Started FREE\nTransform Patient Care with Chatbot Templates for Healthcare\nDeliver instant medical support and streamline patient interactions with intelligent healthcare chatbot templates.\nDoctor Booking\nYour customers can easily book, reschedule, or cancel appointments with the doctors using this chatbot template.\nHospital\nGive your client the choice of choosing their own favorable slot and send reports swiftly by deploying this hospital chatbot template.\nDentist\nThis chatbot template for dentists helps your customers ask questions and book an appointment with a dentist.\nGet Started FREE\nElevate Guest Experiences with Hospitality Chatbot Templates\nDeliver seamless bookings and 24/7 assistance to guests using intuitive hospitality chatbot templates for every use-case.\nRestaurant\nThis chatbot template for restaurants aids you in collecting leads and helps your customers book tables.\nHotel Booking\nThis hotel booking chatbot template assists agents in instantly responding to customer’s queries. Booking a hotel room hasn’t been this easy.\nEatery\nThis chatbot template for eatery lets you showcase the food menu, improve sales, and offer support to your customers.\nGet Started FREE\nPower up your sales team with Lead Generation Chatbot Template\nCapture leads effortlessly around the clock with tailored chatbot templates built for conversions.\nPersonal Trainer\nThis chatbot template lets your customer make bookings for personal training and inquire about services.\nDietician\nThis chatbot template for dieticians lets your customers make bookings for Dieticians and inquire about services.\nWebinar Registration\nThis website registration chatbot template lets you show the available webinars, and book spots, resolve queries, and provide assistance.\nGet Started FREE\nRevolutionize your Business Communication with Chatbot\nTemplate for Customer Support\nBoost customer satisfaction instantly with smart chatbot templates designed for superior support.\nCar Rental\nWith this chatbot template, your customers can decide all their car rental needs and make smooth bookings.\nTravel Agency\nThis travel agency chatbot template simplifies the difficult and drawn-out process of planning a trip for your customers.\nCoaching Institute\nThis chatbot template for coaching institutes lets you show the available classes and courses, enroll students, resolve queries, and provide assistance.\nGet Started FREE\nFrequently Asked Questions\nHow to use Chatbot Templates?\nChatbot templates are pre-designed conversation flows for specific use cases like customer support, lead generation, and booking. They save time and improve engagement.\nCan I customize chatbot templates?\nYes! You can easily modify chatbot templates to match your brand's voice, style, and specific requirements.\nAre BotPenguin's chatbot templates free to use?\nYes, all BotPenguin’s chatbot templates are free to use. You can sign up and start customizing them right away without any charges.\nCan I use the chatbot templates for social media?\nYes, you can deploy BotPenguin’s chatbot templates on various platforms, such as WhatsApp, Facebook Messenger, Instagram, and more.\nWhich industries can use chatbot templates?\nThese chatbot templates can be used by various industries like E-commerce, education, real estate, healthcare, hospitality, and consulting for free.\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nAutomate Business Communication with Free AI Chatbot Today!\nGet Started\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10765420645475388, -0.071528360247612, 0.030447816476225853, 0.014256195165216923, -0.008144351653754711, -0.04931376129388809, 0.035514261573553085, 0.06611674278974533, 0.000278207880910486, 0.023855555802583694, 0.041364602744579315, -0.022177614271640778, 0.003340841503813863, 0.029133547097444534, 0.11762449890375137, -0.007669094949960709, 0.11313453316688538, -0.09346482157707214, -0.06625159084796906, -0.020156487822532654, -0.01660003326833248, -0.014577931724488735, 0.0473429299890995, -0.045980509370565414, -0.025268441066145897, -0.04475915804505348, -0.03503547981381416, -0.008774043060839176, -0.0189515370875597, -0.07882180064916611, -0.003747355891391635, 0.020262235775589943, 0.008141543716192245, 0.06531956791877747, -0.011567400768399239, -0.044560935348272324, -0.027864281088113785, 0.018109090626239777, 0.08187103271484375, -0.047557588666677475, -0.08339307457208633, -0.08459142595529556, -0.05530494824051857, -0.006109682843089104, 0.0851011797785759, -0.009206715039908886, -0.0667513757944107, 0.017888696864247322, 0.022183822467923164, 0.09196242690086365, -0.08508794754743576, -0.0531744547188282, 0.050427258014678955, 0.04843520000576973, -0.04358162730932236, 0.024237321689724922, -0.014796077273786068, 0.00756073510274291, 0.044435691088438034, -0.011397850699722767, -0.04309193789958954, 0.003060212591663003, 0.052254755049943924, 0.030102455988526344, -0.031261567026376724, 0.03401592746376991, -0.11799944192171097, 0.011534878052771091, 0.0006406422471627593, -0.02811429463326931, -0.018649650737643242, -0.010928327217698097, -0.0551426075398922, 0.05501461401581764, 0.014023687690496445, -0.031707704067230225, 0.007025217637419701, -0.005397439002990723, 0.015860768035054207, -0.06230004504323006, -0.036046482622623444, 0.031657855957746506, -0.004281429573893547, 0.055695541203022, -0.032510075718164444, -0.023384811356663704, 0.00618646340444684, 0.045313913375139236, -0.012113487347960472, 0.015104817226529121, 0.03259727731347084, 0.011523422785103321, 0.024047601968050003, 0.017167137935757637, 0.019753428176045418, 0.019929775968194008, -0.057716552168130875, 0.01669365167617798, -0.06835675239562988, -0.004696923308074474, -7.889520929893479e-05, -0.038960445672273636, -0.054856933653354645, -0.07841268181800842, -0.033802106976509094, 0.020666219294071198, 0.060803767293691635, -0.026160363107919693, 0.130985289812088, 0.012876370921730995, -0.11739486455917358, -0.05918655917048454, -0.008559673093259335, -0.024061093106865883, 0.0053999838419258595, 0.01222853735089302, -0.048953551799058914, 0.05158189684152603, 0.14764024317264557, 0.02924910932779312, 0.07728011161088943, 0.05719177797436714, 0.007351345382630825, -0.016471946612000465, 0.06572180241346359, 0.03543861582875252, -0.0004343727487139404, 1.1864749374269062e-32, -0.02610056661069393, 0.041971247643232346, -0.06231747940182686, 0.10496605932712555, 0.04286899045109749, 0.02571946009993553, 0.01818998157978058, 0.051145583391189575, -0.07404208928346634, -0.03305794298648834, -0.10144064575433731, 0.09259070456027985, -0.08316385000944138, 0.044835250824689865, 0.025703027844429016, -0.08797095715999603, -0.0043914406560361385, 0.020976519212126732, 0.05109959840774536, 0.001418481464497745, 0.07933811843395233, -0.045892611145973206, 0.0545961819589138, 0.0812961682677269, 0.12470618635416031, 0.04522225633263588, 0.07146289944648743, 0.020109182223677635, 0.04947715252637863, 0.03461963310837746, -0.0915718823671341, 0.002799657406285405, -0.050431765615940094, 0.024164268746972084, -0.04517045617103577, -0.04884105548262596, -0.04596031829714775, -0.10469594597816467, -0.0759611427783966, 0.049234192818403244, -0.13473933935165405, -0.0008552212384529412, -0.10432521253824234, -0.06998060643672943, 0.023614535108208656, 0.005735585931688547, 0.02536037564277649, 0.019749188795685768, 0.040222376585006714, 0.024769823998212814, -0.04167651757597923, 0.020425787195563316, 0.031049318611621857, 0.060300152748823166, -0.006844338960945606, -0.06337925046682358, 0.026478741317987442, -0.04767639935016632, -0.0024657256435602903, -0.041849296540021896, -0.013042405247688293, -0.03176438808441162, -0.011481416411697865, -0.024146325886249542, 0.0508827343583107, 0.011254440993070602, 0.05423027276992798, 0.024073489010334015, 0.029882047325372696, 0.03227447345852852, 0.048873212188482285, 0.05178217962384224, -0.006613250356167555, 0.031303342431783676, -0.04839635267853737, 0.012241252698004246, -0.09571564197540283, 0.033029112964868546, -0.04379098489880562, 0.0026749486569315195, -0.026231706142425537, -0.006702002603560686, -0.029826289042830467, -0.0387868657708168, 0.07523863017559052, -0.047855306416749954, 0.037581782788038254, -0.032428160309791565, -0.020531632006168365, 0.04679018259048462, -0.04391532018780708, 0.08260408043861389, -0.06932604312896729, 0.06658351421356201, -0.048245448619127274, -9.448906445237714e-33, -0.0543554425239563, 0.018793350085616112, -0.04664153978228569, 0.08019806444644928, 0.007796298712491989, -0.03594052791595459, 0.03914990276098251, -0.035346344113349915, 0.10735299438238144, -0.00851027388125658, -0.10641352832317352, -0.012190618552267551, 0.02098960615694523, -0.03952479735016823, -0.010166079737246037, 0.029399661347270012, -0.06468793004751205, -0.044479288160800934, 0.014677789062261581, 0.002092506969347596, -0.032509319484233856, 0.056260526180267334, -0.11815368384122849, 0.02282598428428173, -0.003068953985348344, 0.04733504354953766, -0.07635851949453354, 0.05554324761033058, 0.01480522844940424, 0.020556319504976273, -0.016474803909659386, 0.002439160831272602, -0.02952898107469082, 0.0018469988135620952, 0.02168108895421028, 0.053417760878801346, 0.016495082527399063, 0.0026957246009260416, -0.004564615897834301, -0.0439264141023159, 0.10535070300102234, -0.05456772819161415, -0.04707328602671623, -0.07067275047302246, -0.008720040321350098, 0.022564850747585297, -0.1447775810956955, -0.046674277633428574, -0.056152768433094025, 0.037283383309841156, 0.04668502137064934, -9.481205051997676e-05, 0.043263863772153854, -0.05142781883478165, -0.0854596495628357, -0.03343072161078453, 0.09350515902042389, 0.018535571172833443, -0.07574953883886337, 0.02285831607878208, 0.03510608151555061, 0.005895472597330809, 0.06606414914131165, 0.07173740118741989, 0.03901117667555809, -0.016250912100076675, 0.06715382635593414, 0.04168274626135826, -0.008384084329009056, -0.09474793076515198, 0.049378927797079086, -0.044592827558517456, -0.011627539992332458, -0.0015580244362354279, 0.01865229569375515, 0.08835051208734512, 0.05164105072617531, -0.09572119265794754, 0.007811796851456165, -0.025044646114110947, -0.04801826551556587, -0.0024254757445305586, 0.05386965349316597, 0.038116205483675, -0.08350680023431778, 0.06271422654390335, -0.03803389146924019, 0.00987766869366169, -0.005175034981220961, 0.02099735103547573, -0.051745977252721786, 0.026452044025063515, -0.01764124259352684, 0.10732127726078033, 0.009065497666597366, -5.948665915411766e-08, -0.02629809081554413, -0.0008316471357829869, 0.05930575728416443, 0.04484190046787262, 0.03999980911612511, -0.050085220485925674, -0.03380777686834335, 0.07623229920864105, 0.020770272240042686, 0.02892301045358181, 0.01889239065349102, -0.023845864459872246, -0.048491694033145905, 0.07937061041593552, 0.06984001398086548, -0.01937938667833805, -0.037488725036382675, -0.014377852901816368, 0.00878329947590828, -0.043344322592020035, 0.06290903687477112, 0.023192306980490685, -0.026935800909996033, -0.03651637211441994, 0.016746554523706436, -0.07095859199762344, -0.0617062970995903, 0.07828868180513382, -0.05361276492476463, -0.01211571041494608, -0.024394545704126358, -0.030790776014328003, 0.06773877143859863, -0.039681654423475266, 0.010033177211880684, -0.006430187728255987, -0.0851169228553772, -0.08163738995790482, 0.0127582848072052, 0.054026372730731964, 0.01952482759952545, 0.02195872738957405, 0.007656645029783249, -0.09483648091554642, -0.03027423471212387, -0.048125531524419785, -0.07280122488737106, -0.11569665372371674, 0.03745535388588905, -0.003946810029447079, -0.054271746426820755, 0.004492704290896654, 0.05575203523039818, 0.04784741997718811, 0.08658134192228317, 0.008239669725298882, 0.06370169669389725, -0.005171424709260464, 0.1034548208117485, 0.10796409100294113, 0.02386973239481449, 0.026023797690868378, 0.0345737487077713, 0.014014927670359612]}