{"file_name": "botpenguin.com_glossary_search-engine-optimization", "text": "URL: https://botpenguin.com/glossary/search-engine-optimization\nWhat is Search Engine Optimization (SEO) & how does it work?\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nWhat is Search Engine Optimization (SEO) & how does it work?\nTable of Contents\nWhat is SEO?\nWhy is SEO Important?\nWho Needs SEO?\nWhen Should You Use SEO?\nEssential SEO Terminology\nMetrics and Analytics\nFundamental SEO Strategies\nSEO Content Marketing\nKeyword Research in SEO\nOn-Page SEO\nOff-Page SEO\nMobile SEO\nLocal SEO\nSEO Tools and Platforms\nSEO Penalties\nLatest SEO Practices For Higher Rankings\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nWhat is SEO?\nSearch Engine Optimization (SEO) is the practice of enhancing a website and its content to improve its visibility in search engine rankings.\nThe goal is to reach the top of search engine results pages (SERPs), specifically on Google, Bing, and Yahoo, among others, when users input certain keywords.\nImproved visibility leads to increased website traffic, which can contribute to different goals such as brand awareness, higher sales, or more subscribers.\nSEO involves various techniques, from keyword integration, sitemaps creation, and meta tags to link building and producing high-quality, engaging content, to name a few.\nWhy is SEO Important?\nSEO is critical for several reasons:\nVisibility:\nWith billions of searches conducted each day, ranking high in SERPs can significantly increase your brand's visibility.\nCredibility and Trust:\nUsers tend to trust search engines. Therefore, ranking high in search results can enhance your brand's credibility.\nUser Experience:\nGood SEO involves improving site speed, ensuring mobile-friendliness, and creating easy-to-navigate websites, all contributing to a better\nuser experience.\nIncreased Traffic and Conversions:\nMore visibility leads to more site traffic. If you’ve optimized your website correctly, these visitors are more likely to convert.\nCompetitive Advantage:\nGiven the benefits of high rankings, companies invest in SEO, making it a must-have strategy to outperform competitors.\nWho Needs SEO?\nEssentially, any organization with a digital presence can benefit from SEO:\nSmall Businesses and Start-ups:\nFor small companies and start-ups, SEO can help increase visibility and compete with bigger players.\nService Providers:\nService-focused businesses can use local SEO strategies to rank high in search results within their specific region.\nBloggers/Content Creators:\nBloggers and creators need SEO to ensure their content reaches the widest possible audience.\nE-commerce Companies:\nThese businesses largely rely on SEO to drive traffic to their product pages and convert visitors into customers.\nWhen Should You Use SEO?\nSEO is not a one-time effort; it's an ongoing strategy. Here’s when it comes into play:\nWebsite Design:\nSEO should be a consideration from the initial stages of website design, ensuring the site's structure and pages are optimized for search engines.\nContent Creation:\nEvery time you create content, integrating relevant keywords, creating meta descriptions, and optimizing media should be priorities.\nWebsite Updates:\nWhenever you update your website or make changes to existing content, ensure the alterations align with your SEO strategy.\nMonitoring and Tweaking:\nSEO requires regular monitoring of website performance and making necessary adjustments based on\ndata from analytics\n.\nDocument\nBoost Your Organic Traffic with\nAI-Powered Chatbot!\nTry BotPenguin\nEssential SEO Terminology\nHere are some of the key terminologies necessary to understand the world of SEO.\nAlgorithms\nAlgorithms in the context of SEO refer to the complex systems that search engines use to\nretrieve data\nfrom their index and instantly deliver the best possible results for a query.\nCrawlers\nAlso known as robots or spiders, these are automated software programs that search engines use to scan or 'crawl' websites on the internet, collect information, and create an index.\nIndex\nThe index is the\ndatabase\nwhere all the information gathered by the crawlers is stored. When a search query is made, the search engine pulls out the relevant information from this index.\nKeywords\nKeywords are critical in SEO. They are words or phrases that users enter into search engines when looking for information or services. Your goal with SEO is to rank at the top of search engine results for your defined keywords.\nMetrics and Analytics\nUnderstanding metrics and analytics is key to measuring the success of your SEO efforts.\nOrganic Traffic\nOrganic traffic is the number of visitors reaching your website as a result of unpaid search results. More organic traffic generally suggests better website health.\nBounce Rate\nThe bounce rate is the percentage of visitors who leave your website after viewing only one page. A high bounce rate may indicate poor\nuser experience\nor irrelevant content.\nClick-Through Rate (CTR)\nCTR\nis the percentage of people who click on your website link out of the total number who see it. It’s a vital metric to monitor within your SEO dashboard.\nConversion Rate\nThe conversion rate is the percentage of visitors who complete a desired action on your site. This could include making a purchase, subscribing to a newsletter, or filling out a form.\nFundamental SEO Strategies\nSuccessful SEO requires a strategic approach. Let's delve into some of the underlying schemes that should guide your SEO strategy.\nOn-Page SEO\nOn-Page SEO refers to techniques you can apply to your website's individual pages to improve their search engine rankings, such as optimizing content, HTML code, and metadata.\nOff-Page SEO\nOff-page SEO refers to activities you can perform outside the boundaries of your website to improve its search engine rankings, such as backlink building and social media marketing.\nLocal SEO\nLocal SEO is all about increasing search visibility for businesses that serve their communities face-to-face, such as brick-and-mortar stores or service-area businesses.\nTechnical SEO\nTechnical SEO involves improving the technical aspects of a website—like site speed or mobile-friendliness—to increase its visibility in search engines.\nSEO Content Marketing\nHigh-quality content is at the core of a successful SEO campaign. Here's what you need to keep in mind.\nContent Optimization\nContent optimization involves making your website's content more attractive, useful, and actionable to users, leading to higher search engine rankings.\nKeyword Research\nKeyword research is the process of finding and analyzing search words that people enter into search engines with the goal of using that data for specific purposes, frequently for SEO or general marketing.\nSuggested reading:\nKeyword Density: Formula, Factors, Myths & Key Tips\nLong-Tail Keywords\nLong-tail keywords are very targeted search phrases that typically have low search volume and competition but higher conversion rates due to their specificity.\nContent Strategy\nA content strategy is the ongoing process of transforming business objectives and goals into a plan that uses content as a primary means of achieving those goals.\nKeyword Research in SEO\nKeywords play a central role in SEO; they are the terms that users enter into search engines. Your SEO efforts largely depend on how well you’ve implemented and targeted these keywords.\nImportance of Keywords\nUsing the right keywords is central to SEO. It's important to understand what search terms potential viewers might use when looking for products or services like yours.\nLong-Tail Keywords\nLong-tail keywords are longer and more specific keyword phrases that visitors are more likely to use when they’re closer to a point of purchase or when using voice search.\nKeyword Optimization\nKeyword optimization (also known as keyword targeting) is the act of researching, analyzing, and selecting the best possible keywords to drive qualified traffic from search engines to your website.\nGoogle Keyword Planner\nGoogle Keyword Planner is a tool that generates keyword ideas and helps advertisers create new Search Network campaigns. It's also useful to website owners for keyword SEO research.\nOn-Page SEO\nOn-Page SEO is the practice of optimizing individual web pages in order to rank higher and earn more relevant traffic in search engines. On-page refers to both the content and HTML source code of a page that can be optimized.\nTitle Tags\nAn HTML tag that exists in the head section of each webpage, title tags provide an initial clue or context as to what the topical subject matter of the respective page is.\nMeta Descriptions\nA meta description is an HTML tag used to describe the content of a web page. It's important for SEO because Google might use them as snippets for your pages in the SERPs.\nImage Alt Text\nImage Alt Text provides better image context/descriptions to search engine crawlers, helping them to index an image properly. It improves website accessibility for people with poor vision or those using screen readers.\nURL Structure\nA good URL structure can help both search engines and users read and understand a URL, which can result in improved user experience and better search ranking.\nOff-Page SEO\nOff-page SEO involves actions taken outside of your own website to affect your rankings within search engine results pages. It's as important as on-page SEO and needs a consistent approach.\nBacklinks\nBacklinks, or inbound links, are created when one website links to another. High-quality backlinks can help to increase a site's ranking position and visibility in search engine results.\nSocial Media Engagement\nWhile social media is not a direct SEO ranking factor, one can use social media to amplify the content exposed to a wider audience, increasing the chance of earning backlinks.\nGuest Blogging\nGuest blogging, or guest posting, is the act of writing content for another company's website. It's a useful way to connect with new readers and get your name out while impacting your SEO.\nInfluencer Outreach\nBy creating relationships with influencers in your industry, you may get noticed by a larger audience. This could result in increased links back to your site, boosting your SEO efforts.\nMobile SEO\nWith an exponential increase in smartphone usage, mobile SEO has become indispensable. It ensures that mobile users have an optimal experience when visiting your site.\nResponsive Design\nA responsive design allows your site to automatically adjust for different screen sizes and viewports. This design is crucial to provide a seamless user experience across various devices, indirectly helping your SEO.\nMobile-Friendly Site\nGoogle operates mobile-first indexing, which means Google predominantly uses the mobile version of the content for indexing and ranking. Having a mobile-friendly website boosts your ranking in mobile search results.\nPage Speed\nPage speed is a direct ranking factor, a fact known even more since Google's Algorithm Speed Update. However, speed can also affect rankings indirectly by increasing the bounce rate.\nAMP\nAccelerated Mobile Pages (AMP) is a project from Google designed to make fast mobile pages. It's a way to build web pages for static content that render quickly, helping to improve user experience and SEO.\nLocal SEO\nLocal SEO is about optimizing a website to increase traffic, leads, and brand awareness from local searches. It's an effective way to market your local business online.\nGoogle My Business\nGoogle My Business is a free tool that allows small businesses to manage how their business appears on Google Maps and Google Search. It's an important tool to elevate your local SEO strategy.\nLocal Citations\nA local citation is any online mention of the name, address, and phone number of a local business. Citations help Internet users discover local businesses and can also impact local search engine rankings.\nReviews and Ratings\nUser reviews can be powerful for SEO. A high quantity of reviews can make your business appear more prominent in local search results. They can also encourage more users to visit your site or location.\nLocation-Specific Content\nCreating location-specific pages or content is a great way of connecting with local customers. These pages can serve localized content about your business, products, or services to the local audience.\nSEO Tools and Platforms\nA range of tools and platforms can lighten your SEO workload. Understanding their roles and importance is key to maximizing their advantages.\nGoogle Analytics\nGoogle Analytics\nis crucial for understanding the effectiveness of your SEO efforts. It provides deep insights into your website's visitors and their behaviors.\nSEO Plugins\nSEO plugins, like Yoast for WordPress, help make your website more SEO-friendly. They assist with tasks such as creating metadata, sitemaps, and optimizing content.\nGoogle Search Console\nGoogle Search Console is a free tool provided by Google to help website owners monitor and maintain their site's presence in Google search results.\nKeyword Tools\nKeyword tools, such as Google Keyword Planner or SEMrush, help you find keywords with the right balance of search volume and competitiveness for your content.\nSEO Penalties\nFailure to comply with search engine guidelines can result in penalties. It's crucial to understand these and how to prevent them.\nGoogle Penalties\nGoogle penalties occur when a website violates one or more of Google's Webmaster Guidelines, which results in a drop in rankings or even removal from search results.\nPenguin\nPenguin is a Google algorithm update aimed at decreasing search engine rankings of websites that violate Google’s Webmaster Guidelines by using black-hat SEO techniques.\nPanda\nPanda, another Google algorithm update, is designed to lower the rank of \"low-quality sites\" or \"thin sites\" and return higher-quality sites near the top of the search results.\nManual Actions\nManual Actions are human-induced adjustments in a site’s ranking or complete removal from Google's index due to violations of Google’s Webmaster Quality Guidelines.\nE-E-A-T\nE-E-A-T stands for “\nExperience, Expertise, Authoritativeness, and Trustworthiness.\n”—four aspects that Google uses to measure how much trust it should place in a brand or website, gaining more prominence in the future.\nLatest SEO Practices For Higher Rankings\nHere are the best practices that you can use to rank higher and get more traffic on your website. Go over them in detail.\nUtilize Keywords in the Right Places\nPlace your primary keywords in crucial spots on your webpage, like the title tag, URL, and within the first 100 words of your content. This helps search engines understand your content's focus and rank it accordingly.\nImprove User Engagement\nKeep users on your site longer by making your content easier to read with subheadings and bullet points. Engaging content helps reduce bounce rates and sends positive signals to search engines, improving your rankings.\nHarness \"Suggest\" Keywords\nFind long-tail keywords by leveraging suggest features from platforms like Google, Wikipedia, and YouTube. These suggestions can provide unique keyword ideas to improve your content's search engine visibility.\nRemove Zombie Pages\nEliminate low-quality content or pages that don't generate traffic, as they can negatively affect your website's overall ranking. Google prefers one solid page over multiple low-quality pages.\nConduct Industry Studies\nOriginal research, such as industry surveys, can generate backlinks and mentions from authority websites. This improves your site's SEO and even attracts traffic from social media and press mentions.\nAdd Related Keywords\nUse synonyms and related terms along with your primary keyword. Google's Hummingbird update recognizes variations of keywords, improving your content's relevance and ranking.\nInclude Text with Visuals\nAdd text descriptions for visual content like infographics and videos to help search engines understand the content's context, securing better rankings.\nUpdate Outdated Content\nRevamp old content on your website by adding new data, visuals, or restructuring the layout. Updating content helps in improving its relevance and ranking on search engines.\nBoost Your Website's Speed\nOptimize your website's loading speed by eliminating any elements (such as unnecessary scripts) that slow it down. A faster-loading site provides a better user experience and ranks higher on search engines.\nLeverage Google Search Console\nUse Google Search Console to see which pages and keywords drive the most traffic to your site. This can help you find opportunities for optimizing existing content and improve your overall ranking.\nDocument\nConnect, Communicate, Convert\nGet Started FREE\nFrequently Asked Questions (FAQs)\nHow long does it take to see SEO results?\nTypically, you can start seeing improvements within a few months, but long-term results require continuous effort and patience.\nWhat is the difference between on-page and off-page SEO?\nOn-page SEO refers to optimizing your website content and structure, while off-page SEO focuses on building external links and boosting your online reputation.\nWhat is keyword research and why is it important for SEO?\nKeyword research involves finding the most relevant and effective search terms to target. It's crucial because it helps you optimize your content and attract the right audience.\nCan social media impact SEO?\nYes, social media can indirectly influence your SEO efforts by driving traffic and increasing brand visibility. Engaging content that gets shared can also generate backlinks, which can positively impact SEO.\nHow often should I update my website for SEO purposes?\nRegular updates are beneficial, but it depends on your industry and objectives. High-traffic websites may need frequent updates, while others may focus on quality and relevancy rather than quantity.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat is SEO?\nWhy is SEO Important?\nWho Needs SEO?\nWhen Should You Use SEO?\nEssential SEO Terminology\nMetrics and Analytics\nFundamental SEO Strategies\nSEO Content Marketing\nKeyword Research in SEO\nOn-Page SEO\nOff-Page SEO\nMobile SEO\nLocal SEO\nSEO Tools and Platforms\nSEO Penalties\nLatest SEO Practices For Higher Rankings\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10365316271781921, -0.04753657430410385, 0.021341925486922264, 0.015958061441779137, -0.020408472046256065, -0.03685073181986809, 0.024256277829408646, 0.07273586094379425, -0.031841401010751724, -0.003348467405885458, 0.01785040833055973, 0.010008732788264751, 0.026559267193078995, 0.005159399937838316, 0.07301829755306244, -0.01582908257842064, 0.12097487598657608, -0.07187560945749283, -0.09300222247838974, -0.057368021458387375, 0.017757508903741837, -0.023898683488368988, 0.05266551300883293, -0.06457303464412689, -0.041470304131507874, -0.04598097875714302, -0.05766986310482025, -0.025782685726881027, -0.0001638899411773309, -0.070767842233181, 0.010085056535899639, 0.024147823452949524, 0.014339064247906208, 0.08322682231664658, -0.03161574527621269, -0.03157434239983559, -0.05358302965760231, -0.0010940348729491234, 0.09706197679042816, -0.03456121310591698, -0.08681077510118484, -0.08157136291265488, -0.09171417355537415, -0.014043514616787434, 0.09869623184204102, 0.006063221953809261, -0.04506902024149895, 0.007322385441511869, 0.005559838842600584, 0.05321469530463219, -0.12734147906303406, -0.05016616731882095, 0.028726251795887947, 0.028059745207428932, -0.04373634606599808, 0.032546259462833405, -0.03597237169742584, 0.018029827624559402, 0.04935654252767563, -0.02379913628101349, -0.03809042274951935, -0.02437414787709713, 0.04856082797050476, 0.041981231421232224, -0.0013477494940161705, -0.008785150945186615, -0.09896107017993927, -0.030219923704862595, 0.014255150221288204, -0.05493667349219322, 0.01808382198214531, -0.018229931592941284, -0.03549054265022278, 0.04014517366886139, 0.009147699922323227, -0.020893484354019165, -0.0032770163379609585, 0.019096553325653076, 0.02747858688235283, -0.03767735883593559, -0.017219098284840584, 0.015286012552678585, -0.005869820713996887, 0.06393402814865112, -0.028738675639033318, -0.048849258571863174, 0.006589171476662159, -0.017672372981905937, 0.012010496109724045, 0.00869244895875454, 0.045974478125572205, -0.01691986247897148, 0.0039292797446250916, 0.011282829567790031, 0.02979455702006817, 0.02159791998565197, -0.0707855075597763, 0.012115479446947575, -0.031486138701438904, -0.010087589733302593, 0.006978063378483057, -0.017074421048164368, -0.0526772104203701, -0.10179649293422699, -0.057638462632894516, 0.024914542213082314, 0.0757623165845871, 0.027033863589167595, 0.14683668315410614, 0.009979130700230598, -0.11457785218954086, -0.043156933039426804, 0.017941301688551903, -0.030443580821156502, -0.005926710087805986, 0.02180132083594799, -0.03336082771420479, 0.05170588567852974, 0.15212073922157288, 0.04868290573358536, 0.03616214171051979, 0.06125960871577263, 0.006369544193148613, -0.026787789538502693, 0.04033765569329262, 0.053121261298656464, -0.04334469512104988, 1.1114745774878041e-32, -0.02460351586341858, 0.03408240154385567, -0.06017659977078438, 0.05991442874073982, 0.003921917639672756, 0.028258169069886208, 0.026318898424506187, 0.05269400402903557, -0.07969243824481964, -0.028667761012911797, -0.10363607108592987, 0.09594181925058365, -0.07734354585409164, 0.03984486684203148, 0.044469185173511505, -0.08509746938943863, -0.012057971209287643, 0.018954435363411903, 0.050251539796590805, -0.017796101048588753, 0.11870089918375015, -0.02052675373852253, 0.0631917342543602, 0.051533039659261703, 0.1200292631983757, 0.014457949437201023, 0.05169130489230156, -0.003153139492496848, 0.02309519425034523, 0.04495743662118912, -0.10210330784320831, -0.0026855680625885725, -0.06851695477962494, 0.03304000571370125, -0.04699799045920372, -0.022539110854268074, -0.05174389109015465, -0.0870952308177948, -0.06922543793916702, 0.06075892224907875, -0.14282743632793427, 0.015947243198752403, -0.0830177590250969, -0.08309253305196762, -0.00042474144720472395, 0.01833939738571644, -0.0018147636437788606, 0.018335498869419098, 0.04883463308215141, 0.04338410496711731, -0.026879316195845604, 0.020947018638253212, 0.0432935431599617, 0.08225813508033752, 0.017593931406736374, 0.013066366314888, 0.0316200815141201, -0.04571996256709099, -0.004755966365337372, -0.020838066935539246, -0.00858911033719778, -0.04031398892402649, 0.007135279476642609, -0.02922271005809307, 0.05855538696050644, -5.2526724175550044e-05, 0.07182921469211578, 0.04523640498518944, 0.04095093905925751, 0.06066187843680382, 0.061004895716905594, 0.04711664468050003, 0.01501756627112627, 0.015202967450022697, -0.021044719964265823, -0.0043859598226845264, -0.09066040068864822, 0.03971988707780838, -0.04211614280939102, -0.020019935443997383, -0.016486594453454018, 0.024166902527213097, -0.007959180511534214, -0.03833016753196716, 0.06455763429403305, -0.0544639527797699, 0.032928239554166794, -0.03463543578982353, -0.02146913670003414, 0.02729783020913601, -0.03356456756591797, 0.08821788430213928, -0.09212762117385864, 0.07450215518474579, -0.05236082524061203, -8.638840961991428e-33, -0.04327402636408806, -0.02321387454867363, -0.04144325852394104, 0.08938053250312805, -0.0044251964427530766, -0.03405129164457321, 0.03584625571966171, -0.06483156979084015, 0.07730153203010559, -0.013042086735367775, -0.08251647651195526, 0.0011580941500142217, 0.03739212080836296, -0.028269344940781593, -0.054018814116716385, 0.0458427369594574, -0.03837325796484947, -0.0542127899825573, 0.024163883179426193, 0.017175715416669846, -0.03079099766910076, 0.07104640454053879, -0.14819763600826263, 0.02430635131895542, -0.0039428225718438625, 0.0324208028614521, -0.06019735708832741, 0.06391994655132294, 0.022307714447379112, 0.031385768204927444, 0.0005317487521097064, 0.020115137100219727, -0.045015957206487656, -0.0008780910866335034, 0.010129283182322979, 0.0731964036822319, 0.004850076977163553, -0.015566518530249596, 0.002883294364437461, -0.019863463938236237, 0.07423676550388336, -0.028516311198472977, -0.01646280288696289, -0.0958903506398201, 0.0051592872478067875, 0.048384297639131546, -0.13569913804531097, -0.03789468854665756, -0.049468714743852615, 0.02655956894159317, 0.07166944444179535, 0.026461565867066383, 0.02275208942592144, -0.04464031755924225, -0.09520117938518524, -0.04362868517637253, 0.04744541645050049, 0.01639704406261444, -0.0994347482919693, 0.048308130353689194, 0.04293610900640488, 0.025248132646083832, 0.04466789588332176, 0.08665543794631958, 0.017007621005177498, -0.016911467537283897, 0.05463097244501114, 0.015864752233028412, -0.012884994968771935, -0.1089116707444191, 0.047133274376392365, -0.06499430537223816, 0.022457176819443703, 0.026147404685616493, -0.011666524223983288, 0.07861236482858658, 0.07289193570613861, -0.0670909732580185, 0.026801832020282745, -0.0314183384180069, -0.039075594395399094, 0.021092886105179787, 0.05599534511566162, 0.037076663225889206, -0.08381029218435287, 0.06505415588617325, -0.04816124588251114, 0.022791685536503792, -0.011566919274628162, -0.014365427196025848, -0.041489146649837494, -0.01772359386086464, -0.036155879497528076, 0.09014874696731567, 0.009193318895995617, -5.997332408469447e-08, -0.02917683683335781, -0.0038967239670455456, 0.0557771734893322, 0.07900529354810715, 0.037636857479810715, -0.05687381699681282, -0.017497919499874115, 0.11500659584999084, 0.005651494953781366, 0.0022486322559416294, 0.04158439487218857, 0.006694641429930925, -0.059952512383461, 0.09854843467473984, 0.06556438654661179, 0.0134279141202569, -0.019500719383358955, -0.02464352548122406, 0.01717042736709118, -0.06287781149148941, 0.05152827501296997, 0.021227369084954262, -0.045634593814611435, -0.035247787833213806, 0.07174737751483917, -0.0588565468788147, -0.05137643218040466, 0.05057801306247711, -0.03712767735123634, -0.015687599778175354, -0.04505380988121033, -0.025588488206267357, 0.04061582311987877, -0.031788162887096405, 0.014861315488815308, 0.006179962772876024, -0.07608999311923981, -0.09194056689739227, -0.023628760129213333, 0.05078066885471344, 0.027781616896390915, 0.05480483919382095, 0.0419248603284359, -0.10126537829637527, -0.023597652092576027, -0.026252789422869682, -0.043663401156663895, -0.08667691797018051, 0.045352157205343246, 0.008141185157001019, -0.03812416270375252, 0.012248643673956394, 0.03990582749247551, 0.03279624134302139, 0.0885070338845253, -0.015289871953427792, 0.05363261699676514, -0.013092763721942902, 0.07401999831199646, 0.09546512365341187, 0.03279940038919449, 0.02001124992966652, 0.03525995835661888, 0.009135253727436066]}