{"file_name": "botpenguin.com_glossary_natural-language-programming", "text": "URL: https://botpenguin.com/glossary/natural-language-programming\nNatural Language Programming: Uses & Challenges | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nNatural Language Programming\nTable of Contents\nWhat is NLP (Natural Language Programming)?\nHow does NLP (Natural Language Programming) Work?\nWhy is NLP (Natural Language Programming) Important?\nWho Uses NLP?\nHow is NLP Used?\nNLP vs. NLU\nNLP Challenges\nFrequently Asked Questions\nShare\nLink copied\nWhat is NLP (Natural Language Programming)?\nNatural Language Programming (NLP) is a branch of\nartificial intelligence\n(AI)\nthat focuses on enabling computers to understand and generate human language. It involves developing algorithms, models, and systems that can interpret and respond to natural language input, such as text or speech. NLP encompasses various tasks, including language translation, sentiment analysis, chatbots, and information extraction.\nBy leveraging techniques like machine learning and deep learning, NLP algorithms can learn patterns and structures in language data, allowing them to comprehend and generate human-like responses.\nNLP plays a crucial role in applications like voice assistants, customer support automation, and language processing for large-scale data analysis. It bridges the gap between human communication and computational systems, making it easier for people to interact with machines using everyday language.\nHow does NLP (Natural Language Programming) Work?\nTokenization and Text Preprocessing\nNLP begins with breaking down text into words or tokens for further analysis. Preprocessing steps include removing punctuation and special characters, converting text to lowercase, and removing stop words or common words with little meaning.\nText Vectorization\nTo make text understandable to machines, it is converted into numerical vectors. Techniques like Bag of Words, TF-IDF, and Word Embeddings help in achieving this. These methods give meaning to individual words or phrases based on their frequency or context.\nFeature Extraction and Selection\nNLP algorithms need to identify the most important features from the text data. Dimensionality reduction techniques like PCA and LSA help remove redundant information and reduce the computational burden of large datasets.\nChoosing and Training Machine Learning Models\nDepending on the NLP task, a suitable machine learning model is chosen (e.g., linear regression, naive Bayes, or neural networks). These models are trained using the preprocessed and vectorized text data to learn patterns, classifications, or relationships within the text.\nModel Evaluation and Testing\nThe trained models are tested on unseen data to check their performance on NLP tasks, such as sentiment analysis, summarization, or language translation. Evaluation metrics like accuracy, precision, and recall help determine if models need further tuning or optimization.\nWhy is NLP (Natural Language Programming) Important?\nBridging the Communication Gap\nNLP (Natural Language Programming) is crucial as it allows a seamless interaction between humans and computers by programming in human language, which bridges the communication gap. It enables developers to design software and systems that understand instructions given in a natural language, making interactions simpler and more user-friendly.\nEnhancing User Experience\nThrough NLP, software applications can understand and act upon user commands using natural language syntax. These become highly user-friendly, enhancing overall user experience and ensuring the software is accessible to a wider audience, thanks to the reduced need for technical knowledge.\nPaving the Way for Innovation\nNLP allows the creation of innovative software capable of understanding natural language, such as\nchatbots\nor AI assistants. These systems can perform tasks or answer questions communicated to them without requiring the user to learn any coding or technical language.\nEncouraging Transparency\nIn specific use cases, such as autonomous robots, NLP allows the creation of transparent robots. These robots can reason in a manner transparent to the user, fostering trust between the machine and its human user.\nExpanding Reach and Possibilities\nMoreover, NLP enables the digitization and automation of tasks that traditionally relied solely on human intelligence to understand and process. By handling these tasks more effectively and efficiently, NLP opens up new possibilities across various industries, from customer service to healthcare and education.\nWho Uses NLP?\nTechnology Companies\nMany technology companies integrate NLP into their products and services. Companies like Google, Microsoft, and Amazon utilize NLP to power their voice assistants (Google Assistant, Alexa) and language processing applications. NLP enables these companies to understand user queries, provide accurate responses, and deliver a more natural and intuitive user experience.\nCustomer Service and Support\nBusinesses that offer customer service and support benefit from NLP applications. NLP-powered\nchatbots\nand virtual assistants can handle customer inquiries, provide instant responses, and even escalate complex issues to human agents when necessary. This helps streamline customer service processes, enhance efficiency, and improve customer satisfaction.\nHealthcare and Medical Research\nIn the healthcare industry, NLP is used to analyze and extract information from medical records, research papers, and clinical notes. It helps healthcare professionals in tasks such as patient data analysis, disease diagnosis, and treatment recommendations. NLP also contributes to medical research by automating data extraction, enabling researchers to find relevant information quickly and efficiently.\nE-commerce and Recommendation Systems\nE-commerce\nplatforms utilize NLP to enhance their recommendation systems. By analyzing customer reviews, search queries, and browsing behavior, NLP algorithms can understand customer preferences, identify patterns, and provide personalized product recommendations. This improves the shopping experience, increases customer engagement, and drives sales.\nFinancial Institutions\nFinancial institutions employ NLP to analyze and extract insights from vast amounts of textual data, including news articles, social media, and financial reports. NLP algorithms can detect sentiment, identify market trends, and provide valuable information for investment decision-making. NLP also aids in fraud detection by analyzing patterns in financial transactions and identifying suspicious activities. These are just a few examples of industries and sectors that utilize NLP to enhance their operations, improve user experiences, and gain valuable insights from large volumes of text-based data. The applications of NLP continue to expand as more businesses recognize its potential in various domains.\nHow is NLP Used?\nUnderstanding User Intent and Sentiment Analysis\nNLP is utilized to comprehend user intent and sentiment analysis in various applications. By analyzing the language used by users, NLP algorithms can determine the purpose behind their queries or statements.\nThis helps in providing more accurate and relevant responses, whether it's for customer support, virtual assistants, or social media monitoring. Sentiment analysis enables businesses to gauge customer opinions and sentiments, which can be valuable for reputation management and market research.\nMachine Translation and Language Localization\nNLP plays a crucial role in machine translation, allowing computers to automatically translate text or speech from one language to another. It helps bridge language barriers and facilitates communication between people who speak different languages.\nNLP also enables language localization, which involves adapting software, websites, or content to specific regions or cultural contexts. It ensures that language nuances, idioms, and cultural references are accurately conveyed, providing a more personalized and user-friendly experience.\nInformation Extraction and Text Mining\nNLP techniques are employed to extract relevant information and insights from unstructured text data. Information extraction involves identifying specific entities, relationships, or events within a document or a collection of documents.\nThis is valuable in applications like resume parsing, news aggregation, or extracting structured data from online sources. Text mining, on the other hand, involves analyzing large volumes of text to discover patterns, trends, or hidden knowledge. This is particularly useful in fields like market research, fraud detection, and content analysis.\nNatural Language Generation\nNLP is also used for natural language generation, where machines generate human-like text based on structured data or predefined rules.\nThis is seen in applications like automated report generation, personalized emails, or chatbot responses. By employing NLP techniques, the generated text can be coherent, contextually relevant, and tailored to individual users or situations. Natural language generation enables automation of repetitive writing tasks and facilitates personalized and scalable communication.\nVoice Assistants and Conversational Interfaces\nOne of the most prevalent applications of NLP is in voice assistants and conversational interfaces. NLP algorithms enable devices like smart speakers or mobile assistants to understand and respond to voice commands or queries.\nBy leveraging speech recognition, natural language understanding, and dialogue management, these systems provide hands-free and intuitive interaction. NLP enables voice assistants to perform tasks like setting reminders, answering questions, playing music, or controlling smart home devices. The goal is to create seamless and human-like conversational experiences, enhancing user convenience and productivity.\nNLP vs. NLU\nDefinition of NLP and NLU\nNatural Language Processing (NLP) is a subfield of Artificial Intelligence (AI) focused on understanding, interpreting, and generating human language. It enables computers to process text and speech intelligently and meaningfully. On the other hand, Natural Language Understanding (NLU) is a component within NLP that zeroes in on comprehending the meaning, context, and intent behind human language.\nNLP Techniques\nNLP relies on various techniques such as tokenization,\nstemming\n, syntax analysis, and topic modeling to process and analyze language. These techniques help convert raw text or speech data into structured formats, making them suitable for machine processing and analysis.\nNLU Techniques\nNLU, on the other hand, focuses on extracting specific information, interpreting context, and determining intent. Techniques commonly used in NLU include entity recognition, sentiment analysis, and intent classification.\nNLP Applications\nExamples of NLP applications include translation services, document classification, and sentiment analysis, to name a few. NLP solutions are widely used in chatbots, search engines, voice assistants, and other language-based applications.\nNLU Applications\nNLU applications involve understanding the context and meaning of natural language input, making them vital for applications like voice assistants,\nchatbots\n, and AI-driven customer service systems. The primary purpose of NLU is to comprehend user intentions or requirements better and provide more relevant, accurate information or responses.\nNLP Challenges\nContext and Co-reference Resolution\nUnderstanding context is a critical challenge in NLP. Words can carry different meanings in different contexts, posing difficulty for machines. Co-reference resolution, which is recognizing when two words refer to the same entity in a sentence or across sentences, is another difficult task.\nHandling Ambiguity and Sarcasm\nNatural language is inherently ambiguous, and humans use various clues to disambiguate. NLP struggles with such ambiguities. Detecting sarcasm, which often relies on context and tone of voice, is particularly challenging, especially in written text.\nLinguistic Diversity and Multilingual Support\nSupporting multiple languages is not straightforward due to differences in grammar, dialects, and writing systems. Building models for less resourced languages is even more challenging due to the lack of quality datasets.\nImplicit Information and Inference\nPeople often leave certain information unsaid, assuming it will be implicitly understood based on context. This requires a level of inference that is exceptionally tough for machines as they lack the ability to \"understand\" in the way humans do.\nUnderstanding Human Sentiment\nUnderstanding the emotional tone of text is a complex NLP challenge. The use of colloquial language, ironic statements, emojis, and other nuanced cues to express sentiment often present difficulties for NLP models.\nFrequently Asked Questions\nWhat is Natural Language Programming?\nNatural Language Programming is a type of programming language designed to interact with computers using human-readable language, making programming more intuitive and accessible to non-programmers.\nWhat are some examples of Natural Language Programming?\nExamples of Natural Language Programming systems include ChatScript, Inform 7, and Wolfram Language. These tools allow programming using more human-like syntax.\nHow does Natural Language Programming work?\nNatural Language Programming works by translating human language into commands that a computer can understand and execute. This involves complex linguistic and semantic analysis.\nWhat are the advantages of Natural Language Programming?\nNatural Language Programming can make programming more accessible to non-programmers, enhance software usability, and facilitate more intuitive human-computer interaction.\nAre there limitations to Natural Language Programming?\nWhile powerful, Natural Language Programming has limitations. Notably, the ambiguity and complexity of human language can lead to misunderstandings or incorrect interpretations by the system.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat is NLP (Natural Language Programming)?\nHow does NLP (Natural Language Programming) Work?\nWhy is NLP (Natural Language Programming) Important?\nWho Uses NLP?\nHow is NLP Used?\nNLP vs. NLU\nNLP Challenges\nFrequently Asked Questions\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09827914088964462, -0.06402339041233063, 0.033385250717401505, 0.012064590118825436, -0.016965417191386223, -0.03873676434159279, 0.046423979103565216, 0.07843984663486481, -0.0033733288291841745, 0.019244374707341194, 0.04040591046214104, -0.030920585617423058, 0.01835011877119541, 0.02110360935330391, 0.14001703262329102, -0.0033487274777144194, 0.08046586066484451, -0.09242397546768188, -0.07703889906406403, -0.03676767647266388, -0.004482049494981766, -0.00484990980476141, 0.030235489830374718, -0.020038196817040443, -0.017022449523210526, -0.03506282716989517, -0.035510942339897156, -0.02901860885322094, 0.013325165957212448, -0.06427841633558273, -0.014376597478985786, 0.028172027319669724, 0.01614817976951599, 0.08165392279624939, -0.010591154918074608, -0.022496884688735008, -0.02785300649702549, 0.011035957373678684, 0.06978648155927658, -0.06268318742513657, -0.11870098114013672, -0.07349556684494019, -0.057900749146938324, -0.015164886601269245, 0.10201940685510635, -0.01534895971417427, -0.07866566628217697, 0.011802583932876587, -0.005114726722240448, 0.07928798347711563, -0.10439793020486832, -0.05205703526735306, 0.05747196450829506, 0.04137672483921051, -0.04560844227671623, 0.027247875928878784, -0.023903103545308113, 0.007961121387779713, 0.036288876086473465, -0.016714271157979965, -0.05566111579537392, -0.0029037250205874443, 0.03893208131194115, 0.06397838145494461, -0.04168426990509033, 0.025318175554275513, -0.11640963703393936, 0.0036024609580636024, 0.003742797765880823, -0.03027249127626419, -0.043370313942432404, -0.010986163280904293, -0.03976604342460632, 0.08178160339593887, 0.015076570212841034, -0.034118007868528366, 0.0023139812983572483, -0.010395074263215065, 0.013926654122769833, -0.058997005224227905, -0.020247623324394226, 0.04382631555199623, -0.004103813786059618, 0.07786568999290466, -0.027927841991186142, -0.026863986626267433, 0.007824883796274662, 0.0543774738907814, -0.018996546044945717, 0.0198993943631649, 0.034522395581007004, -0.011600291356444359, 0.05076327174901962, 0.02215532399713993, 0.027382902801036835, 0.01906990446150303, -0.05215418338775635, 0.004369514994323254, -0.06106868013739586, -0.0076049622148275375, -0.0019515190506353974, -0.02808256261050701, -0.04885997250676155, -0.09489468485116959, -0.044587522745132446, 0.008245246484875679, 0.06739950180053711, -0.050610922276973724, 0.12798301875591278, -0.010657615028321743, -0.1201116070151329, -0.05911973863840103, -0.01789235509932041, -0.03956451267004013, 0.003144393442198634, 0.020476216450333595, -0.03316338360309601, 0.04608367756009102, 0.1427469253540039, 0.0319594144821167, 0.044581443071365356, 0.07727573066949844, -0.010500924661755562, -0.005939842201769352, 0.06187763437628746, 0.02486562728881836, 0.006380533333867788, 1.059925991063179e-32, -0.021401014178991318, 0.029733998700976372, -0.073162741959095, 0.09530160576105118, 0.05627023056149483, 0.005113804247230291, 0.02226000465452671, 0.048678185790777206, -0.08177390694618225, -0.04227167367935181, -0.07623513787984848, 0.09680330008268356, -0.0733363926410675, 0.05033619701862335, 0.029851457104086876, -0.07132745534181595, -0.014728887006640434, 0.02181117981672287, 0.04286922514438629, 0.0005536538083106279, 0.07378630340099335, -0.02132520265877247, 0.06626752763986588, 0.08035396039485931, 0.11827970296144485, 0.027493484318256378, 0.07471255213022232, 0.0032128726597875357, 0.057044483721256256, 0.02683769166469574, -0.09605595469474792, -0.010260717011988163, -0.042838115245103836, 0.0219920352101326, -0.02723013423383236, -0.05695003643631935, -0.017424650490283966, -0.10640518367290497, -0.053212229162454605, 0.033549387007951736, -0.13882748782634735, 0.014344706200063229, -0.08452646434307098, -0.054981984198093414, 0.043335922062397, 0.010641741566359997, 0.021690918132662773, 0.020650329068303108, 0.0219559445977211, 0.024417487904429436, -0.04666609689593315, 0.03759453073143959, 0.03495544567704201, 0.0683480054140091, 0.012035991065204144, -0.04670953378081322, 0.02993941493332386, -0.04791594669222832, -0.015530978329479694, -0.028279315680265427, -7.412693230435252e-05, -0.013391729444265366, 0.008573168888688087, -0.021496199071407318, 0.0575919933617115, 0.01690644584596157, 0.043264374136924744, 0.023423409089446068, 0.04370955750346184, 0.03369767963886261, 0.03319098427891731, 0.04922633618116379, -0.029799971729516983, 0.03835171461105347, -0.04986368119716644, 0.011883383616805077, -0.0862584263086319, 0.009493544697761536, -0.027131056413054466, 0.007901224307715893, -0.020485181361436844, -0.034002918750047684, -0.013905934058129787, -0.03077324852347374, 0.058498870581388474, -0.03496319800615311, 0.04001189395785332, -0.03920687362551689, -0.004818672779947519, 0.03272537142038345, -0.030497629195451736, 0.06921198219060898, -0.0648486316204071, 0.06384487450122833, -0.034284934401512146, -8.91140430648453e-33, -0.04973779618740082, 0.012266081757843494, -0.06363299489021301, 0.08667939901351929, -0.01532130315899849, -0.04152916371822357, 0.034114640206098557, -0.03868602588772774, 0.1050809994339943, -0.017667073756456375, -0.09182871878147125, -0.022765425965189934, 0.01974594034254551, -0.020121214911341667, 0.001539277145639062, 0.01715671457350254, -0.06748435646295547, -0.015404372476041317, 0.013124018907546997, 0.02853360027074814, -0.03174416348338127, 0.06463951617479324, -0.13842007517814636, 0.009170090779662132, 0.005072709172964096, 0.035698454827070236, -0.07832686603069305, 0.04066722095012665, 0.010308247059583664, 0.024070536717772484, -0.0150049002841115, 0.012043027207255363, -0.03080035373568535, -0.009904280304908752, 0.014814103953540325, 0.042294979095458984, 0.02092360146343708, -0.02692347951233387, -0.01705547608435154, -0.03919360414147377, 0.1231619343161583, -0.06760528683662415, -0.036578383296728134, -0.06766000390052795, -0.008325579576194286, 0.03733125329017639, -0.16354772448539734, -0.04704996943473816, -0.04881695657968521, 0.030887123197317123, 0.04924320802092552, -0.01828884892165661, 0.04507989063858986, -0.06617933511734009, -0.08049723505973816, -0.044301681220531464, 0.09594208747148514, -0.011103445664048195, -0.07990933209657669, 0.005520452745258808, 0.01924901455640793, 0.00922732800245285, 0.08845741301774979, 0.0497501902282238, 0.03454766422510147, -0.03429318219423294, 0.03382685035467148, 0.03779302164912224, -0.014889632351696491, -0.11185812950134277, 0.06104838475584984, -0.050857365131378174, -0.032089974731206894, 0.0034308377653360367, -0.007500862702727318, 0.10147184878587723, 0.031143199652433395, -0.1112312525510788, -0.006207941100001335, -0.0164975393563509, -0.031272973865270615, 0.01278643123805523, 0.05954376608133316, 0.04559429734945297, -0.08329945057630539, 0.08167212456464767, -0.044851385056972504, 0.026071390137076378, -0.012028254568576813, 0.0194714292883873, -0.04836138337850571, 0.04085567221045494, -0.012368825264275074, 0.11866573989391327, -0.013206669129431248, -5.9078708147808356e-08, -0.03597916290163994, -0.008481485769152641, 0.042836934328079224, 0.04025154560804367, 0.03639576584100723, -0.047958485782146454, -0.041899751871824265, 0.05751824751496315, 0.02242753840982914, 0.03580644726753235, 0.012087171897292137, -0.015310374088585377, -0.06182238087058067, 0.07349610328674316, 0.0655258297920227, 0.010193725116550922, -0.04013354331254959, -0.011490704491734505, 0.018190898001194, -0.03553721681237221, 0.07045301049947739, 0.02057693526148796, -0.03962789103388786, -0.014974365942180157, 0.008344393223524094, -0.06704086810350418, -0.056361518800258636, 0.09317678958177567, -0.025851836428046227, -0.03558814525604248, -0.007176137994974852, -0.026267945766448975, 0.05593906715512276, -0.033698637038469315, 0.009700268507003784, 0.0035531003959476948, -0.06651872396469116, -0.09046584367752075, 0.01616937853395939, 0.03734821453690529, 0.021295463666319847, 0.03739858791232109, 0.01048335712403059, -0.08859013766050339, -0.0261139664798975, -0.043703414499759674, -0.0591178834438324, -0.11350656300783157, 0.038242217153310776, -0.014500804245471954, -0.06502372771501541, 0.008458261378109455, 0.04141420125961304, 0.05248866602778435, 0.09741848707199097, 0.004755422472953796, 0.03832176700234413, -0.006321530323475599, 0.09256639331579208, 0.10398745536804199, 0.014284265227615833, 0.03798014298081398, 0.04225526005029678, 0.02379642240703106]}