{"file_name": "botpenguin.com_platform_chatbot-for-microsoft-teams", "text": "URL: https://botpenguin.com/platform/chatbot-for-microsoft-teams\nMake AI-Driven Microsoft Teams Chatbot & Boost Collaboration\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nCreate AI-Driven Microsoft Teams Chatbot for Peak Collaboration & Productivity\nTransform the way you work, communicate, and collaborate with generative AI chatbots for Microsoft Teams. Streamline,automate routine tasks, and integrate with ChatGPT for conversational experiences.\nGet Started\nFREE\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nCreate a Microsoft Teams Chatbot to Automate Project Management\nFrom automating tasks to seamless integrations, enhance your workflow for maximum productivity and\nwell-informed decision-making. Meet all your deadlines with our Microsoft Teams Chatbot.\nAuto-Reply to Messages\nStreamline communication and keep conversations organized within your team with automated message handling by the chatbot.\nOrganize Group Meetings\nEnable your MS Teams chatbot to schedule and send invites to your team members for group meetings and ensure high availability.\nPermission-Based Actions\nManage team tasks and control access based on user permissions, ensuring data security and workflow management.\nResource Allocation Assistance\nOptimize resource allocation with intelligent suggestions, including knowledge base, training modules, meeting recordings, etc., to maximize efficiency.\nAnswers Common Questions\nInstantly addresses common queries, improving team efficiency and reducing unnecessary communication.\nAdaptive Cards\nEnhance user experiences with interactive and engaging Adaptive Cards, allowing for dynamic content and seamless communication.\nBook a demo\n300Mn\nUsers\n181\nCountries\n48\nLanguages\nReach your customers on scale, save on cost and time\nBuild Generative AI Chatbot for Microsoft Teams\nElevate your Microsoft Teams collaboration to new heights with a Generative AI Bot. Enhance task\nexecution, contextual chatting, and language translation for a seamless team experience.\nIntelligent Task Execution\nThe Generative AI chatbot executes tasks based on user inputs and requirements, like answering queries, conducting surveys, scheduling appointments, sending notifications, etc.\nLearns with Your Data\nPowered with ChatGPT, your chatbot can be trained on your data, including FAQ files, data sets, website, & user interactions for improved performance.\nChatGPT Integration\nLeverage the power of ChatGPT for enhanced conversational experiences. Intrage your MS Teams Chatbot with your preferred ChatGPT model.\nContext-Aware Conversations\nYour generative AI chatbot can easily detect conversation context and tailor its responses accordingly, ensuring a more human chat experience free of logical triggers.\nAutomated Langauge Translation\nSpeak in your customers' tongues with auto-language translation. Your generative AI chatbot detects user input and responds instantly in their language.\nGive Your Bot Your Brand’s Voice\nTailor the tone of your MS Chatbot to match your brand voice to provide personalized experiences for users. It will blend in with the teams like a seasoned member.\nCreate AI MS Teams Bot\nStreamline Your Hiring Process with an HR Chatbot for\nMicrosoft Teams\nOptimize HR Processes with Seamless Automation. Get instant access to historical data & reports, create\nmodules, schedule meetings, and more.\nQuick HR Answers\nMicrosoft Teams chat empowers HR chatbots to respond instantly to common HR queries, ensuring employees access information swiftly.\nRecruitment and Onboarding\nIntegrate HR chatbots with Microsoft Teams to automate recruitment and onboarding. Simplify processes like job applications, interview scheduling, and new employee orientation.\nLeave Applications\nEnable employees to effortlessly apply for leave, check balances, and receive updates on leave applications through HR chatbots on Microsoft Teams.\nImproved HR Interactions\nEnhance employee experience with a seamless interface for HR interactions. HR chatbots offer personalized assistance, guide through HR processes, and provide self-service options.\nStreamlined HR Activities\nLeverage Microsoft Teams chat with HR chatbots to streamline HR tasks, including data management, performance evaluations, and surveys.\nLaunch HR Teams Chatbot\nCreate Your Microsoft Teams Chatbot Now!\nCreate MS Teams Bot Now!\nAutomate Learning & Admissions In Educational\nInstitutions With Microsoft Teams Chatbot\nTransform education with organized learning environments. Use Microsoft Teams Chatbot to facilitate\nvirtual classes, attendance, sharing learning materials, and assignment submission.\nAssisted Learning\nMicrosoft Teams chatbot ensures uninterrupted online education. Schedule live virtual classes, share resources, and engage with students in real-time.\nAssignment Management\nMS Teams Chatbot streamlines assignment management for educational institutions by enabling assignment distribution, submission, grading, and feedback.\nFaculty Collaboration\nTeams chat fosters faculty collaboration. Create dedicated Teams for brainstorming, sharing resources, and staying updated with important news.\nParent-Teacher Meetings\nSchedule virtual parent-teacher meetings through Teams chat, facilitating direct communication between parents and educators for discussing students' progress.\nClassroom Management\nUtilize Teams chat for efficient classroom management – schedule classes, create assignments, track attendance, and ensure a secure learning environment.\nLaunch Teams Chatbot\nEnhancing Healthcare Services with an AI Chatbot for Microsoft Teams\nSmarter patient records, virtual consultations, collaborative care, secure connections, enhanced\ncommunication, and instant appointment booking. Elevate healthcare services With MS Teams bot.\nEfficient Patient Record Management\nEnable healthcare professionals to access and update patient records through the Microsoft Teams chatbot, ensuring accuracy and consistency across the healthcare network.\nSchedule Appointments\nFacilitate audio and video consultations between healthcare professionals, allowing remote clinicians to collaborate effectively and exchange critical patient information.\nCross-Department Collaboration\nHelp different healthcare departments within an organization to talk to each other and share critical details, improving collaboration and resource management.\nSecure Information Exchange\nImplement robust encryption and security measures to protect patient privacy during remote patient care, ensuring compliance with healthcare regulations.\nIntegrate with EMR\nConnect Teams Chatbot with Electronic Medical Records (EMR) systems to easily access and update patient information, ensuring seamless care coordination & record keeping.\nEase Appointment Booking & Enquiries\nImplement AI chatbots to enable health professionals to automate routine inquiries, scheduling appointments, and patient follow-ups.\nGet a Teams Chatbot\nInsure Your Success In the Insurance Industry with\nMicrosoft Teams Chatbot\nEmpowering Insurance Teams with AI-Driven Claims Processing, Policy Management, Underwriting, Agent\nSupport, Customer Service, and Data Analytics.\nClaims Processing\nAutomate routine claims inquiries, status updates, and documentation processes to streamline workflow efficiency.\nPolicy Management\nProvide instant access to policy information, premium payments, and coverage details, improving customer service responsiveness.\nUnderwriting Assistance\nOffer real-time underwriting support, assisting teams with risk assessment, policy evaluation, and decision-making processes.\nAgent Support\nEnable agents to access training resources, marketing materials, and sales support tools directly within Microsoft Teams.\nCustomer Support\nImplement AI-driven chatbots to handle customer inquiries, policy inquiries, and assistance requests, reducing response times and improving satisfaction.\nData Analysis\nIntegrate data analytics capabilities to track insurance trends, customer preferences, and market insights, facilitating informed decision-making for internal teams.\nUse BotPenguin to Scale Microsoft Teams\nLaunch In Minutes\nUtilize the Teams Chatbot to Boost IT Operations Efficiency\nEfficiently manage tickets, automate queries, streamline onboarding, and simplify IT tasks to enhance\nsupport services and empower users with your ChatGPT-driven MS Team Bot\nStreamline Ticket Management\nAuto-Resolve IT Queries\nSeamless Onboarding Automation\nIT Task Automation\nGet a Teams Chatbot\nMeet Your Marketing & Sales Goals With the Generative\nAI Chatbot for MS Teams\nTransform your sales game with effortless collaboration, task automation, and real-time insights—unleash\nthe MS Teams Chatbot with ChatGPT\nSales Proposal Generations\nSales Training and Onboarding\nView Customer Profiles\nSales Activity Tracking\nRevenue Reporting and Analytics\nIntegration with CRMs\nGet a Teams Chatbot\nRender 24/7 Customer Support Using Teams Chatbot\nWith Generative AI\nEnhance customer support efficiency and satisfaction with our MS Teams Chatbot. Streamline\ncommunication, automate processes, access knowledge bases, and resolve issues seamlessly.\nInstant Support With Live Chat\nKnowledge Base Integration\nAdvanced Issue Routing\nCustomer History and Context\nIntegration With Ticketing System\nMultilingual chatbot\nGet a Teams Chatbot\nWhy Choose BotPenguin To Create Your MS Teams Chatbot\nConnect your Microsoft Teams to BotPenguin’s AI chatbot and provide a conversational experience to users.\nApproved 40+ Chat templates\nNo coding required\n80+ Native Integrations\nCustomer Analytics\nWhatsApp Quick replies\nMultiple WhatsaApp Widgets\nMultiple Languages\nGet leads on your email\nFrequently Asked Questions\nHow do I enable a Microsoft Teams Chatbot?\nTo enable a Microsoft Teams Chatbot, follow our integration steps on BotPenguin. Start by accessing the MS Teams Developer Portal, creating a bot, noting the Bot ID, and setting the Webhook endpoint. Generate a secret key in Client Secrets, create a new app in Apps, and submit it for approval in Publish to Org. Finally, configure the Chatbot on BotPenguin using the obtained Bot ID and Secret. Afterward, you can configure the chat flow, personality, and AI features and Integrate ChatGPT.\nWhat is the process for creating a chatbot in Microsoft Teams?\nCreating a Microsoft Teams Chatbot is hassle-free. Access BotPenguin, choose Microsoft Teams as your desired integration, customize your chatbot settings, and deploy for streamlined communication. Check out our user-friendly steps for a seamless process.\nCan you provide an example of a Microsoft Teams chatbot?\nOur Microsoft Teams Chatbot efficiently handles tasks like automated message handling, task automation, people picker functionality, adaptive cards, real-time notifications, and information retrieval. Experience the power of efficiency with a personalized Microsoft Teams Chatbot.\nIs there a tutorial for setting up a chatbot in Microsoft Teams?\nWe offer a comprehensive tutorial on how to set up a generative AI-driven Microsoft Teams Chatbot. Visit our documentation section or contact our support for step-by-step guidance tailored to your needs.\nWhat is the Microsoft Teams Chatbot API, and how can it be utilized?\nThe Microsoft Teams Chatbot API is seamlessly integrated into BotPenguin. Utilize it to enhance conversational experiences and integrate with your preferred ChatGPT model. Leverage the power of APIs for a customized Microsoft Teams Chatbot experience.\nAre there any specific examples of a chatbot-powered Teams Premium in Microsoft?\nTeams Premium uses large language models (LLMs) like ChatGPT-3 for features like live meeting transcriptions, translation captions, and automated meeting summaries.\nWhat is the procedure for creating a Microsoft Teams chatbot?\nThe procedure is simple. Access BotPenguin, navigate to Microsoft Teams integration, customize your chatbot settings, and deploy for streamlined communication. Your Microsoft Teams Chatbot will be up and running in no time!\nHow do you use ChatGPT in Microsoft Teams?\nIntegrate ChatGPT seamlessly with your Microsoft Teams Chatbot on BotPenguin. All you need is API key from your OpenAI’s account and enter it in our GPT integration setup. Choose your preferred ChatGPT model during setup, and experience enhanced conversational capabilities for your team.\nCan you make a Microsoft Teams Chatbot??\nYes, you can create your Microsoft Teams Chatbot effortlessly on BotPenguin powered by ChatGPT. Explore our user-friendly platform, customize your chatbot settings, and witness the transformation in team communication.\nHow do I enable a Microsoft Teams Chatbot powered by Generative AI?\nTo set up a chatbot in Microsoft Teams with Generative AI, use BotPenguin's seamless integration. Follow the provided steps, access chatbot settings to train it with your resources. Integrate with your ChatGPT account for continued generative AI beyond the initial 100 free messages. Your Microsoft Teams Chatbot is now geared up to elevate team communication!\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nCreate Your Microsoft Teams Chatbot Now!\nBook a demo\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09947393089532852, -0.06552132219076157, 0.0195463914424181, 0.007479390595108271, 0.013114014640450478, -0.030929025262594223, 0.028988104313611984, 0.05427855998277664, 0.011318739503622055, 0.033310431987047195, 0.01376658771187067, -0.023521961644291878, 0.0014210359659045935, 0.04171815514564514, 0.12576144933700562, -0.004555437248200178, 0.09449076652526855, -0.12449539452791214, -0.08166905492544174, -0.016535140573978424, -0.026499517261981964, -0.027996845543384552, 0.025968078523874283, -0.027246322482824326, -0.017187193036079407, -0.05074060708284378, -0.036591432988643646, -0.010807766579091549, -0.020126381888985634, -0.05922349914908409, -0.021284155547618866, 0.0101344995200634, 0.022096624597907066, 0.06945152580738068, -0.016954820603132248, -0.04427330195903778, -0.008369662798941135, 0.025644972920417786, 0.07075443863868713, -0.046340279281139374, -0.09074505418539047, -0.06500355154275894, -0.050660282373428345, -0.0018179037142544985, 0.07705732434988022, 0.014202465303242207, -0.06461794674396515, 0.01688201166689396, 0.006885594222694635, 0.12408111244440079, -0.09022103250026703, -0.0681845098733902, 0.0603911466896534, 0.05035166069865227, -0.046072427183389664, 0.03811957314610481, -0.04098081216216087, 0.024788133800029755, 0.03364488482475281, -0.02990051358938217, -0.020117241889238358, -0.02250017784535885, 0.04877333343029022, 0.03112354688346386, -0.04018351808190346, 0.02779628150165081, -0.11362443119287491, 0.009721457026898861, -0.00909942202270031, -0.05112479254603386, -0.017234181985259056, -0.020840737968683243, -0.03180578723549843, 0.042510986328125, 0.011530152522027493, 0.007528374437242746, 0.0062449658289551735, 0.00035975093487650156, 0.04147786274552345, -0.051614418625831604, -0.03587944433093071, 0.03961922973394394, -0.005799371749162674, 0.05734296888113022, -0.03871679678559303, -0.026563555002212524, -0.007391159888356924, 0.03311343491077423, -0.02927817776799202, 0.02517963945865631, 0.012388521805405617, 0.017961151897907257, 0.031920116394758224, 0.026512237265706062, 0.03724392503499985, 0.027249610051512718, -0.05540892109274864, 0.014297248795628548, -0.04193446785211563, -0.002006686059758067, -0.017897186800837517, -0.02956877462565899, -0.05729755386710167, -0.08424892276525497, -0.03719952702522278, 0.0029517237562686205, 0.07556655257940292, -0.02208441123366356, 0.14226293563842773, 0.015109117142856121, -0.11411241441965103, -0.05757137015461922, -0.012364199385046959, -0.028775224462151527, 0.0032658367417752743, 0.006611894350498915, -0.04239987954497337, 0.07053518295288086, 0.12460074573755264, 0.01781264692544937, 0.0701887384057045, 0.03836745396256447, 0.013125578872859478, -0.003134759608656168, 0.08374127000570297, 0.052719198167324066, -0.005181375425308943, 1.0986314200843075e-32, -0.02060287445783615, 0.03678163141012192, -0.0549796037375927, 0.087718665599823, 0.057721156626939774, 0.006080474238842726, 0.03597381338477135, 0.039780061691999435, -0.07804413884878159, -0.05420897156000137, -0.1271027773618698, 0.10361505299806595, -0.04368568956851959, 0.023889262229204178, 0.04121397063136101, -0.10447422415018082, 0.0011916508665308356, 0.019958490505814552, 0.030966205522418022, 0.005209613591432571, 0.0647585541009903, -0.0328138992190361, 0.05431903526186943, 0.0675160139799118, 0.09546899795532227, 0.023278910666704178, 0.07121766358613968, -0.0003199214697815478, 0.07784772664308548, 0.028664294630289078, -0.0936458483338356, 0.021958498284220695, -0.06933005899190903, 0.023740649223327637, -0.029574280604720116, -0.03925072401762009, -0.05548366159200668, -0.10246636718511581, -0.0529627799987793, 0.07734168320894241, -0.1269100159406662, -0.008396199904382229, -0.09112506359815598, -0.09073489904403687, 0.03932925686240196, -0.011209757998585701, -0.0033651746343821287, 0.017435410991311073, 0.03699445351958275, 0.018607566133141518, -0.05617469176650047, 0.02578069269657135, 0.018083516508340836, 0.0636167898774147, -0.003120562992990017, -0.068635493516922, 0.04145964980125427, -0.03174477443099022, -0.00522924168035388, -0.04209659993648529, -0.012448078021407127, -0.03047885373234749, -0.0027192095294594765, -0.015851207077503204, 0.03933750092983246, 0.011397465132176876, 0.07518690824508667, 0.016745494678616524, 0.010362639091908932, 0.017719052731990814, 0.06267936527729034, 0.041579533368349075, -0.004278779495507479, 0.029384758323431015, -0.06002645939588547, 0.025739699602127075, -0.0942995622754097, 0.03618625923991203, -0.03825509175658226, 0.003502415493130684, -0.04449163004755974, -0.009362480603158474, -0.022977901622653008, -0.04885008931159973, 0.046002283692359924, -0.03886723145842552, 0.015383457764983177, -0.03046010620892048, -0.023643363267183304, 0.060346316546201706, -0.05500021204352379, 0.08154965937137604, -0.060946281999349594, 0.09472350031137466, -0.03953606262803078, -8.413387022975467e-33, -0.036556120961904526, 0.012604841962456703, -0.032594624906778336, 0.0719514861702919, 0.027710221707820892, -0.023174531757831573, 0.02742053009569645, -0.05734151601791382, 0.11040228605270386, 0.0069547235034406185, -0.0829801857471466, -0.010548599995672703, 0.01149592362344265, -0.018907839432358742, -0.012901944108307362, 0.019329028204083443, -0.02902498096227646, -0.04937341436743736, 0.03461237996816635, 0.00045702673378400505, -0.016451915726065636, 0.048206690698862076, -0.09937158226966858, 0.015718914568424225, 0.013657606206834316, 0.039632923901081085, -0.08509887009859085, 0.034988243132829666, 0.03435830771923065, 0.01973719522356987, -0.006679081823676825, -0.000866070156916976, -0.032312892377376556, -0.0274661872535944, 0.04254085570573807, 0.05790961533784866, 0.0006195447058416903, -0.02377944439649582, -0.005868823267519474, -0.05784149467945099, 0.10304782539606094, -0.08053530007600784, -0.05390411987900734, -0.05839044600725174, 0.016766291111707687, 0.03630455955862999, -0.12996326386928558, -0.0368955135345459, -0.06262730062007904, 0.052243828773498535, 0.06457065790891647, 0.006255860440433025, 0.043109793215990067, -0.06026427447795868, -0.09635399281978607, -0.03737016022205353, 0.08876228332519531, 0.007375485263764858, -0.08498920500278473, 0.01593048684298992, 0.0313870906829834, 0.012415592558681965, 0.05346515774726868, 0.06529028713703156, 0.02825194038450718, 0.03311779350042343, 0.06730373948812485, 0.057530488818883896, -0.0034002340398728848, -0.08448097854852676, 0.017837928608059883, -0.047741763293743134, -0.016750555485486984, 0.009295444004237652, -0.00128980225417763, 0.0875127762556076, 0.03621114417910576, -0.11811773478984833, 0.00745511706918478, -0.027573147788643837, -0.04877248406410217, 0.004169209394603968, 0.07059815526008606, 0.04246031120419502, -0.07879306375980377, 0.0725470557808876, -0.018531231209635735, 0.01557807344943285, -0.031222030520439148, 0.02873922325670719, -0.04701835662126541, -0.007357630878686905, -4.458065450307913e-05, 0.0981164202094078, 0.018212439492344856, -5.705591732407811e-08, -0.021043431013822556, -0.0029727674555033445, 0.04467669874429703, 0.03587605431675911, 0.015607792884111404, -0.05735703557729721, -0.047698039561510086, 0.08071932196617126, 0.04542418196797371, 0.040938373655080795, 0.012213842011988163, -0.039977096021175385, -0.04747588932514191, 0.07406336814165115, 0.07418100535869598, 0.0024982332251966, -0.049504879862070084, -0.0224933885037899, 0.019107915461063385, -0.04544784873723984, 0.06765298545360565, 0.0035035773180425167, -0.0388212613761425, -0.028112832456827164, 0.017856283113360405, -0.06904532015323639, -0.055758487433195114, 0.08127591758966446, -0.07047348469495773, -0.022415930405259132, -0.03248734399676323, -0.017122985795140266, 0.05377095937728882, -0.014915814623236656, 0.029203729704022408, -0.01412274781614542, -0.06782298535108566, -0.07483553886413574, 0.02447456680238247, 0.044291138648986816, 0.013974091969430447, 0.051249824464321136, 0.007030055858194828, -0.08866823464632034, -0.022599315270781517, -0.05481935665011406, -0.08338568359613419, -0.11861027032136917, 0.016151780262589455, -0.02574070170521736, -0.04963817819952965, 0.02568315900862217, 0.06247977167367935, 0.07479900866746902, 0.07756176590919495, 0.01385345496237278, 0.060662269592285156, -0.01562601886689663, 0.11479660123586655, 0.10704125463962555, 0.027476105839014053, 0.04512190446257591, 0.02901405841112137, 0.0068887509405612946]}