{"file_name": "botpenguin.com_blogs_how-to-find-the-best-white-label-partner-for-your-business", "text": "URL: https://botpenguin.com/blogs/how-to-find-the-best-white-label-partner-for-your-business\nHow To Find The Best White Label Partner For Your Business?\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nHow To Find The Best White Label Partner For Your Business?\nPartner\nUpdated at Oct 11, 2024\n7 min to read\nBotPenguin\nContent Writer, BotPenguin\nBecome a Partner\nTable of Contents\nUnderstanding White Label Partnerships\nSuper Effective Ways to Find the Best White Label Partner for Your Business\nWhite Label Chatbot Platform: Feels like a Million Bucks\nTop 5 White Label Chatbot Platforms\nWrapping up\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nToday, white-label marketing deals with many clients, from one-person consultancies to midsize businesses with 200+ people.\nMost have the same questions and challenges, so they all want to know how to evaluate or identify the right white label partner for their business.\nAdding white-label solutions to your business's existing service offerings will be the best option for your business. You must be thinking, why? 69% of consumers say they interact with an intelligent assistant or chatbot at least once a month. Also, 61% say chatbots in customer service are here to stay.\nWell, the white label provides unique services, working and assisting more with new clients and taking care of existing clients without much effort and investment.\nThere are various ways to explore the white label for business. But with so many agencies, it becomes quite challenging to choose one among all.\nUnderstanding White Label Partnerships\nWhite label partnerships allow companies to rebrand and sell another company's products or services as their own, providing a seamless way to expand offerings and enhance brand value.\nTypes of White Label Partnerships\nWhite label partnerships\ncome in various forms, each catering to different business needs and market demands.\nUnderstanding these types helps you choose the right partner for your business's growth.\nProduct White Labeling\nProduct white labeling involves selling a product produced by one company under another company's brand.\nThis allows businesses to quickly expand their product lines without investing in product development and manufacturing.\nFor example, a retailer can offer a variety of electronics with their branding created by a white label partner specializing in tech manufacturing.\nService White Labeling\nService white labeling focuses on offering services provided by another company but under your brand name.\nThis type of partnership is ideal for businesses looking to expand their service offerings without the overhead of developing these services in-house.\nFor instance, a marketing agency can provide SEO services sourced from a white label partner, enabling them to offer comprehensive digital marketing solutions to their clients.\nSuper Effective Ways to Find the Best White Label Partner for Your Business\nChoosing the right white label partner is crucial for your business success. Here are essential strategies to ensure you select the best partner for your needs.\nMake Your Success the Priority Criteria\nThe white label partner you choose must consider your success to keep it on their priority list. Check several times if your white label partner is aligned with your company's goals.\nDo not move into partnerships with those who do not focus on results. Instead, always focus on selling service because it will not be optimal.\nUnderstand Your Customer's Demand\nSource: Faster Capital\nConsidering the minute qualities like flexibility and consistency can result in choosing the right white label partner for your business.\nCheck the quality of services provided by white label partners. Also, consider the differences, whether it is white-label web development or design or whether it appropriately meets your company's demands.\nThe\nright white label partner\ncan take your business to the top by speeding up modern business practices, using the latest technologies and best practices.\nSo, this step must be taken care of when selecting a white label partner for your business.\nAlways Consider Various Testimonials\nAnother important sign to find the best\nwhite label partner\nfor your business is to consider Google reviews, client testimonials, portfolios, etc.\nLook for a team that preferably has a hundred percent success rate and years of experience in your niche.\nA larger company with better-equipped resources can offer advice and leadership, particularly when it comes to competition and the overall health of your company.\nOpt for Excellent Customer Service\nCustomer service is one of the main factors for any business. Good customer service helps to maintain a good reputation among reviewers. The company or industry will be measured regarding a good relationship with customers.\nWhen choosing white label partners, your digital agency must take a hands-on approach to customer queries. Ensure that your white label partner understands that your clients are your assets.\nLook for Detailed Reporting\nThe white label chatbot platform you choose must have detailed and transparent reporting. Numbers are deciding factors in marketing, such as whether your customer likes or cancels your service after the first few months.\nPlease avoid companies that have multiple products in their portfolio. Sign up with those with expertise in a single product or service.\nTry it Beforehand on a Free Trial\nChoosing a\nwhite label partner\nbased on face value and promises would be intelligent and wise. It would help you find partners or agencies offering you a free sneak peek into the product.\nTheir services may include a free trial, where you can directly communicate with clients, assign tasks to developers, get detailed daily reporting, study their code quality, and much more.\nWhite Label Platform Training\nLook for a white label partner that offers virtual or in-person training to master their platform. Acquiring the unbranded product is fine, but using and maintaining it is tough.\nThat’s why the provider must ensure proper training sessions, assisted onboarding, and continuous maintenance of the white label platform.\nIn the next section, I will present to you an excellent white label niche that’s currently valued at $7.01 billion and projected to reach $20 billion by 2029.\nWhite Label Chatbot Platform: Feels like a Million Bucks\nA\nwhite label chatbot\nplatform allows businesses to offer AI-powered chatbots under their own brand. By partnering with a white label provider, you can quickly integrate advanced chatbot solutions into your product lineup without needing in-house development.\nThis partnership enables you to customize and sell the chatbot services, enhancing your brand’s value and expanding your market reach.\nAs a White label chatbot reseller, you can generate new revenue streams, attract more clients, and provide superior customer service, all while maintaining complete control over your branding and customer relationships.\nReasons to Become a White Label Chatbot Reseller\nThe reason you are looking for is simple: Demand. Let me show you some stats on the incredible market potential of selling chatbots:\n88%\nof users had at least one conversation with a chatbot in 2022.\nBy 2024, chatbots are expected to\nsave businesses up to 2.5 billion hours of work.\n59%\nof customers expect a chatbot to respond within 5 seconds.\n69%\nof consumers were satisfied with their last interaction with a chatbot.\n64%\nof consumers claim that the best feature of chatbots is their availability 24/7.\nThese statistics mention the growing adoption, efficiency, and customer satisfaction associated with chatbots, making them a lucrative addition for businesses. (\nDashly\n)\nWhat are the Key Factors to Remember When Choosing White Label Chatbot Software?\nThe\nwhite-label chatbot\nsoftware must scale your services and help you to reduce expenditure.\nYou must expand your customer base and add another revenue source to your business with white-label chatbot software.\nThe white label chatbot software must develop a strong reputation in the AI business and improve brand value.\nWell, we have clarified that. So, let’s look at some of the best white label partners currently ruling the market.\nTop 5 White Label Chatbot Platforms\nThere are many\nWhite Label Chatbot Platforms\n, but choosing the right one is a bit confusing! Here is a list of 5 best white label chatbot software:\n1. BotPenguin\nBotPenguin\nis a chatbot maker tool and an AI-powered chatbot platform. It is available on various media platforms, including Facebook Messenger, Instagram, Telegram, and SMS.\nBotPenguin's white label program allows businesses to become AI chatbot solution providers by reselling BotPenguin's chatbot platform under their brand. As a white label partner, you'll have the flexibility to personalize branding, domain, pricing, and features.\nWith the ability to create custom subscription plans, offer free trials, and sell add-ons, you can maximize revenue. The program also provides multi-currency options, timely support, and regular updates to ensure seamless operations and customer satisfaction.\nDocument\nSell your 1st Chatbot with\nBotPenguin's White Label Solution\nBecome a Partner\nFeatures of BotPenguin's white label chatbot software\nPersonalized branding with your own logo, domain, and pricing.\nHost your chatbot platform on any preferred domain or subdomain.\nCreate customized subscription plans to maximize revenue potential.\nOffer free trials and sell add-ons for additional revenue.\nAccess to global support with multi-currency options.\nFlexible pricing to suit your business and market needs.\nRegular updates and feature rollouts for continuous improvement.\nComprehensive tech infrastructure, data storage, and security.\nTraining sessions, dedicated support, and detailed documentation.\nSeamless integration with ChatGPT for advanced conversational AI.\nUpon the white label chatbot reseller’s request, BotPenguin also implements custom features into its white label platform, allowing resellers to cater to their client's demands.\nSuggested Reading:\nWhy BotPenguin is the Best White Label Chatbot Platform for you?\n2. Engati\nEngati is a no-code AI Chatbot & Live chat platform. This white-label chatbot platform supports eight major messaging systems: Messenger, Kik, telegram, line, Viber, Skype, Slack, and webchat.\nEngati's white label chatbot platform empowers businesses and agencies to become AI partners by reselling Engati's award-winning chatbot under their brand.\nAs a white label partner, you'll gain access to Engati's agile, ready-to-deploy chatbot solutions, streamlined onboarding, and expert bot-building support.\nWith extensive pre-sales assistance, flexible pricing models, and customizable portals, you can quickly secure new leads and enhance customer satisfaction.\nEngati's robust platform allows you to grow your brand in your local market, offering personalized training and unlimited access to bot starter packs to ensure your success.\nFeatures of Engati's White Label Chatbot Software:\nStreamlined onboarding with starter packs.\nCustomizable partner portals.\nPersonalized training for partners.\nUnlimited access to bot starter packs.\nSupport for local market growth.\n3. IntelliTicks\nThe IntelliTicks\nwhite label chatbot platform\nis designed for digital marketing agencies, IT service companies, and enterprises seeking a comprehensive, branded chatbot solution.\nBy joining this program, you can offer a customized chatbot platform under your brand, complete with your logo, URL, and brand-specific features.\nIntelliTicks provides three flexible plans—Bronze, Silver, and Gold—each tailored to meet different business needs and budgets.\nThese plans offer a range of benefits, including professional support and redeemable credits to cover usage charges for your clients.\nFeatures of Intelliticks White Label Chatbot Software:\nWhite-labeled web application with your brand name and logo.\nWhite-labeled integration apps for seamless brand consistency.\nAndroid and iOS apps white-labeled with your brand.\nRedeemable credits for usage charges on client accounts.\nPriority support during the initial customer onboarding.\nProfessional chatbot development services available.\nFlexible plans with varied benefits to suit your needs.\n4. Wotnot\nWotNot’s white label chatbot platform enables businesses to offer customized chatbot services under their brand, enhancing their service portfolio and driving revenue growth.\nThis platform provides extensive customization, allowing businesses to align the chatbot’s appearance and functionality with their brand identity. Moreover, You can use AI integration to create intelligent chatbots for automated customer engagement.\nWotNot’s platform supports multi-channel deploymentincluding Website, WhatsApp Facebook etc., real-time analytics, and managed hosting, ensuring high availability and performance.\nWith 24/7 support and easy onboarding, WotNot helps businesses deliver a seamless chatbot experience to their clients.\nWotNot's white label chatbot software features:\nCustomize with your logo, domain, colors, and fonts for a fully branded platform.\nManage unlimited customer accounts efficiently.\nEnjoy access to all current and upcoming platform features.\nBuild sophisticated AI chatbots with ChatGPT integration.\nSet your own pricing structures to suit your business model.\nBenefit from 99.99% uptime with our managed hosting services.\nLaunch on a custom sub-domain tailored to your needs.\nEmbed the platform as an iFrame for easy integration with your existing products.\nUtilize APIs to embed platform features directly into your product.\nReceive support to ensure the success of your white-label chatbot platform.\n5. Instabot\nInstabot's White Label Program offers marketing agencies a platform to enhance client engagement and automate communication through sophisticated, brandable chatbots.\nThis platform enables agencies to generate new revenue streams by incorporating comprehensive chatbot strategies tailored for each client, improving metrics like email captures and meeting bookings.\nThe easy-to-use interface allows seamless branding, onboarding, and management of client chatbots, providing valuable analytics to optimize conversation strategies over time.\nWith custom pricing and packages, agencies can offer a scalable, impactful service under their brand.\nFeatures of Instabot's White Label Chatbot Software:\nInstantly apply your branding across the platform in minutes.\nEasily onboard, manage clients and their chatbots.\nOptimize client bots and manage them over time.\nJunior members can easily build and launch chatbots.\nComprehensive bot analytics to show results clearly to clients.\nTrain bots to understand and respond with sophisticated NLP.\nAssist clients' customers any time, improving service availability.\nSimplify scheduling by integrating chatbot to team calendars.\nAnd there you have it. These are the leading white label chatbot platforms, with impressive features that ensure your success in the chatbot marketplace.\nDocument\nReady to Become a Whitelabel Partner?\nTry BotPenguin\nWrapping up\nChoosing the right white label partner is crucial for expanding your business's offerings and enhancing brand value. You can become a successful white label chatbot reseller by considering factors like reputation, product quality, customer support, and alignment with your business goals.\nBotPenguin\nstands out as an ideal\nwhite label partner\n, offering comprehensive chatbot solutions with personalized branding, flexible pricing, and advanced features like\nChatGPT integration\n.\nWith BotPenguin, you can quickly integrate cutting-edge chatbot technology into your services, attract new clients, and boost revenue.\nDon't miss the opportunity to elevate your business with BotPenguin's robust white label chatbot platform. Contact BotPenguin today to get started!\nSuggested Reading:\nGet the Best Whatsapp Whitelabel Chatbot with BotPenguin\nFrequently Asked Questions (FAQs)\nWhat is a white label partnership and how does it benefit my business?\nA white label partnership involves collaborating with a third-party company that offers products or services under your brand name.\nThis allows your business to expand its offerings without investing in product development, saving time and resources.\nWhat factors should I consider when searching for a white label partner?\nWhen looking for\nthe best white label partner,\nconsider their reputation, experience, product quality, pricing, customer support, and alignment with your brand values.\nHow can I ensure the white label partner's products meet my quality standards?\nTo ensure product quality, request samples, testimonials, or case studies from\nthe white label partner.\nConduct thorough research and, if possible, test their products before committing.\nIs it essential for the white label partner to have expertise in my industry?\nWhile industry-specific expertise can be beneficial, it's not always necessary. Some partners may excel in white labeling across various industries, providing a fresh perspective to your business.\nHow do I make money while being a white label chatbot reseller?\nEnsure you have a well-drafted agreement with the partner that clearly outlines intellectual property\nrights, brand guidelines, and confidentiality clauses to safeguard your business interests.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\n11 Reselling Business Ideas that costs less than $250 per Year\nUpdated at Oct 11, 2024\n9 min to read\nRahul Gupta\nAssistant Marketing Manager, BotPenguin\n30 Best Affiliate Programs to Join in 2024\nUpdated at Oct 10, 2024\n15 min to read\nBotPenguin\nContent Writer, BotPenguin\n10 Best White Label Ecommerce Software for Reselling in 2024\nUpdated at Oct 15, 2024\n11 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nUnderstanding White Label Partnerships\nSuper Effective Ways to Find the Best White Label Partner for Your Business\nWhite Label Chatbot Platform: Feels like a Million Bucks\nTop 5 White Label Chatbot Platforms\nWrapping up\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09446518123149872, -0.04537234827876091, -0.007648366037756205, 0.004299228545278311, 0.008216721005737782, 0.007179376669228077, 0.03276760131120682, 0.054289523512125015, -0.037418756633996964, -0.012784893624484539, 0.0196226816624403, -0.012052387930452824, 0.02281184494495392, 0.024605201557278633, 0.1107625663280487, 0.009841023944318295, 0.12194767594337463, -0.08226523548364639, -0.09702277183532715, -0.04353947192430496, -0.030813584104180336, -0.026693599298596382, 0.0388462170958519, -0.03901533782482147, -0.03161757439374924, -0.050230007618665695, -0.015802206471562386, -0.02463511750102043, -0.015376933850347996, -0.06882823258638382, 0.010086681693792343, 0.030467208474874496, 0.035155583173036575, 0.06411155313253403, -0.019964180886745453, -0.055458907037973404, -0.028443528339266777, 0.0027505645994096994, 0.10045123100280762, -0.05751322954893112, -0.07456568628549576, -0.08355534821748734, -0.05703582987189293, -0.008885392919182777, 0.0754353478550911, -0.0011306899832561612, -0.03933350369334221, 0.0052223606035113335, 0.03654677793383598, 0.0803261324763298, -0.11079931259155273, -0.04950685426592827, 0.03092365898191929, 0.05566471815109253, -0.05018709972500801, 0.05740288645029068, -0.025501346215605736, -0.008670293726027012, 0.05049203336238861, -0.020546909421682358, -0.02877805382013321, -0.023529449477791786, 0.04115220904350281, 0.06021108105778694, -0.026188328862190247, 0.024183101952075958, -0.10919281095266342, 0.028576456010341644, -0.03411538153886795, -0.04984551668167114, -0.005744569469243288, -0.032339006662368774, -0.03937288746237755, 0.05811143293976784, 0.009217599406838417, 0.005247445311397314, 0.01756134070456028, -0.009778671897947788, 0.032975200563669205, -0.07615572959184647, -0.026588235050439835, 0.05145111307501793, -0.02863527461886406, 0.07939216494560242, -0.031055990606546402, -0.019070154055953026, 0.01617416925728321, 0.03536677733063698, -0.017373010516166687, 0.021561982110142708, 0.02813759259879589, 0.014570426195859909, -0.002016412327066064, -0.0017092727357521653, 0.018516244366765022, 0.02368348464369774, -0.09281910210847855, -0.002645907923579216, -0.04119880869984627, 0.005427115131169558, -0.020297734066843987, -0.03587651997804642, -0.03377640247344971, -0.07783335447311401, -0.05369963496923447, -0.005988467950373888, 0.07345840334892273, 0.024692747741937637, 0.13879399001598358, 0.028168827295303345, -0.09336180239915848, -0.04750976711511612, -0.012261033989489079, -0.023541979491710663, 0.027219688519835472, -0.007018794771283865, -0.015104224905371666, 0.06238110363483429, 0.14395858347415924, 0.014034411869943142, 0.05352284759283066, 0.061589132994413376, -0.011388936080038548, -0.029475022107362747, 0.05706356093287468, 0.033695098012685776, -0.010329782962799072, 9.160061769301753e-33, -0.024704979732632637, 0.055612172931432724, -0.04106197506189346, 0.08212604373693466, 0.04175829142332077, 0.031940389424562454, 0.007182404398918152, 0.03860900178551674, -0.07733675837516785, -0.019315222278237343, -0.09411334991455078, 0.12915366888046265, -0.06848348677158356, 0.048702266067266464, 0.01545045431703329, -0.0988023430109024, -0.007241185288876295, 0.021101241931319237, 0.027433155104517937, -0.013008760288357735, 0.09742754697799683, -0.014946162700653076, 0.05570667237043381, 0.08242405205965042, 0.1147884652018547, 0.015305749140679836, 0.0686667338013649, 0.02803165465593338, 0.05301986634731293, 0.03422714024782181, -0.07143624126911163, 0.0006215074681676924, -0.04984777048230171, 0.03111511468887329, -0.05389990657567978, -0.03354712948203087, -0.08287259191274643, -0.10358802229166031, -0.07283373922109604, 0.07320407778024673, -0.14601123332977295, 0.023480936884880066, -0.10748843848705292, -0.07090748846530914, 0.01417765486985445, 0.008971195667982101, 0.015110030770301819, -0.0003892272070515901, 0.05372140184044838, 0.023007627576589584, -0.040831614285707474, -0.008147108368575573, 0.033902645111083984, 0.06713283807039261, -0.012843165546655655, -0.023208962753415108, 0.021796774119138718, -0.06617973744869232, -0.004293724428862333, -0.03102860227227211, -0.02346351556479931, -0.024032365530729294, -0.035081785172224045, -0.009825979359447956, 0.046191900968551636, 0.024236753582954407, 0.06434835493564606, 0.030834009870886803, 0.01337707880884409, 0.016649628058075905, 0.0656527504324913, 0.024373820051550865, 0.0059133972972631454, 0.018008964136242867, -0.04512789100408554, 0.02107318490743637, -0.09327532351016998, 0.01467808336019516, -0.044654447585344315, 0.007509731687605381, -0.04832640290260315, -0.006533476058393717, -0.00015684431127738208, -0.007856223732233047, 0.049709755927324295, -0.02129370905458927, 0.034224748611450195, -0.038449328392744064, -0.01630944013595581, 0.06862188875675201, -0.057353269308805466, 0.08741971105337143, -0.06278002262115479, 0.09171745181083679, -0.05147923529148102, -6.775705191141149e-33, -0.05933734029531479, 0.0023300291504710913, -0.003386095864698291, 0.07766134291887283, 0.01797802560031414, -0.03026990219950676, 0.056521862745285034, -0.038529910147190094, 0.10259783267974854, 0.006400366313755512, -0.06654103845357895, -0.01620529778301716, 0.0014115289086475968, -0.022611314430832863, -0.013385467231273651, 0.014986544847488403, -0.04286223649978638, -0.02573501132428646, 0.006413468159735203, 0.02170257270336151, -0.031285613775253296, 0.09293949604034424, -0.12938599288463593, 0.006063018459826708, 0.01840045675635338, 0.05178927257657051, -0.07199990004301071, 0.06156722456216812, 0.026603663340210915, 0.01674380898475647, -0.029369408264756203, 0.022493401542305946, -0.017017800360918045, -0.004911166615784168, 0.02199706807732582, 0.0549846813082695, -0.003682006150484085, -0.023544173687696457, -0.003993924241513014, -0.047341082245111465, 0.08114808797836304, -0.04730457812547684, -0.07715320587158203, -0.05469576269388199, -0.015481773763895035, 0.024915652349591255, -0.1279076635837555, -0.0304776169359684, -0.052893202751874924, 0.03679301217198372, 0.053946878761053085, 0.018876884132623672, 0.0245099738240242, -0.056189797818660736, -0.08289111405611038, -0.04612267017364502, 0.11094130575656891, 0.029820915311574936, -0.08873328566551208, 0.04343608766794205, 0.034626465290784836, 0.036900658160448074, 0.06034250184893608, 0.08899655938148499, 0.04192892834544182, -0.0022260909900069237, 0.0926845446228981, 0.061319079250097275, -0.012717905454337597, -0.11602897197008133, 0.05579526722431183, -0.030579838901758194, -0.026684250682592392, -0.0029316446743905544, -0.024692386388778687, 0.07577104866504669, 0.03723381459712982, -0.10870908945798874, -0.00570665905252099, -0.009229649789631367, -0.03184108808636665, 0.006976627744734287, 0.057818107306957245, 0.051519010215997696, -0.06859209388494492, 0.04970325902104378, -0.036626074463129044, 0.0035196314565837383, 0.00784252304583788, 0.0008447525906376541, -0.09842003136873245, 0.0007285261526703835, -0.03358113765716553, 0.11514728516340256, -0.002410593908280134, -6.074748171158717e-08, -0.04472602158784866, -0.0019167878199368715, 0.058421023190021515, 0.06797166913747787, 0.027414219453930855, -0.028593434020876884, -0.04820727929472923, 0.07339894771575928, 0.03501221537590027, 0.04327268898487091, -0.008612938225269318, -0.0397302582859993, -0.07120922952890396, 0.08496268093585968, 0.049322135746479034, -0.03221003711223602, -0.016407249495387077, -0.016383862122893333, 0.00934056006371975, -0.02219373732805252, 0.04935425892472267, 0.03912987560033798, -0.009892291389405727, -0.03217342868447304, 0.021990222856402397, -0.0749572291970253, -0.02564850077033043, 0.07636149227619171, -0.01751081645488739, -0.0038020811043679714, -0.03157075121998787, -0.029368704184889793, 0.05211067944765091, -0.03100515343248844, 0.006622364278882742, -0.004679023288190365, -0.0693575069308281, -0.059079013764858246, 0.024021724238991737, 0.061497438699007034, -0.005339704919606447, 0.05198075994849205, 0.02052631415426731, -0.09628625214099884, -0.03816613182425499, -0.049814194440841675, -0.09037483483552933, -0.09499792754650116, 0.031160004436969757, 0.011070327833294868, -0.04603234678506851, 0.007117115426808596, 0.04477336257696152, 0.03165517374873161, 0.05276712030172348, -0.011338121257722378, 0.045288119465112686, -0.02012457884848118, 0.08051571249961853, 0.11756572872400284, 0.04329286888241768, 0.010780672542750835, 0.022021623328328133, 0.009997166693210602]}