{"file_name": "botpenguin.com_chatbot-integrations", "text": "URL: https://botpenguin.com/chatbot-integrations\nAI Chatbot Integrations | Connect BotPenguin with your Apps\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nBuild a complete Client Management Ecosystem\nwith all Chatbot Integrations\nSeamlessly integrate your AI chatbot with your pre-existing tools through BotPenguin’s 80+ chatbot integrations,\nincluding CRMs, appointment booking software, marketing tools, and more.\nGet Started FREE!\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nPersonalize your Chatbot with Custom Integrations of your choice\nOur team of developers is dedicated to providing excellence. From niche CRMs to popular ticketing softawares, we can provide integration for any software you want to link with your AI chatbot.\nBuild Free Chatbot\nA massive array of Native Chatbot Integrations\nLeverage 80+ native app chatbot integrations offered by BotPenguin to improve your\nAI chatbot and manage all your workflows seamlessly.\nAll Integrations\nAutomation\nCRM\nCourier Tracking\nCustomer Support\nProductivity\nScheduling\nTask Management\nProductivity\nChatGPT\nChoose AI now, to be the master at what you do and solve every query\nCRM\nHubspot\nElevate customer relationship management with automation, lead management, and sales engagement, optimizing revenue.\nCRM\nBitrix24\nManage projects, improve collaboration, automate tasks and more with the all-in-one CRM software\nScheduling\nAcuity Scheduling\nEnjoy automatic bookings synchronized with your calendar.\nCRM\nChakra CRM\nMerge sales, support, and customer relationships into this immaculate platform\nScheduling\nCalendarHero\nGet hassle-free bookings made and managed automatically!\nCRM\nZoho CRM\nExperience high-performance sales and marketing activities with this user-friendly and scalable platform trusted by 250,000 businesses in 180 countries.\nAutomation\nPabbly\nAutomate workflows effortlessly and connect to diverse applications without coding and automate operations based on triggers or actions with Pabbly.\nAutomation\nZapier\nCreate task sequences between 1000+ apps without coding.\nCustomer Support\nTwilio\nEnable effective communication by opting for Twililo providing robust API's for SMS and Voice calls\nCustomer Support\nVoxloud\nVoice and and messaging solution with real-time analysis.\nCRM\nKylas CRM\nSmart customer engagement with intuitive features and insights\nCRM\nPipedrive\nA better way to track leads, manage contacts forecast sales performance, organize your workflow get CRM pipelined.\nScheduling\nGoogle Calender\nEffortlessly streamline your schedule with automated appointment bookings through Google Calendar integration, making your work hours more efficient and organized.\nProductivity\nGoogle Sheets\nGet your numbers effortlessly get your data organized and synchronized\nCRM\nGoHighLevel\nStreamline your sales and marketing efforts with the full-suite marketing tools to manage leads, book online, and build websites. unlimited contacts, and much more\nAutomation\nFacebook Pixel\nRefine your Facebook advertising activities by measuring the effectiveness of your ads\nProductivity\nGitBook\nIntegrate the bot with the help documentation tool GitBook & Enable the knowledge\nAutomation\nGoogle Analytics\nGet Insights that help you strategize better\nProductivity\nNotion\nVersatile hub with customizable tools to enable answering queries from the database.\nScheduling\nSimplyBook\nAutomaAutomate your booking management process with features such as tailored forms, calendar sync, online payment, and more.\nCRM\nFreshwork CRM\nManage your leads, provide support, and stay ahead of your competitors\nCRM\nDrip CRM\nAutomate sales funnel and nurture leads\nCRM\nAgile CRM\nExcel CRM by automating your sales and services.\nCRM\nCapsule\nSet reminders, get customization, streamline the pipeline & know your customers better\nCRM\nInsightly\nCentralized database to manage leads, campaigns, and tracking sales and engagement\nCRM\nNutshell CRM\nMake every contact, customer, and conversation count with this unified platform for managing leads sales, and customer relations.\nCRM\nOntraport CRM\nBuild, automate, and scale your business seamlessly with this unified solution to fuel your business growth\nCRM\nWebhopers\nGet real-time lead analytics and leverage customer relationship management\nCRM\nEngage Bay\nOne stop solution for all your sales and support teams.\nCustomer Support\nFrontapp\nSmart chat flows, drip campaigns, and omnichannel customer support build better relationships with Frontapp\nCRM\nCopper CRM\nBuild long-lasting customer relationships through real-time interaction and efficiently manage the sales pipeline\nAutomation\nAutopilot\nAccelerate customer journey by providing personal solutions and boosting automation.\nCRM\nSales flare\nEnhance your sales strategy by sending bulk messages, getting sales analytics, tracking emails, and managing leads.\nCRM\nNo CRM\nStand-alone platform to manage sales, marketing, and customer service processes by automating them efficiently\nCustomer Support\nHelprace\nSupports customer support operation with features like ticket management, and resolution\nCRM\nFlowlu\nChoose Flowlu to easily manage Selling, billing, delivery, and support tasks.\nCRM\nPipeline\nSales management software that efficiently manages leads, tracks sales and organizes workflow now grow your business like never before\nAutomation\nSendinblue\nEmpowering your marketing functions with a unified solution for CRM, automated campaigns, messages, and email marketing\nCRM\nJira CRM\nAutomatically synchronize customer information and overcome the organization’s knowledge gap to assist teams in collaborating, planning, and prioritizing work processes.\nCRM\nKarmaCRM\nClose deals, manage operations, build customer relationships, and streamline team workflows\nCustomer Support\nSupportBee\nThe help desk ticket management app allows sorting emails, prioritizing cases, and managing emails efficiently.\nCustomer Support\nLiveAgent\nHelp desk scaleable solution for license management, ticket management, online self-self portals, and live chat create a complete customer service platform that delights your customers and fuels your sales\nCRM\nRecurly CRM\nMake billing faster and smarter with a billing management platform based on recurring revenue models\nCRM\nWealthBox\nThe wealth management platform manages your clients, projects, and tasks\nCustomer Support\nHelpShift\nRobust solution for ticket management, customer communication and tracking support request\nCRM\nClose\na one-stop solution to manage several leads and enhance CRM\nCRM\nNetHunt\nIt serves as a single point of contact for all of your sales processes, from customer data storage to sales forecasting.\nCRM\nPlivo\nComprehensive API's for messaging, voice, and verification, coupled with WhatsApp to provide a proficient customer experience\nCRM\nInfobip CRM\nA versatile multichannel platform integrates SMS, Email, and voice for seamless customer engagement.\nCRM\nApptivo\nOmni-application to support all your functions\nCRM\nOnpipeline\nManage contacts, track leads, automate repetitive tasks, synchronize calendars inflate CRM, and streamline sales processes.\nCustomer Support\nElevio\nA unified platform to handle sales and support functions refining CRM\nCRM\nTeamGate\none-stop platform with comprehensive tools for managing leads, analyzing sales and opportunities\nCRM\nExtraaEdge\nIntegrate BotPenguin to boost conversion rate and save admission efforts\nCustomer Support\nFreshdesk\nSeamless support with automation provides in-depth analysis, customizable ticketing forms, and real-time notifications.\nTask Management\nZoho Projects\nComprehensive solution for project management with Zoho CRM and other tools.\nCustomer Support\nZoho Desk\nStreamline customer support with web-based ticket management, centralizing tickets from all channels in one place and customizing Zoho Desk as per your requirement.\nTask Management\nGoogle Task\nRecord and manage your tasks anywhere, anytime.\nCustomer Support\nZendesk\nA unified ticketing system integrating multiple communication channels at one stop centralizing customer inquiries.\nAutomation\nGetResponse\nDelivers a complete marketing suite for managing workflows, landing pages and email marketing.\nCustomer Support\nGroove\nGenerate more revenue with fast data export, live chat, broadcasts, and automated lead notifications, enable shared inbox and knowledge base.\nCustomer Support\nHelpDocs\nSimplify knowledge base management with a user-friendly interface and inline editing for seamless content creation and customization.\nCustomer Support\nHelpcrunch\nUnite your live and offline support, enable marketing automation for rapid business growth\nCustomer Support\nHelp Desk\nA robust multichannel customer service platform to resolve issues promptly and effectively.\nAutomation\nZingtree\nOptimize customer interaction with ZingTree's customizable scripts, performance monitoring tools, and automated live chat capabilities\nCRM\nFirstPromoter\noptimize affiliate networks and referral campaigns with tracking and managing tools\nCourier Tracking\nShipway\nEffortlessly manage logistics and operations with detailed tracking and enhanced delivery visibility.\nCRM\nLeadSquared\nAutomates all business functions for every industry.Combine lead generation and analytics with CRM for nurturing sales and enhancing performance\nCRM\nSalesforce\nStreamline sales process, automate workflow, and get customer insights\nProductivity\nGoogle Contacts\nGet your contacts synchronized to your bot.\nProductivity\nGoogle Drive\nEffortlessly capture and manage your database to save time\nProductivity\nJoget\nNo code platform enabling efficient workflows and process management\nCustomer Support\nMessageBird\nSend Messages and Emails\nAutomation\nMoEngage\nRevolutionize customer engagement\nCRM\nNimble CRM\nComprehensive sales tracking, task management, customer interactions, and contact management, united on one platform to enrich your business functions.\nProductivity\nOutlook\nSynchronize email, calendar and tasks to optimize your work flow\nAutomation\nViaSocket\nOptimize inventory process, streamline orders, and get insightful analytics.\nCRM\nFirmao CRM\nOne efficient platform to handle customer service, sales processes and client management.\nUnlock maximum potential of BotPenguin by integrating the AI chatbot\nwith your favorite tools and applications\nBook appointments from the chatbot, send leads straight to CRM, generate tickers seamlessly and much more by\nconnecting your AI chatbot with 80+ native app chatbot integrations.\nNever miss out on a potential customer by collecting leads and sending directly to your CRM\nManage the performance of your team easily by integrating with your desired team management tool\nSchedule appointments easily from the chatbot itself and sync it seamlessly with the tool you prefer.\nIntegrate with the ticketing system and let your customers automatically generate tickets to report their issues.\nGet Started FREE\nHow do BotPenguin’s Chatbot Integrations work?\nIt’s simple and has no coding requirements. All you need to do is choose your tool or platform of choice, enter your credentials/API keys, authorize your connection and the integration is complete.\nGet your AI Chatbot Today\nBotPenguin works with Whatsapp too!\nDoing business just got better! BotPenguin can be easily integrated with Whatsapp for\nthe best chatbot experience. Take a peek at the cool stuff!\nI want WhatsApp Bot now\nOptimize Social Media Chatbot with endless integrations!\nTransform your AI chatbot into a powerful social media virtual assistant by integrating it with the most\nsought-after chatbot integrations in the industry!\nWhatsApp\nWhatsApp\nBoost your ecommerce through WhatsApp chatbot and Keep your customers happier with the best customer service.\nTelegram\nTelegram\nYou can now catch up with your customers through this integration for a highly engaging conversation.\nMessenger\nFacebook Messenger\nNever miss out on a potential visitor to your Facebook account through the social media chatbot.\nTry for\nFREE!\nAn AI Chatbot that works flawlessly with CMS and Website Builders\nYou can create gorgeous websites and give your customers conversational\nexperience with BotPenguin’s chatbot integration.\nE-commerce management made easier with Chatbot Integrations\nManage and process product and customer data seamlessly with our simple plug-and-play chatbot integrations.\nDiscover BotPenguin today\nFrequently Asked Questions\nWhat are chatbot integration services?\nChatbot integration services helps you connect your chatbot with various CRMs, appointment booking softwares, and more automating tasks to help save time and cost.\nHow does chatbot integration with website works?\nChatbot integration with the website facilitates real-time engaging conversations with visitors providing excellent customer service.\nCan I use chatbot integration with CRM?\nYes, BotPenguin offers a wide array of CRM softwares available in the market to swiftly integrate with your AI chatbot.\nHow do chatbot integrations enhance customer support?\nChatbot integrations streamline customer support by automating responses, ticketing, and issue resolution.\nDoes BotPenguin provide chatbot integrations with social media channels?\nYes, BotPenguin enables social media chatbot integration through platforms like WhatsApp, Facebook, Instagram, and Telegram.\nDoes BotPenguin offer a free plan for chatbots?\nYes, BotPenguin provides a Free Forever plan with no credit card required. This plan offers essential chatbot features, allowing you to integrate and test the service without any upfront costs.\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nSupercharge your bot with\nchatbot Integrations\nHook me up!\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09993073344230652, -0.07602043449878693, 0.030118761584162712, -0.0020125508308410645, -0.012137814424932003, -0.05325411632657051, 0.029748544096946716, 0.0630047470331192, 0.0026101632975041866, 0.019792161881923676, 0.047094836831092834, -0.02260291576385498, -0.0006137252203188837, 0.0336247943341732, 0.12479322403669357, -0.0038635737728327513, 0.1093367263674736, -0.10072974115610123, -0.07871264219284058, -0.025616254657506943, -0.025850733742117882, -0.011459778994321823, 0.04890505224466324, -0.0373995304107666, -0.024141648784279823, -0.049474675208330154, -0.037505049258470535, -0.006803283002227545, -0.02491973340511322, -0.06933950632810593, -0.003492232644930482, 0.012940457090735435, -0.0034135670866817236, 0.06872116774320602, -0.0205327570438385, -0.05632767826318741, -0.014913799241185188, 0.009686057455837727, 0.07605679333209991, -0.05361587554216385, -0.07048758864402771, -0.07894200086593628, -0.04758497327566147, -0.010037447325885296, 0.08426549285650253, -0.011858080513775349, -0.07841047644615173, 0.01164940930902958, 0.020338911563158035, 0.09326859563589096, -0.06762555241584778, -0.03665872663259506, 0.04938125982880592, 0.06581439822912216, -0.048951707780361176, 0.04718578979372978, -0.036483392119407654, 0.0283520445227623, 0.04552999883890152, -0.0024170326068997383, -0.03175874799489975, 0.002562252338975668, 0.05259501561522484, 0.03710941597819328, -0.04089471325278282, 0.03490287438035011, -0.11104581505060196, 0.0059509300626814365, 0.00142037367913872, -0.03696874901652336, -0.026955673471093178, -0.012460596859455109, -0.06253260374069214, 0.04870040342211723, 0.010820342227816582, -0.02624065987765789, 0.01558906864374876, -0.011268207803368568, 0.01710871420800686, -0.06068204343318939, -0.024635709822177887, 0.04984273016452789, 0.0007229424663819373, 0.04907698929309845, -0.023633357137441635, -0.027164684608578682, -0.003340828698128462, 0.05103543773293495, -0.0243399478495121, 0.012209350243210793, 0.03701262176036835, -0.0021733231842517853, 0.021545568481087685, 0.021530646830797195, 0.02736074849963188, 0.013603702187538147, -0.058298151940107346, 0.023992381989955902, -0.06493408977985382, -0.014541570097208023, -0.013277417048811913, -0.051501113921403885, -0.05744868144392967, -0.07626458257436752, -0.03231801837682724, 0.011023442260921001, 0.059142883867025375, -0.02877974882721901, 0.1399151086807251, 0.016652531921863556, -0.12131993472576141, -0.0744817852973938, 0.01262547355145216, -0.02405572682619095, 0.0019994054455310106, 0.0368187390267849, -0.0412311926484108, 0.05590519309043884, 0.1481488198041916, 0.02499888278543949, 0.06606025993824005, 0.056503552943468094, 0.0052434601821005344, -0.005304222460836172, 0.06379317492246628, 0.03814464807510376, 0.0023251192178577185, 1.1254736131801436e-32, -0.033021505922079086, 0.03170718997716904, -0.0533469095826149, 0.09848765283823013, 0.03461556136608124, 0.017169158905744553, 0.014519212767481804, 0.037813976407051086, -0.07515954971313477, -0.03913476690649986, -0.1130417063832283, 0.10654979199171066, -0.08665575087070465, 0.03598171845078468, 0.025404788553714752, -0.07538265734910965, -0.006078298203647137, 0.025425666943192482, 0.04829452931880951, 0.014541626907885075, 0.0666499137878418, -0.03880252316594124, 0.0542307123541832, 0.08954080939292908, 0.13605883717536926, 0.04461556673049927, 0.08108581602573395, 0.020585760474205017, 0.04751494154334068, 0.03352945297956467, -0.08798688650131226, -0.0005662429612129927, -0.04731064289808273, 0.01900501176714897, -0.03247605636715889, -0.052703630179166794, -0.038475245237350464, -0.10333869606256485, -0.07607711106538773, 0.043968748301267624, -0.1292172074317932, 0.002131151035428047, -0.11441550403833389, -0.07071703672409058, 0.035849329084157944, 0.00013265368761494756, 0.030619464814662933, 0.02901821956038475, 0.0467427633702755, 0.021779567003250122, -0.04721469432115555, 0.021495934575796127, 0.015622171573340893, 0.05945039540529251, -0.010957100428640842, -0.05502641946077347, 0.0311038326472044, -0.03804928436875343, -0.004654256626963615, -0.03987424075603485, -0.01945643126964569, -0.03560839220881462, -0.009584290906786919, -0.02024615928530693, 0.06051885709166527, 0.02127153053879738, 0.04735100641846657, 0.02171442098915577, 0.019361795857548714, 0.02459695190191269, 0.03722100332379341, 0.04525196924805641, -0.011988697573542595, 0.033767927438020706, -0.04833512380719185, 0.01368419174104929, -0.10343710333108902, 0.03539039567112923, -0.034827303141355515, 0.009175204671919346, -0.023242369294166565, -0.016751136630773544, -0.029020389541983604, -0.028422711417078972, 0.07887369394302368, -0.0442226268351078, 0.02328898198902607, -0.042656879872083664, -0.025167156010866165, 0.054110337048769, -0.046007610857486725, 0.09017255157232285, -0.05823631212115288, 0.07344549894332886, -0.03875809907913208, -9.179739544734518e-33, -0.044698357582092285, 0.01922520436346531, -0.045858364552259445, 0.08050982654094696, -0.00348870106972754, -0.02846240997314453, 0.044737305492162704, -0.0451250784099102, 0.11300169676542282, -0.00597709184512496, -0.09541521966457367, -0.017434988170862198, 0.026497984305024147, -0.04388265684247017, -0.016373779624700546, 0.03336307033896446, -0.055063411593437195, -0.03181690722703934, 0.02171519584953785, 0.005764962639659643, -0.025577295571565628, 0.043023258447647095, -0.08439961075782776, 0.002639888320118189, -0.009355376474559307, 0.036908507347106934, -0.07393749803304672, 0.055925797671079636, 0.01792708970606327, 0.013681173324584961, -0.009523195214569569, -0.0003141912166029215, -0.034816112369298935, -0.006549169775098562, 0.02359359711408615, 0.055144619196653366, 0.02976253442466259, -0.0056722573935985565, -0.010833198204636574, -0.07435069233179092, 0.10682670027017593, -0.05624726787209511, -0.05032473802566528, -0.0692017525434494, -0.004651141818612814, 0.031237227842211723, -0.15069137513637543, -0.03941035643219948, -0.0741264671087265, 0.037473294883966446, 0.04276595637202263, -0.0008262322517111897, 0.043749354779720306, -0.050966527312994, -0.08662741631269455, -0.017592767253518105, 0.10459598153829575, 0.018267687410116196, -0.09894334524869919, 0.010830030776560307, 0.04151386022567749, 0.0017267221119254827, 0.06742498278617859, 0.0647684782743454, 0.03118574619293213, -0.009525383822619915, 0.06311285495758057, 0.04459748789668083, -0.0024521034210920334, -0.08675698935985565, 0.04923400655388832, -0.06336755305528641, -0.007943252101540565, -0.00263745104894042, 0.021091943606734276, 0.0872100293636322, 0.04357868432998657, -0.10754285752773285, 0.014729087240993977, -0.028828661888837814, -0.06288030743598938, 0.0036691250279545784, 0.06960812211036682, 0.03299539163708687, -0.07565885037183762, 0.06908558309078217, -0.028724053874611855, 0.016193894669413567, -0.0029342006891965866, 0.01836233027279377, -0.05194735899567604, 0.03516305238008499, -0.016464443877339363, 0.0873824879527092, -0.002810150384902954, -5.745849307459139e-08, -0.020186103880405426, -0.010063845664262772, 0.03720986098051071, 0.02955208159983158, 0.0347173698246479, -0.05300416424870491, -0.05301065370440483, 0.08420319110155106, 0.030149510130286217, 0.03147049993276596, 0.01803872548043728, -0.0275037232786417, -0.05850115790963173, 0.0742926076054573, 0.06578259915113449, -0.02695825695991516, -0.025206509977579117, -0.025769058614969254, 0.014684094116091728, -0.04324758052825928, 0.0568806529045105, 0.01878270134329796, -0.025176934897899628, -0.02830134890973568, 0.019704004749655724, -0.0652122050523758, -0.06610313057899475, 0.07910801470279694, -0.05583229288458824, -0.010380989871919155, -0.02375210076570511, -0.03563825041055679, 0.05146157741546631, -0.03438044711947441, 0.011891970410943031, -0.0052648731507360935, -0.07404433935880661, -0.07999955862760544, 0.01625225506722927, 0.0426848866045475, 0.03290855512022972, 0.016867991536855698, 0.014317752793431282, -0.08731202036142349, -0.018319588154554367, -0.05331585928797722, -0.05201304331421852, -0.11699657142162323, 0.04739493876695633, 0.002938762539997697, -0.05804264917969704, 0.011274696327745914, 0.052844587713479996, 0.03339063748717308, 0.08607333153486252, -0.0022123828530311584, 0.06894247233867645, -0.009192551486194134, 0.09817477315664291, 0.10451220721006393, 0.03123650513589382, 0.027954572811722755, 0.02865457534790039, 0.015594614669680595]}