{"file_name": "botpenguin.com_blogs_what-are-chat-transcripts-on-live-chat", "text": "URL: https://botpenguin.com/blogs/what-are-chat-transcripts-on-live-chat\nWhat are Chat Transcripts on Live Chat?\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nWhat are Chat Transcripts on Live Chat?\nLive Chat\nUpdated at Aug 10, 2024\n10 min to read\nBotPenguin\nContent Writer, BotPenguin\nTry BotPenguin\nTable of Contents\nIntroduction\nWhat are Live Chats?\nWhat are Chat Transcripts?\nHow are Chat Transcripts Used?\nBenefits of Using Chat Transcripts\nHow to Use Live Chat Transcripts for Improving Chatbot Performance?\nConclusion\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nIntroduction\nChat transcripts have become an invaluable asset for businesses that leverage live chat for customer support and sales.\nThese textual records of conversations between customers and agents/chatbots provide a wealth of insights and data that can drive improvements across an organization.\nThe importance of chat transcripts is highlighted by the rapid growth of live chat adoption. According to a report by Zendesk, live chat interactions have surged by 87% since the COVID-19 pandemic began (Source: Zendesk Customer Experience Trends Report 2022).\nChat transcripts enable quality assurance by allowing supervisors to review agent interactions and ensure adherence to standards. Chat transcripts are also a rich training resource. It helps identify areas for coaching by analyzing successful and challenging conversations.\nFurthermore, businesses can mine chat transcripts for valuable analytics on common customer issues, frequently asked questions, and sentiment analysis to optimize support strategies.\nStill wondering what are chat transcripts on live chat? Then this article is for you. Continue reading to know more about chat transcripts.\nWhat are Live Chats?\nLive chats\nhave become a staple in the world of online communication. They provide a convenient and immediate way for customers to connect with support agents or sales representatives through chat windows on websites.\nThis real-time interaction enables quick problem resolution or assistance with inquiries, without the need for lengthy phone calls or waiting for email responses.\nThe process is simple: customers visit a website, click on a chat icon, and are instantly connected with a live agent who is ready to assist them. The chat window allows customers to type their questions or concerns, while agents respond in real-time, addressing their needs. It's a seamless and efficient way to provide assistance and improve customer satisfaction.\nAnswer Your Customers in Real Time\nUsing Live Chat\nTry BotPenguin\nDifferent Use Cases of Live Chat\nThe versatility of\nlive chat\nextends beyond just customer support. While it is commonly used for resolving customer issues, it also serves as a valuable tool for sales inquiries and website navigation.\nCustomer Support\n: Live chats are widely employed by businesses to offer immediate assistance and support to their customers. Whether it's troubleshooting a technical problem, answering product-related questions, or addressing complaints, live chat allows for quick and efficient problem resolution.\nThe ability to chat in real-time enables agents to provide personalized and tailored support, enhancing the overall customer experience.\nSales Inquiries\n: Live chat has also become an excellent channel for sales teams to engage with potential customers. By integrating live chat on their websites, businesses can capture leads and turn website visitors into paying customers.\nAgents can engage with prospects, answer product questions, and even provide recommendations based on their needs and preferences. The live chat feature acts as a catalyst, facilitating the sales process and maximizing conversion rates.\nWebsite Navigation\n: Navigating through a website can sometimes be a challenging task, especially for first-time visitors.\nLive chat\noffers a solution by providing real-time guidance and assistance in finding the desired information or specific products.\nAgents can walk customers through the website, offering step-by-step instructions or locating relevant sections. This feature not only improves user experience but also encourages visitors to explore more, leading to increased engagement and potential conversions.\nWhat are Chat Transcripts?\nChat transcripts are a vital component of the live chat experience. They refer to the complete record of exchanged messages between the customer and the agent during a live chat session. These transcripts capture every detail of the conversation, ensuring that nothing is lost or forgotten.\nIn a chat transcript, you'll find the entire dialogue, starting from the customer's initial query to the agent's response and any subsequent messages. Timestamps indicate the exact timing of each message, which is helpful for tracking response times and maintaining a chronological record of the conversation.\nAdditionally, chat transcripts may include relevant details such as the names of the agents involved. Thus providing a clear reference for future follow-ups or quality assessments.\nChat transcripts serve a variety of purposes. They act as a valuable source of information for agents, allowing them to review previous interactions with a customer and gain insights into their preferences, previous issues, or any relevant history.\nMoreover, chat transcripts enable businesses to analyze customer inquiries and identify patterns or trends. This aids in the optimization of support processes and the development of effective solutions.\nHow are Chat Transcripts Used?\nGiven below are where chat transcripts are used the most:\nCustomer Service Improvement\nChat transcripts play a crucial role in continuously improving\ncustomer service\n. By reviewing past interactions, businesses can identify areas for improvement and train their agents accordingly. Managers can assess agent performance, evaluate response times, and ensure that customers receive prompt and satisfactory resolutions.\nAnalyzing chat transcripts also allows businesses to spot common customer issues and address them proactively. Thus ultimately enhancing the overall quality of service.\nEnhanced Customer Experience\nA seamless and personalized customer experience is vital for any business. Chat transcripts enable businesses to deliver just that. With access to past conversations, agents can refer to previous interactions and tailor their responses to match customers' preferences and history.\nBy understanding customers' needs and preferences, businesses can provide more relevant and targeted recommendations, leading to a higher level of customer satisfaction. In this way, chat transcripts contribute to creating lasting and positive customer experiences.\nInternal Communication and Collaboration\nChat transcripts serve as a valuable resource for internal communication and collaboration within a company. When multiple agents are involved in assisting a customer, transcripts help ensure a smooth handover between agents, maintaining a seamless customer experience.\nAgents can refer to chat transcripts to stay informed about the progress of ongoing conversations, enabling them to provide consistent and accurate responses.\nAdditionally, chat transcripts serve as a knowledge base, allowing agents to share insights and learn from past interactions, fostering teamwork and enhancing overall efficiency.\nAnd taking your first step towards live chat isn't that tough. Meet\nBotPenguin\n- the home of chatbot solutions. With all the heavy work of chatbot development already done for you, deploy chatbots for multiple platforms:\nWhatsApp Chatbot\nFacebook Chatbot\nWordpress Chatbot\nTelegram Chatbot\nWebsite Chatbot\nSquarespace Chatbot\nWoocommerce Chatbot\nInstagram Chatbot\nMS-Teams Chatbot\nShopify Chatbot\nQuality Assurance and Compliance\nMonitoring agent performance and ensuring compliance with company policies is essential for maintaining service standards and adhering to industry regulations. Chat transcripts provide a reliable means to evaluate agent performance.\nManagers can review transcripts and assess important metrics such as response times, resolution rates, and customer satisfaction levels. This evaluation process enables continuous training and development, helping agents enhance their skills and deliver exceptional results.\nFurthermore, chat transcripts can serve legal purposes when handled in accordance with proper consent and regulations. In certain industries, businesses are required to maintain records of communication for compliance and audit purposes. Chat transcripts can be valuable and reliable evidence of customer interactions, ensuring transparency and accountability.\nBenefits of Using Chat Transcripts\nHere are the benefits of using chat transcripts:\nImproved Customer Service\nOne of the primary benefits of using chat transcripts is the significant improvement in customer service.\nBy having a complete record of previous chat interactions, agents can quickly refer back to previous conversations and gain valuable insights into a customer's history and needs. This allows agents to provide more personalized and tailored support, addressing customer concerns with greater accuracy and efficiency.\nCustomers appreciate this level of attentiveness, leading to a more positive\ncustomer service\nexperience overall.\nIncreased Customer Satisfaction\nUsing chat transcripts can greatly contribute to increased customer satisfaction. When agents have access to past conversations, they can easily pick up where previous interactions left off, saving customers from repeating their issues or providing redundant information. This seamless continuity demonstrates that the company values its customers and their time.\nAdditionally, agents can use chat transcripts to anticipate customers' needs and preferences, enabling proactive support that surpasses customer expectations. As a result, customers feel heard, valued, and satisfied with the level of service received.\nEnhanced Agent Training\nChat transcripts serve as a valuable resource for agent training and development. New agents can review chat transcripts to learn from experienced team members and understand the best practices in handling different customer scenarios. They can study successful interactions and adapt those strategies to improve their own performance.\nLikewise, managers can identify gaps in knowledge or areas that need improvement by analyzing chat transcripts. This analysis allows for targeted training sessions, ensuring that agents have the necessary skills to provide exceptional\ncustomer support.\nBoosted Operational Efficiency\nThe use of chat transcripts can significantly boost operational efficiency within a customer support team. Instead of spending time asking customers to repeat their issues or gather additional information, agents can quickly access relevant details from chat transcripts. This reduces handling time and allows agents to resolve customer inquiries with greater speed and accuracy.\nAdditionally, chat transcripts enable agents to easily collaborate with their colleagues by sharing information and insights. This collaboration streamlines customer support processes, reduces duplicate efforts, and enhances overall efficiency.\nSuggested Reading:\n5 Ways to Use Chat Transcripts to Improve Customer Engagement\nHow to Use Live Chat Transcripts for Improving Chatbot Performance?\nUtilizing\nlive chat\ntranscripts is a powerful method to enhance the performance of your chatbot. By analyzing real-time interactions between customers and live chat agents, businesses can glean valuable insights to optimize chatbot functionality. Here's a straightforward guide on how to leverage live chat transcripts for improving chatbot performance:\nCapture and Analyze Customer Conversations\nLive chat transcripts document the ongoing conversations between customers and live chat agents. By capturing these interactions and analyzing the transcripts, businesses can identify common customer queries, recurring issues, and patterns in customer behavior.\nThis analysis enables businesses to understand customer needs better and tailor the chatbot's responses to address prevalent topics effectively.\nIdentify Gaps in Chatbot Knowledge\nLive chat transcripts provide a window into areas where the\nchatbot\nmay lack information or struggle to provide accurate responses. By reviewing chat transcripts, businesses can pinpoint gaps in the chatbot's knowledge base and identify opportunities for improvement.\nThis insight allows businesses to update the chatbot's training data and expand its capabilities to cover a broader range of topics, ensuring more comprehensive and precise responses to customer queries.\nSuggested Reading:\nHere's Why you should choose BotPenguin for Live Chat\nImplement Real-Time Learning\nReal-time learning is a crucial aspect of enhancing\nchatbot\nperformance. By monitoring live chat transcripts as they occur, businesses can capture new scenarios, questions, and customer feedback in real-time. This live data provides immediate insights into customer preferences, emerging trends, and areas for improvement.\nBy incorporating real-time learnings from live chat transcripts, businesses can adapt the chatbot's responses on the fly, ensuring that it remains up-to-date and aligned with customer needs.\nEnhance Contextual Understanding\nLive chat transcripts offer valuable contextual information that can be used to enhance the\nchatbot's\nunderstanding of customer queries.\nBy analyzing previous conversations, businesses can identify contextual cues, references, and nuances that influence customer interactions. This insight allows the chatbot to deliver more relevant and personalized responses by taking into account the context of the conversation.\nEnhancing the chatbot's contextual understanding based on live chat transcripts enables more effective communication and improves the overall customer experience.\nOptimize Response Time and Accuracy\nAnalyzing\nlive chat\ntranscripts can help businesses streamline the chatbot's response time and accuracy. By reviewing past interactions, businesses can identify instances where the chatbot took too long to respond or provided inaccurate information.\nThis analysis allows businesses to optimize the chatbot's algorithms and improve its ability to generate quick and precise responses. Enhancing response time and accuracy based on live chat transcripts ensures a more seamless and efficient customer experience.\nRoute Your Chatbot Conversation to a Human Agent\nUsing BotPenguin’s Live Chat Feature!\nGet Started FREE\nConclusion\nIn conclusion, chat transcripts are a valuable tool in enhancing the performance and effectiveness of live chat and chatbots. These transcripts capture real-time customer interactions and enable businesses to analyze customer behavior, pinpoint areas for improvement, and continuously enhance chatbot performance.\nThe ability to provide a transcript is a key driver of live chat's popularity with customers. A study by Comm100 found that 73% of customers prefer live chat due to the availability of a conversation transcript (Source: Comm100 Live Chat Benchmark Report 2021). Chat transcripts also serve as a reference customers can revisit for solutions, instructions, and records of commitments made during conversations.\nLeveraging chat transcripts yields valuable insights into customer needs and preferences. It enables businesses to optimize chatbot capabilities and deliver exceptional customer experiences.\nTherefore, utilizing chat transcripts in live chat and chatbot interactions is vital for businesses. As it seek to engage customers effectively and leverage real-time feedback to enhance their service offerings.\nAs live chat volumes continue growing, chat transcripts have become an indispensable tool for businesses to deliver quality service, train employees effectively, and gain data-driven insights to improve customer experience.\nSuggested Reading:\nGain a Competitive Edge with Live Chat Software\nFrequently Asked Questions (FAQs)\nAre chat transcripts stored securely and compliant with data privacy regulations?\nYes, reputable live chat platforms ensure that chat transcripts are stored securely using encryption and adhere to strict data privacy regulations such as GDPR and CCPA. Measures are in place to protect sensitive customer information and ensure confidentiality.\nCan chat transcripts be accessed and reviewed by customers after a live chat session?\nSome live chat platforms offer the option for customers to request and receive chat transcripts via email or download them directly from the chat interface. This allows customers to reference previous conversations for their records or follow up on unresolved issues.\nHow long are chat transcripts typically retained by businesses?\nThe retention period for chat transcripts varies depending on business policies and regulatory requirements. Some businesses retain transcripts for a specific duration, such as 30, 60, or 90 days, while others may store them for longer periods for historical or compliance purposes.\nCan chat transcripts be used for training purposes and improving agent performance?\nYes, chat transcripts are valuable training resources for coaching and evaluating live chat agents. Supervisors can review transcripts to assess agent interactions, provide feedback, identify areas for improvement, and develop training programs to enhance agent skills and efficiency.\nWhat are some best practices for managing and organizing chat transcripts effectively?\nBest practices include categorizing transcripts by topic or issue, tagging conversations with relevant keywords or labels, and implementing a centralized system for easy access and retrieval. Regularly archiving or purging old transcripts helps maintain a streamlined and organized transcript database.\nAre chat transcripts compatible with customer relationship management (CRM) systems?\nYes, many live chat platforms offer integrations with CRM systems, allowing businesses to sync chat transcripts with customer profiles and store them alongside other customer data. This integration streamlines data management and enables a more holistic view of customer interactions.\nHow can businesses leverage insights from chat transcripts to improve product development and marketing strategies?\nAnalyzing chat transcripts provides valuable insights into customer preferences, pain points, and frequently asked questions. Businesses can use this information to identify market trends, refine product offerings, tailor marketing messages, and enhance overall customer satisfaction and loyalty.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\nTable of Contents\nIntroduction\nWhat are Live Chats?\nWhat are Chat Transcripts?\nHow are Chat Transcripts Used?\nBenefits of Using Chat Transcripts\nHow to Use Live Chat Transcripts for Improving Chatbot Performance?\nConclusion\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.11016399413347244, -0.05754554271697998, 0.01563308574259281, -0.0009370055049657822, 0.01582309417426586, -0.02888333797454834, 0.02796100452542305, 0.04238509759306908, -0.0016565752448514104, 0.023718373849987984, 0.025327011942863464, -0.017317237332463264, -0.018674589693546295, 0.03001091629266739, 0.09875630587339401, -0.0234987773001194, 0.1041811853647232, -0.11314667761325836, -0.08296062052249908, -0.008898749947547913, -0.008863946422934532, -0.0056358338333666325, 0.04870815947651863, -0.012200329452753067, -0.022583654150366783, -0.03173499554395676, -0.048948489129543304, -0.012537574395537376, -0.02182896062731743, -0.046333011239767075, -0.0009400792769156396, 0.027922187000513077, 0.01394742727279663, 0.05295133218169212, -0.03192398324608803, -0.04869517311453819, -0.014298375695943832, 0.008664707653224468, 0.09019546955823898, -0.041610732674598694, -0.07254736125469208, -0.08570480346679688, -0.03870106860995293, -0.012949783354997635, 0.08128014206886292, -9.09786467673257e-06, -0.07096066325902939, 0.0025217286311089993, 0.008021288551390171, 0.08574655652046204, -0.10190464556217194, -0.03303176537156105, 0.06176023557782173, 0.06099866330623627, -0.05219336599111557, 0.04106290265917778, -0.00805723574012518, 0.04323291778564453, 0.057045828551054, -0.00743927713483572, -0.04702542722225189, -0.025012481957674026, 0.05395180359482765, 0.0507185272872448, -0.039034873247146606, 0.03913704305887222, -0.11119597405195236, 0.010797790251672268, 0.0239581186324358, -0.03592761978507042, -0.043965358287096024, -0.005086819175630808, -0.042367808520793915, 0.06353113055229187, 0.006681716535240412, -0.02664107084274292, 0.012973528355360031, -0.004929192829877138, 0.018741630017757416, -0.060757189989089966, -0.020777609199285507, 0.005769159644842148, 0.0065007805824279785, 0.05265170335769653, -0.03698066249489784, -0.04067545011639595, -0.001886621117591858, 0.03574907034635544, -0.020908817648887634, 0.016436856240034103, 0.023381130769848824, 0.0074104731902480125, 0.03758018836379051, 0.02416013740003109, 0.02402069792151451, 0.027602065354585648, -0.07245785742998123, 0.028567751869559288, -0.04122151434421539, -0.021365705877542496, -0.00018767545407172292, -0.017220327630639076, -0.05612071603536606, -0.07466068863868713, -0.04705111309885979, 0.021438784897327423, 0.06821448355913162, -0.004816025495529175, 0.13662123680114746, 0.024722512811422348, -0.11614027619361877, -0.05311382934451103, 0.013114812783896923, -0.03448355942964554, 0.020658796653151512, 0.022785047069191933, -0.024646298959851265, 0.05226645618677139, 0.12839345633983612, 0.015352713875472546, 0.08172198385000229, 0.04304107278585434, 0.013959825038909912, -0.01809946820139885, 0.07641645520925522, 0.040490612387657166, 0.0059555950574576855, 1.0224834103168182e-32, -0.00972871296107769, 0.03491508588194847, -0.05445625260472298, 0.09486199170351028, 0.01690641976892948, 0.010818076319992542, 0.021912241354584694, 0.038266871124506, -0.05727347359061241, -0.03818819671869278, -0.10262368619441986, 0.09159287810325623, -0.0778849795460701, 0.027726685628294945, 0.011451318860054016, -0.07857513427734375, -0.03692922741174698, 0.012488066218793392, 0.04639105126261711, 0.01963919773697853, 0.08477768301963806, -0.04020531475543976, 0.062564916908741, 0.07798033952713013, 0.1262456476688385, 0.03255530819296837, 0.08840171992778778, -0.005277014337480068, 0.03966974467039108, 0.028335215523838997, -0.11062885820865631, -0.017003949731588364, -0.04433365911245346, 0.0029821288771927357, -0.010573070496320724, -0.03809960186481476, -0.05523538962006569, -0.08669909834861755, -0.07927750796079636, 0.04762392118573189, -0.11715008318424225, -0.013081648387014866, -0.09690600633621216, -0.08668356388807297, 0.031943634152412415, 0.005184845998883247, 0.008046519011259079, 0.028094539418816566, 0.03153446689248085, 0.03554587438702583, -0.03349091857671738, 0.02471354603767395, 0.0061441464349627495, 0.04800870269536972, -0.032132651656866074, -0.029650554060935974, 0.02300949953496456, -0.06760511547327042, 0.006874867249280214, -0.02395680733025074, -0.02637912705540657, -0.04032723233103752, 0.0009470459190197289, -0.030142171308398247, 0.038944948464632034, 0.009771252050995827, 0.04503156244754791, 0.019911224022507668, 0.015768617391586304, 0.02989320084452629, 0.05484294146299362, 0.04218410328030586, 0.012388665229082108, 0.01757119968533516, -0.05047463998198509, 0.04569972679018974, -0.10143327713012695, 0.03854307159781456, -0.05327983200550079, 0.026306767016649246, -0.007263342384248972, -0.014105081558227539, -0.02713383547961712, -0.035892654210329056, 0.0846744179725647, -0.04106210544705391, 0.01649080030620098, -0.04977498948574066, -0.031140075996518135, 0.0653325691819191, -0.038076288998126984, 0.09001356363296509, -0.049383193254470825, 0.048301901668310165, -0.03396615386009216, -7.847429839408722e-33, -0.03674054145812988, 0.03581015393137932, -0.051633644849061966, 0.08098021894693375, 0.00958178099244833, -0.019495150074362755, 0.041742321103811264, -0.02625434473156929, 0.11058533936738968, -0.011801356449723244, -0.09455958753824234, -0.0237826369702816, 0.0008042939007282257, -0.03949635103344917, -0.015573440119624138, 0.027599161490797997, -0.05524226650595665, -0.03554702177643776, 0.027237392961978912, 0.020454375073313713, -0.013355712406337261, 0.051124412566423416, -0.1438688337802887, 0.018922066316008568, 0.0032183872535824776, 0.04149017482995987, -0.06366892158985138, 0.08264940232038498, 0.02437242679297924, 0.016437796875834465, 0.001413901918567717, -0.0038123889826238155, -0.04813237860798836, 0.006946526933461428, 0.03378491476178169, 0.05482502654194832, 0.027136551216244698, -0.009990614838898182, -0.010068855248391628, -0.07380549609661102, 0.10707711428403854, -0.05459775775671005, -0.06799972057342529, -0.07370603084564209, -0.000998991192318499, 0.029665838927030563, -0.1651168018579483, -0.022192982956767082, -0.07766775786876678, 0.05135012045502663, 0.05092477425932884, -0.0028373405802994967, 0.03677358478307724, -0.04278787598013878, -0.07983933389186859, -0.04782428964972496, 0.08623351156711578, 0.03042595274746418, -0.0862124115228653, 0.028452185913920403, 0.042693089693784714, 0.0336422435939312, 0.06117728725075722, 0.06158817932009697, 0.03949929028749466, -0.02517053298652172, 0.07319100946187973, 0.038220830261707306, -0.012805459089577198, -0.09299687296152115, 0.05676168203353882, -0.07462060451507568, -0.013015477918088436, 0.005481857340782881, 0.02335560880601406, 0.09089373797178268, 0.028951695188879967, -0.11326151341199875, -0.0014851350570097566, -0.008648266084492207, -0.04314564913511276, -0.008904945105314255, 0.06386754661798477, 0.06120510771870613, -0.05531888082623482, 0.07876117527484894, -0.03560188040137291, 0.01543306652456522, 0.0021152575500309467, 0.015328138135373592, -0.06046553701162338, 0.018889354541897774, -0.03292703628540039, 0.07972662150859833, 0.017213920131325722, -5.6731582986913054e-08, -0.03587612137198448, -0.010320869274437428, 0.04023648798465729, 0.041265618056058884, 0.025175606831908226, -0.04850706085562706, -0.04102467745542526, 0.07545837759971619, 0.027394643053412437, 0.02668461948633194, 0.01957954466342926, -0.04842119663953781, -0.05258192867040634, 0.07330921292304993, 0.05954283848404884, -0.029910609126091003, -0.05055733397603035, -0.026626326143741608, 0.003517590230330825, -0.04528314992785454, 0.06764151155948639, 0.020469430834054947, -0.02542254328727722, -0.02132098376750946, 0.024842292070388794, -0.07462847232818604, -0.027266090735793114, 0.09502670168876648, -0.052395761013031006, -0.017806973308324814, -0.039645783603191376, -0.027053620666265488, 0.055244479328393936, -0.0377633161842823, 0.021691730245947838, -0.02553420327603817, -0.045610785484313965, -0.08003883808851242, 0.020718611776828766, 0.05575522780418396, 0.005011577624827623, 0.011074519716203213, 0.012978614307940006, -0.09624011814594269, -0.018921202048659325, -0.04699018970131874, -0.07939545065164566, -0.11112508177757263, 0.03197609633207321, 0.005549201741814613, -0.04594084247946739, -0.00038020836655050516, 0.06152256950736046, 0.056073132902383804, 0.10032812505960464, 0.003148092422634363, 0.0660763755440712, 0.0017167810583487153, 0.10351663082838058, 0.11005076766014099, 0.04055957868695259, 0.0511208139359951, 0.02846321277320385, 0.017899878323078156]}