{"file_name": "botpenguin.com_glossary_solid-principles", "text": "URL: https://botpenguin.com/glossary/solid-principles\nWhat are Solid Principles & its implementation | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nSolid Principles\nTable of Contents\nWhat are SOLID Principles?\nWho should use SOLID Principles?\nWhen to use SOLID Principles?\nWhere should SOLID Principles be used?\nWhy use SOLID principles?\nHow To Implement SOLID Principles?\nBest Practices for SOLID Principles\nBest Practices for SOLID Principles\nChallenges in Implementing SOLID Principles\nTrends in SOLID Principles\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nWhat are SOLID Principles?\nSOLID Principles are a set of design principles in object-oriented programming that aim to make software designs more understandable, flexible, and maintainable. Developed by Robert C.\nMartin (often known as Uncle Bob), these principles provide a robust foundation for good software design.\nSingle Responsibility Principle (SRP)\nThe first of the SOLID principles is Single Responsibility Principle. It states that a class should only have one reason to change.\nEssentially, this means a class should only have one job or responsibility to prevent an overlapping of functionality.\nOpen-Closed Principle (OCP)\nThe Open-Closed Principle suggests that software entities (classes, modules, functions) should be open for extension but closed for modification.\nThis principle encourages developers to write code that doesn't need to be changed every time the business requirements change.\nLiskov Substitution Principle (LSP)\nThe Liskov Substitution Principle emphasizes that if a program is using a base class, it should also be able to use its sub-classes without causing any issues or changes in the behavior of the program.\nInterface Segregation Principle (ISP)\nThe Interface Segregation Principle states that no client should be forced to depend on interfaces they don't use.\nThis principle prevents bloated interfaces and reduces the dependencies of a class on unnecessary methods or functions.\nDependency Inversion Principle (DIP)\nDependency Inversion Principle refers to the concept of depending upon abstractions and not concretions.\nThis principle encourages high-level modules to be as independent as possible from the low-level modules.\nWho should use SOLID Principles?\nSOLID Principles are primarily used by programmers and software developers, particularly those working with object-oriented programming.\nThey prove beneficial for any individual or team aiming to create code that is scalable, manageable, and adaptable.\nProgrammers\nProgrammers, particularly those utilizing the object-oriented programming paradigm, are the main users of SOLID principles.\nThey use these principles to code more effectively, making their code easier to manage, scalable, and adaptable.\nSoftware Developers\nSoftware developers, much like programmers, use the SOLID principles in their designing and coding process. This allows them to create high-quality software that is easy to manage, extend, and maintain.\nQuality Assurance Teams\nQuality Assurance\n(QA) teams can also benefit from the SOLID principles. When software abides by these rules, it's more reliable and consistent, making the testing process smoother and more streamlined.\nProject Managers\nProject managers, although not doing the coding themselves, benefit from their team's adherence to the SOLID principles.\nWhen these principles are implemented, the resulting code is clean and manageable, reducing project complexities and helping deliver products on time.\nBusinesses and Organizations\nBusinesses or organizations aiming to develop software that is scalable, maintainable, and dependable should adhere to the SOLID principles.\nIt improves the software development process and increases the software's lifespan.\nGet Your AI based Chatbot with Us!\nGet Started FREE\nWhen to use SOLID Principles?\nSOLID principles can be applied throughout the entire software development lifecycle, but there are moments when they are particularly beneficial.\nSolution Design Phase\nDuring the solution design phase, applying the SOLID principles can guide the formation of classes and interfaces, paving the way for more maintainable and extensible software.\nCoding Phase\nWhile coding, developers can use SOLID principles to write clear, organized, and efficient code. These principles provide a guideline on how to structure and organize the code, promote code reuse, and reduce the code's complexity.\nCode Review Phase\nIn the code review phase, SOLID principles can serve as a quality checklist. Any code exhibiting adherence to these principles is generally considered clean and of high-quality.\nMaintenance Phase\nDuring the maintenance phase, software developed using SOLID principles tends to be easier to refactor, debug, and extend. It's easier to isolate failures and correct them without creating new ones.\nUpgrading or Extending the Software\nWhen you want to upgrade or extend the software, SOLID principles make the process less troublesome. Code extension or modification won't cause system-wide ripple effects.\nWhere should SOLID Principles be used?\nSOLID principles can be applied in any scenario where object-oriented programming is used to design software. They provide a valuable guide for structuring and maintaining clean code.\nObject-Oriented Programming (OOP)\nAs a fundamental concept in OOP, SOLID principles are most effectively applied in an object-oriented environment. They provide developers with a robust conceptual framework for designing program classes and objects.\nSoftware Development Companies\nSoftware development companies utilize the SOLID principles to improve their development processes and enhance code maintainability, reusability, and flexibility.\nPersonal Programming Projects\nEven in personal programming projects, SOLID principles can be employed to practice good coding habits, leading to the creation of quality software.\nTraining and Education\nSOLID principles can be incorporated into training and education programs to teach coding best practices to budding developers.\nOpen-Source Projects\nSOLID principles are often used in open-source projects to ensure that the code is easy to understand, scalable, and maintainable - a crucial factor given the collaborative nature of these projects.\nWhy use SOLID principles?\nThe SOLID principles are central to crafting software that's easy to maintain, understand, and expand. They're a game-changer in improving the quality of code\nEnhancing Code Maintainability\nAdhering to the SOLID principles makes code easier to understand and thus easier to maintain. They promote a high degree of modularity, reducing dependencies on specific modules.\nImproving Scalability\nSOLID principles encourage creating software modules with clear boundaries and specific functions. It results in an architecture that's easier to scale and adapt to changing business requirements.\nPromoting Code Efficiency\nBy keeping classes and methods focused and uncluttered, SOLID principles aid in improving code efficiency, thereby enhancing performance.\nReducing Bugs\nClean, well-structured code tends to have fewer bugs. Strongly adhering to these principles reduces the likelihood of inadvertently introducing new bugs when making changes.\nEncouraging Good Coding Habits\nSOLID principles encourage good coding habits like code reuse, separation of concerns, and easy readability.\nHow To Implement SOLID Principles?\nUnderstanding SOLID principles is one thing, but implementing them in your software development involves some specific strategies.\nMaster the Basic Concept of Each Principle\nFully understanding each SOLID principle is necessary to apply it effectively. The developer should understand the underlying concept of each principle, and how it impacts the code quality.\nApply Each Principle Correctly\nJust knowing the principles is not enough. Developers need to understand how to practically apply them to their code.\nUse Tools and Metrics\nThere are tools available that measure the quality of code, pointing out areas that may violate SOLID principles. These tools act as a guide in applying these principles.\nRegular Code Review\nRegularly reviewing your code to ensure it aligns with SOLID principles is crucial. Code reviews, either self-review or peer-review, can highlight any violation of these principles.\nContinuous Refactoring\nIt's never too late to refactor your code to adhere to SOLID principles. Refactoring helps improve the design of the software, making it more understandable and maintainable.\nBest Practices for SOLID Principles\nGetting the most out of SOLID principles requires following some best practices. These practices will enhance their usefulness and their impact on software quality.\nPractice Regularly\nLike any other skill, mastering SOLID principles needs practice. Regularly using these principles in your coding will gradually make them a part of your coding mindset.\nUse in Combination\nWhile each principle stands on its own, they're most effective when applied together. Combining these principles in your code will result in software that's high-quality, efficient, and maintainable.\nUnderstand the Trade-offs\nWhile SOLID principles generally enhance software quality, there can be trade-offs. There could be increased complexity or an overhead in using interfaces. Understanding these trade-offs helps in their efficient implementation.\nNot a Silver Bullet\nSOLID principles are not a one-size-fits-all solution. They're highly beneficial for maintainability and understandability but don't guarantee the perfect code. Don't apply them blindly, always consider the context.\nContinual Learning\nNew languages and technologies emerge regularly. This could result in updates to or nuances in the application of these principles. So, continual learning is key.\nBest Practices for SOLID Principles\nImplementing SOLID principles effectively requires following some best practices. Here's a deeper look at these practices:\nPractice Regularly\nMastery of SOLID principles is a matter of practice. The more you use these principles in your coding, the more they become a part of your habitual approach to designing software.\nRegular practice will enhance your ability to identify where and how each principle should be applied.\nUse in Combination\nEven though each SOLID principle can stand on its own, their combined application often leads to the most effective designs.\nBy applying them collectively in your code, you can create software that is robust, highly maintainable, and flexible.\nUnderstand the Trade-offs\nWhile using SOLID principles enhances the overall quality of the code, there can be trade-offs such as increased complexity or the overhead of using interfaces.\nUnderstanding these trade-offs can guide the efficient and balanced application of SOLID principles.\nNot a Silver Bullet\nSOLID principles are not a one-size-fits-all solution for all design problems. They are guidelines rather than rules etched in stone.\nWhile they often lead to better code, they should not be applied blindly. Always consider the specific context and requirements of the project.\nContinual Learning\nAs programming languages and methodologies continue to evolve, understanding of how to best apply SOLID principles may also change over time.\nTo stay effective, it’s important not just to learn these principles initially, but to pursue an ongoing learning process.\nChallenges in Implementing SOLID Principles\nWhile the application of SOLID principles contributes to high-quality code, developers may face a few challenges when trying to apply them. Some of those challenges include:\nIncreased Complexity\nImplementation of SOLID principles may result in more complex code structures (like numerous interfaces or classes) which may require additional effort to understand.\nThis increase in complexity might require detailed documentation and could potentially lead to slower development cycles.\nOver-Engineering\nStrict adherence to SOLID principles without considering the scope and requirements of the project may lead to over-engineering.\nToo much abstraction or division of responsibilities, for instance, can make the software harder to understand and maintain without providing significant benefits.\nTime and Effort\nMastering and implementing SOLID principles is a process that requires considerable time and cognitive effort.\nIt’s not just about understanding the principles - it's also about changing how you think about and approach coding.\nDifferent Interpretations\nSOLID principles rely on abstract concepts that can be interpreted differently by different developers. These varying interpretations can sometimes lead to disagreements and misunderstandings within a development team.\nLack of Knowledge\nAs obvious as it may seem, one of the biggest challenges in implementing SOLID principles is a lack of understanding of what these principles really mean and how they should be applied\nTrends in SOLID Principles\nWith the ever-evolving software development industry, the SOLID principles remain a relevant and essential guideline for creating maintainable and extensible software.\nRise in Demand for Quality Software\nWith an increasing demand for quality software, the implementation of SOLID principles is becoming more vital.\nThey are crucial in decreasing code complexity, reducing coupling, and enhancing the software's overall quality.\nUnified Modeling Language (UML)\nUnified Modeling Language has been identified as a useful tool in understanding and implementing SOLID principles.\nIt can be utilized to visually represent the software's design, easing the implementation of these principles.\nAgile Development\nAgile\nsoftware development\nmethodologies emphasize adaptability and efficiency. SOLID principles fit well within Agile, by helping to create software that can easily adapt to changing requirements.\nTest-Driven Development (TDD)\nTest-Driven Development and SOLID principles go hand in hand. By using both TDD and SOLID principles, developers can create more robust, maintainable, and testable code.\nDevSecOps\nIn the era of DevSecOps, where developers, security, and operations collaborate to deliver secure, high-quality software, the SOLID principles play a crucial role in maintaining code quality and reliability.\nConnect, Communicate, Convert\nTry BotPenguin\nFrequently Asked Questions (FAQs)\nWhat does the 'S' in SOLID Principles stand for?\n'S' stands for Single Responsibility Principle, which suggests each class or module in a program should have one specific role or task.\nWhat does the 'O' in SOLID Principles represent?\n'O' stands for Open-Closed Principle. This states that software entities should be open for extension, but closed to modification.\nHow does the 'L' in SOLID Principles enhance flexibility?\n'L' stands for Liskov Substitution Principle, which enhances flexibility by ensuring that subclasses can replace their base classes without impeding functionality.\nWhat role does the Interface Segregation Principle ('I') play in SOLID?\n'I' stands for Interface Segregation Principle, advising that clients should not depend on interfaces they do not use, which enhances code maintainability.\nHow does Dependency Inversion Principle ('D') simplify changes in SOLID?\n'D' represents Dependency Inversion Principle, which advocates for high-level modules not depending on low-level ones directly but on abstractions, simplifying future changes.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat are SOLID Principles?\nWho should use SOLID Principles?\nWhen to use SOLID Principles?\nWhere should SOLID Principles be used?\nWhy use SOLID principles?\nHow To Implement SOLID Principles?\nBest Practices for SOLID Principles\nBest Practices for SOLID Principles\nChallenges in Implementing SOLID Principles\nTrends in SOLID Principles\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.1151278018951416, -0.08034107834100723, 0.021685795858502388, 6.863462476758286e-05, -0.03622717410326004, -0.04556179791688919, 0.04330885037779808, 0.07536616176366806, -0.00863331276923418, 0.03992936387658119, 0.04884492978453636, -0.0019181899260729551, 0.010769020766019821, 0.03321735933423042, 0.12023536115884781, -0.010689182206988335, 0.11753246188163757, -0.09896265715360641, -0.0728142112493515, -0.012282261624932289, 0.0009963582269847393, -0.029248612001538277, 0.04428475350141525, -0.04480567201972008, -0.03183763101696968, -0.026319807395339012, -0.02706439420580864, -0.019094429910182953, -0.00857212021946907, -0.07998330146074295, -0.012364141643047333, 0.03053220361471176, -0.010908220894634724, 0.051560260355472565, -0.017206817865371704, -0.03235265240073204, -0.013641427271068096, 0.02239738032221794, 0.0753362700343132, -0.0476529635488987, -0.0822754055261612, -0.09091571718454361, -0.046711985021829605, -0.013531485572457314, 0.1030062735080719, -0.010370291769504547, -0.06492139399051666, 0.009159919805824757, 0.008983342908322811, 0.07181516289710999, -0.0872977152466774, -0.04673328250646591, 0.0471460297703743, 0.042169105261564255, -0.02447478659451008, 0.027661748230457306, -0.003482573200017214, 0.012589124031364918, 0.03538939356803894, -0.01567540317773819, -0.04143739491701126, 0.01446221861988306, 0.046815261244773865, 0.03833514451980591, -0.010064412839710712, 0.038847554475069046, -0.10984659940004349, 0.012849087826907635, -0.006795522291213274, -0.022674215957522392, -0.01358745712786913, -0.024808228015899658, -0.038985271006822586, 0.07286304980516434, 0.02042829990386963, -0.03494800254702568, -0.005172196310013533, -0.004411522764712572, 0.019048668444156647, -0.0643085464835167, -0.03529665619134903, 0.060534462332725525, -0.004811070393770933, 0.06362614035606384, -0.037096183747053146, -0.020470650866627693, -0.002838378306478262, 0.04244127869606018, -0.02716885320842266, 0.011456073261797428, 0.04656365141272545, 0.012226482853293419, 0.031391970813274384, 0.01218585204333067, 0.02267380990087986, 0.01828484982252121, -0.06456773728132248, 0.015898454934358597, -0.07294371724128723, -0.008855882100760937, 0.004209593869745731, -0.034196123480796814, -0.05598556622862816, -0.0875176414847374, -0.037975192070007324, -0.003962354268878698, 0.06084222346544266, -0.043783288449048996, 0.13820888102054596, 0.003721910063177347, -0.12983542680740356, -0.057116132229566574, -0.014579866081476212, -0.0396832674741745, -0.009257277473807335, 0.0176919586956501, -0.04438570886850357, 0.05126560106873512, 0.15661896765232086, 0.012009009718894958, 0.05186157673597336, 0.06490286439657211, -0.004333986900746822, 0.0012004348682239652, 0.060940999537706375, 0.03306501358747482, 0.003802751423791051, 1.1563883064544036e-32, -0.03627324104309082, 0.0381849929690361, -0.06841634213924408, 0.10472503304481506, 0.031061623245477676, 0.004350995644927025, 0.0175658967345953, 0.039345018565654755, -0.06457143276929855, -0.006724596489220858, -0.09279953688383102, 0.09431089460849762, -0.08523266762495041, 0.045172110199928284, 0.04129055514931679, -0.08830467611551285, -0.020067159086465836, 0.020405009388923645, 0.04515828192234039, 0.0144960293546319, 0.08775781095027924, -0.03328471630811691, 0.06501331180334091, 0.06659497320652008, 0.1368619203567505, 0.04105647653341293, 0.054651010781526566, 0.035816919058561325, 0.03079145960509777, 0.037538643926382065, -0.06980607658624649, 0.013774977996945381, -0.06539727747440338, 0.017780648544430733, -0.05896785855293274, -0.06711149960756302, -0.048311997205019, -0.12263898551464081, -0.07343039661645889, 0.02119205892086029, -0.1351928412914276, 0.005681192502379417, -0.10744814574718475, -0.05481790378689766, 0.05434550344944, 0.022260518744587898, 0.02665265090763569, 0.028336603194475174, 0.03631803020834923, 0.013103214092552662, -0.03185798600316048, 0.040291931480169296, 0.04214012622833252, 0.051199644804000854, -0.00036079558776691556, -0.05115101486444473, 0.04286305606365204, -0.04129774868488312, -0.004610414616763592, -0.019275840371847153, 0.0014984020963311195, -0.014381630346179008, -0.0109505420550704, -0.01891048066318035, 0.054529186338186264, 0.031234771013259888, 0.03334027901291847, 0.025334693491458893, 0.051200512796640396, 0.0068427580408751965, 0.036128852516412735, 0.04860449954867363, -0.024153344333171844, 0.024704229086637497, -0.035680610686540604, -0.005507758352905512, -0.0872005894780159, 0.024259939789772034, -0.03909725323319435, -0.014363751746714115, -0.02414732426404953, -0.008181371726095676, -0.030013011768460274, -0.04711384326219559, 0.044915784150362015, -0.03648027032613754, 0.03776378184556961, -0.0333838127553463, -0.02257377840578556, 0.03246631473302841, -0.05327075347304344, 0.060973167419433594, -0.07152602076530457, 0.0669688731431961, -0.04165240004658699, -9.679617048053758e-33, -0.03640422224998474, 0.007148271892219782, -0.056351661682128906, 0.10142502188682556, 0.00936077069491148, -0.03729451820254326, 0.028467323631048203, -0.06193821504712105, 0.1083461120724678, -0.001966871088370681, -0.09321203827857971, -0.01950916275382042, 0.030207093805074692, -0.029406152665615082, -0.017334282398223877, 0.02260897122323513, -0.08247601240873337, -0.053733132779598236, 0.0207593385130167, 0.012845202349126339, -0.022174736484885216, 0.05405262112617493, -0.10461461544036865, 0.019386252388358116, -0.002180237788707018, 0.04757462814450264, -0.09097149968147278, 0.049306441098451614, 0.02042747102677822, 0.022524394094944, -0.004361308179795742, -0.006110405549407005, -0.005297092255204916, -0.0033355418127030134, 0.010346822440624237, 0.038280144333839417, 0.03279910981655121, -0.008207299746572971, -0.020670803263783455, -0.040785882622003555, 0.10123822838068008, -0.06619418412446976, -0.037768930196762085, -0.07044865190982819, -0.011693459935486317, 0.03613995760679245, -0.15498928725719452, -0.03992697224020958, -0.06411311030387878, 0.039772458374500275, 0.056987516582012177, 0.0026002847589552402, 0.04414483532309532, -0.0502467006444931, -0.0809418335556984, -0.01585203967988491, 0.08530733734369278, 0.002451930893585086, -0.08366657793521881, 0.03455861285328865, 0.03860988840460777, 0.007071599829941988, 0.06675267964601517, 0.08942261338233948, 0.03478803113102913, -0.009227217175066471, 0.04984891414642334, 0.039708156138658524, -0.004365512635558844, -0.09376201778650284, 0.03748416155576706, -0.0397111177444458, 0.003709803568199277, -0.014855346642434597, 0.028374193236231804, 0.08295105397701263, 0.047752123326063156, -0.11612282693386078, 0.0011670039966702461, -0.029943952336907387, -0.06305032223463058, -0.0015749168815091252, 0.04573819041252136, 0.04299880564212799, -0.09372584521770477, 0.07491607964038849, -0.041059792041778564, 0.0007597309886477888, -0.006157119292765856, 0.016195084899663925, -0.04990626126527786, 0.032317016273736954, -0.013187545351684093, 0.0965530052781105, -0.0169601421803236, -6.31666807748843e-08, -0.029344044625759125, 0.0017917824443429708, 0.06952421367168427, 0.0327465645968914, 0.031382761895656586, -0.06952404230833054, -0.028533421456813812, 0.053809620440006256, 0.01721769943833351, 0.033012837171554565, 0.026831338182091713, -0.0175425224006176, -0.05566387623548508, 0.06164860352873802, 0.08247184753417969, -0.019247567281126976, -0.024776922538876534, -0.020295003429055214, -0.0028718740213662386, -0.047639861702919006, 0.08012735098600388, 0.000549051386769861, -0.02904631197452545, -0.03482560068368912, 0.019298871979117393, -0.061645735055208206, -0.07198338210582733, 0.0806507095694542, -0.031935449689626694, 0.0010063886875286698, -0.022736605256795883, -0.03379875794053078, 0.07310763746500015, -0.027259163558483124, 0.007705853786319494, 0.005983475595712662, -0.06990662217140198, -0.07862266153097153, 0.02647211030125618, 0.04943118616938591, 0.007734832353889942, 0.013537533581256866, -0.011571154929697514, -0.07703223079442978, -0.014238297007977962, -0.04180101677775383, -0.07341746985912323, -0.10977466404438019, 0.04048927500844002, 0.0018163856584578753, -0.07140884548425674, 0.0182796698063612, 0.03887881338596344, 0.05502825230360031, 0.08107572793960571, 0.0017494979547336698, 0.0546516515314579, 0.0008429020526818931, 0.09168311208486557, 0.10282276570796967, 0.02317338064312935, 0.02168179489672184, 0.03156063333153725, 0.024472499266266823]}