{"file_name": "botpenguin.com_glossary_messenger-api", "text": "URL: https://botpenguin.com/glossary/messenger-api\nMessenger API: Benefits and Features | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nMessenger API\nTable of Contents\nWhat is a Messenger API?\nWhy Use Messenger APIs?\nWhen to Use Messenger APIs?\nHow to Get Started with Messenger APIs?\nWho can Benefit from Messenger APIs?\nMessenger API Features and Functionalities\nBest Practices for Using Messenger APIs\nUse Cases of Messenger APIs\nFrequently Asked Questions\nShare\nLink copied\nWhat is a Messenger API?\nA Messenger API (Application Programming Interface) is a set of rules and protocols that enables developers to build software applications for messaging platforms. In simple terms, it's like a secret handshake between your app and a messaging service, allowing them to communicate and exchange information. The primary purpose of a Messenger API is to empower businesses and developers to create custom communication solutions, like chatbots and automated messaging systems, that can interact with users on popular messaging platforms.\nMessenger API Platforms (Facebook, WhatsApp, Telegram, etc.)\nThere's a whole host of messaging platforms out there, and many of them offer their own Messenger APIs. Some of the most popular platforms with APIs include:\nFacebook Messenger: With over 1.3 billion monthly active users,\nFacebook Messenger\nis a powerhouse in the messaging world. Its API allows businesses to create custom chatbots and messaging experiences for their customers.\nWhatsApp: As another giant in the messaging arena, WhatsApp offers a\nBusiness API\nthat enables companies to send notifications, provide customer support, and automate conversations.\nTelegram: Known for its focus on privacy and security, Telegram offers a Bot API that allows developers to create and deploy custom bots for various purposes, such as broadcasting messages, handling payments, or providing inline search results.\nWhy Use Messenger APIs?\nSimplify Communication\nMessenger APIs make it easy for businesses to communicate with customers through popular messaging platforms, providing a more convenient and accessible channel for support and engagement.\nAutomate Customer Support\nBy integrating chatbots with Messenger APIs, businesses can automate customer support, handle common queries, and reduce response times, resulting in improved customer satisfaction.\nStreamline Sales and Marketing\nMessenger APIs enable businesses to send targeted marketing messages, promotions, and product recommendations, helping to drive sales and build customer relationships.\nEnhance User Experience\nUsing Messenger APIs, you can create personalized and interactive experiences for users, such as booking appointments, making payments, or providing real-time updates, all within the messaging platform.\nGather Valuable Insights\nBy analyzing the data collected through Messenger APIs, businesses can gain insights into customer behavior, preferences, and feedback, helping to inform future strategies and improvements.\nBoost Customer Retention\nBy offering quick and convenient support through messaging platforms, businesses can improve customer satisfaction and loyalty, encouraging repeat business and positive word-of-mouth.\nSave Time and Resources\nIntegrating Messenger APIs with existing systems can help businesses save time and resources by automating tasks, reducing manual work, and streamlining workflows.\nReach a Wider Audience\nWith billions of users on messaging platforms like Facebook Messenger, WhatsApp, and Telegram, businesses can tap into a vast audience and expand their customer base by leveraging Messenger APIs.\nWhen to Use Messenger APIs?\nCustomer Support and Engagement\nMessenger APIs are a perfect fit for customer support and engagement. By integrating them into your customer support strategy, you can provide instant answers to common queries, offer personalized recommendations, and even troubleshoot issues in real-time. Plus, with the ability to send targeted messages based on user behavior, you can keep your customers engaged and informed without coming across as spammy or intrusive.\nMarketing and Promotion\nWhen it comes to marketing and promotion, Messenger APIs can be a game-changer. By leveraging the power of messaging platforms, you can reach your audience in a more personal and direct way, increasing the chances of conversion. From sending promotional offers and product updates to sharing interactive content like quizzes and surveys, Messenger APIs allow you to create engaging marketing campaigns that resonate with your target audience.\nInternal Team Communication\nDon't forget about your trusty team! Messenger APIs can also be used to streamline internal team communication by creating custom bots and tools that integrate with your existing workflows. Whether it's automating routine tasks, providing real-time updates, or simply making it easier for your team to collaborate, Messenger APIs can help keep your team connected and productive.\nHow to Get Started with Messenger APIs?\nStep 1\nChoosing the Right Platform\nPicking the right messaging platform for your Messenger API is like choosing the perfect ice cream flavor – it all depends on your taste (or in this case, your business needs). When deciding on a platform, consider factors like user base, platform-specific features, and integration capabilities. For instance, if you're targeting a younger audience, facebook messenger\nmight be a better fit, while WhatsApp could be more suitable for international markets. The key is to find a platform that aligns with your target audience and overall business goals.\nStep 2\nSetting Up Webhooks and API Tokens\nOnce you've chosen your platform, it's time to set up webhooks and API tokens. Think of webhooks as a digital Bat-Signal, alerting your application whenever there's a new message or event. To set up webhooks, you'll need to provide a URL where the messaging platform can send these notifications, and make sure your server is set up to handle incoming requests.\nAPI tokens, on the other hand, are like secret passwords that authenticate your application with the messaging platform. To obtain an API token, you'll typically need to create a developer account on your chosen platform and follow their specific instructions. Make sure to keep your API token secure, as it grants access to your messaging integration.\nStep 3\nBuilding and Testing Your First Bot\nNow that you've laid the groundwork, it's time to build and test your first bot. Start by designing a conversation flow that outlines the various interactions your bot will have with users. Then, using your chosen platform's API documentation, write the code for your bot, ensuring it can handle messages, user input, and any other desired functionality.\nOnce your bot is built, put it through its paces by testing it with real users or simulated conversations. This will help you identify any bugs, improve your bot's conversational abilities, and ensure it's ready for prime time.\nWho can Benefit from Messenger APIs?\nBusinesses and E-commerce Platforms\nMessenger APIs can be a game-changer for E-commerce businesses and platforms, helping them enhance customer support, streamline communication, and drive sales. By integrating Messenger APIs, businesses can create personalized shopping experiences, send targeted promotions, and even handle order processing – all through popular messaging platforms.\nDevelopers and Tech Enthusiasts\nFor developers and tech enthusiasts, Messenger APIs offer an opportunity to flex their coding muscles and build innovative solutions for a wide range of use cases. From creating custom chatbots to developing tools that improve internal communication, Messenger APIs provide a versatile and powerful toolkit for tech-savvy individuals.\nNonprofits and Community Organizations\nMessenger APIs aren't just for businesses and developers – they can also benefit nonprofits and community organizations. By leveraging Messenger APIs, these organizations can raise awareness, engage supporters, and even facilitate donations, all through the power of messaging platforms. Plus, with automated bots and messaging systems, nonprofits can focus on making a difference while their Messenger API takes care of the communication.\nMessenger API Features and Functionalities\nSend and Receive Messages\nMessenger APIs enable businesses to send and receive text, images, videos, and other rich media content through messaging platforms, allowing for engaging and interactive communication.\nConversation Management\nMessenger APIs provide tools to manage multiple conversations simultaneously, allowing businesses to handle numerous customer interactions efficiently and effectively.\nChatbot Integration\nMessenger APIs facilitate the integration of chatbots, which can automate routine tasks, answer frequently asked questions, and provide instant support, improving customer experience and reducing agent workload.\nUser Authentication\nMany Messenger APIs offer user authentication features, enabling businesses to verify the identity of users and ensure secure communication.\nMessage Templates and Quick Replies\nMessenger APIs often support message templates and quick replies, allowing businesses to create consistent, personalized, and engaging responses that can be easily reused in different conversations.\nAnalytics and Reporting\nMessenger APIs typically include built-in analytics and reporting tools, helping businesses monitor key performance indicators, such as response times, customer satisfaction, and conversion rates, to optimize their messaging strategies.\nBest Practices for Using Messenger APIs\nOptimize Response Times\nQuickly responding to customer messages is crucial for providing excellent service. Implement automation or chatbots to handle common queries and ensure human agents are available for more complex issues.\nPersonalize Interactions\nUse customer data to personalize your interactions and provide a tailored experience. Address customers by name and reference previous conversations to make the exchange feel more engaging and relevant.\nMaintain Consistency Across Channels\nEnsure a seamless customer experience by maintaining consistency in branding, tone, and messaging across all communication channels, including your website, email, and\nmessenger\nplatforms.\nEnsure Data Security and Privacy\nProtect customer data by adhering to security best practices and complying with relevant privacy regulations. Inform customers about your data usage policies and obtain their consent when necessary.\nMonitor and Measure Performance\nTrack the performance of your Messenger API integrations by analyzing metrics such as response times, customer satisfaction, and conversion rates. Use this data to make improvements and optimize your messaging strategy.\nUse Cases of Messenger APIs\nCustomer Support and Service\nMessenger APIs enable businesses to integrate customer support directly into popular messaging platforms, providing real-time assistance and improving customer satisfaction.\nSales and Lead Generation\nBy leveraging Messenger APIs, businesses can engage with potential customers, answer questions, and guide them through the sales process, resulting in increased leads and conversions.\nChatbots and Automation\nMessenger APIs allow the\ncreation of chatbots\nthat can handle routine tasks, answer frequently asked questions, and provide instant support, reducing the workload on human agents.\nNotifications and Alerts\nUsing Messenger APIs, businesses can send important notifications, such as order updates, appointment reminders, or account alerts, directly to customers through their preferred messaging apps.\nSurveys and Feedback Collection\nMessenger APIs can be utilized to gather customer feedback and conduct surveys through messaging platforms, enabling businesses to gather valuable insights and improve their products or services.\nFrequently Asked Questions\nWhat are Messenger APIs?\nMessenger APIs are application programming interfaces that enable developers to build custom features, integrations, and chatbots for messaging platforms like Facebook Messenger, WhatsApp, and Telegram.\nHow do I get started with Messenger APIs?\nTo get started, choose a messaging platform, create a developer account, and follow their documentation to set up your API credentials and start building your custom solution.\nCan I integrate Messenger APIs with my existing software?\nYes, Messenger APIs can be integrated with your existing software or CRM system, allowing seamless communication and data sharing between the messaging platform and your business tools.\nAre there any limitations to using Messenger APIs?\nMessenger APIs may have rate limits, message sending limits, and platform-specific restrictions. Consult the documentation of the API you're using for detailed information on limitations and best practices.\nIs it possible to build a chatbot using Messenger APIs?\nAbsolutely! Messenger APIs are perfect for building chatbots that can interact with users, answer questions, and perform tasks on messaging platforms, enhancing customer engagement and support.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat is a Messenger API?\nWhy Use Messenger APIs?\nWhen to Use Messenger APIs?\nHow to Get Started with Messenger APIs?\nWho can Benefit from Messenger APIs?\nMessenger API Features and Functionalities\nBest Practices for Using Messenger APIs\nUse Cases of Messenger APIs\nFrequently Asked Questions\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.11367250233888626, -0.06673082709312439, 0.032321419566869736, 0.017392044886946678, -0.012134271673858166, -0.045553579926490784, 0.04360859468579292, 0.06792493909597397, 0.013093861751258373, 0.02292090468108654, 0.047256950289011, -0.02077588066458702, 0.005972381681203842, 0.04073352739214897, 0.14584971964359283, -0.013969143852591515, 0.11606661975383759, -0.11787718534469604, -0.08191259950399399, -0.030644863843917847, -0.017895177006721497, -0.012618727050721645, 0.031166329979896545, -0.019126128405332565, -0.024408742785453796, -0.049764592200517654, -0.0395440012216568, -0.018168270587921143, -0.01239685993641615, -0.054897475987672806, -0.019271202385425568, 0.015269900672137737, 0.0038546023424714804, 0.06675595790147781, -0.03549576550722122, -0.04551578313112259, -0.015193788334727287, 0.010918693616986275, 0.085959292948246, -0.04856609180569649, -0.08204666525125504, -0.07909401506185532, -0.061740778386592865, -0.0028611079324036837, 0.08097083866596222, -0.0019140752265229821, -0.06481866538524628, 0.03369508683681488, 0.0050351242534816265, 0.09692611545324326, -0.07387030124664307, -0.0454159751534462, 0.02262887917459011, 0.0607159286737442, -0.02239188738167286, 0.03409143537282944, -0.04177179932594299, 0.02811494655907154, 0.030746912583708763, 0.0031325374729931355, -0.046854417771101, -0.0062499260529875755, 0.04251225292682648, 0.03304421901702881, -0.03198172524571419, 0.02889082208275795, -0.10988572984933853, -0.020769517868757248, 0.0112490588799119, -0.04106771573424339, -0.031016893684864044, -0.016234537586569786, -0.052726875990629196, 0.05544423311948776, 0.00812368094921112, -0.04511573165655136, 0.011484040878713131, 0.003862683894112706, 0.008480794727802277, -0.06119553744792938, -0.025974195450544357, 0.051164645701646805, -0.0024979261215776205, 0.05833224579691887, -0.031100714579224586, -0.029800502583384514, -0.01706528663635254, 0.03775175288319588, -0.033091627061367035, 0.006999222096055746, 0.03286316990852356, 0.011877759359776974, 0.011119954288005829, 0.01899026148021221, 0.029770812019705772, 0.026091663166880608, -0.06340213865041733, 0.028342299163341522, -0.06818316876888275, -0.003966835327446461, -0.005697255488485098, -0.03411238268017769, -0.061448875814676285, -0.07729791849851608, -0.02265659160912037, 0.010924499481916428, 0.053626202046871185, -0.04202001169323921, 0.1266496330499649, 0.024162959307432175, -0.12764482200145721, -0.05029262974858284, 0.00439830357208848, -0.017313428223133087, 0.012965020723640919, 0.0414055772125721, -0.051046814769506454, 0.06367304921150208, 0.1484372615814209, 0.019838212057948112, 0.06721897423267365, 0.043019142001867294, 0.012483218684792519, 0.0006681722588837147, 0.045165613293647766, 0.032722361385822296, 0.014814229682087898, 1.0521313614912733e-32, -0.03327624127268791, 0.03741547092795372, -0.0446009486913681, 0.10448533296585083, 0.03389356657862663, 0.020685436204075813, 0.020707616582512856, 0.03489711508154869, -0.05958149954676628, -0.04279256984591484, -0.09963420778512955, 0.10509728640317917, -0.07497557997703552, 0.04459758475422859, 0.04483040049672127, -0.07597184181213379, -0.009818756952881813, 0.02375035174190998, 0.05249151587486267, 0.008017238229513168, 0.07758449018001556, -0.04255929961800575, 0.05440148711204529, 0.08895513415336609, 0.13092657923698425, 0.04230496659874916, 0.07053376734256744, 0.019988996908068657, 0.04713780805468559, 0.031204938888549805, -0.09075430780649185, 0.011836899444460869, -0.04898252710700035, 0.021203771233558655, -0.040769290179014206, -0.054037030786275864, -0.04827079921960831, -0.11776816844940186, -0.07259460538625717, 0.031062377616763115, -0.12042130529880524, 0.011838949285447598, -0.12019965052604675, -0.07028216868638992, 0.0096425861120224, 0.011967620812356472, -0.000584303867071867, 0.010125460103154182, 0.03409064933657646, 0.01958526112139225, -0.044526685029268265, 0.028837265446782112, 0.026567503809928894, 0.05720864608883858, -0.009598802775144577, -0.049059972167015076, 0.04046235978603363, -0.03603268042206764, -0.024857452139258385, -0.033891793340444565, -0.015170086175203323, -0.047023706138134, 0.0014358093030750751, -0.023696143180131912, 0.05726807564496994, 0.014175237156450748, 0.04681825637817383, 0.030127955600619316, 0.015538251958787441, 0.031655095517635345, 0.037384387105703354, 0.06377764046192169, -0.01111647766083479, 0.029001375660300255, -0.05441088229417801, 0.010149586014449596, -0.08053481578826904, 0.03522792086005211, -0.04216967150568962, 0.00012666004477068782, -0.018697192892432213, -0.0033554499968886375, -0.0301835797727108, -0.03202294185757637, 0.0578925646841526, -0.032459281384944916, 0.035768624395132065, -0.04143455624580383, -0.015105932019650936, 0.041346725076436996, -0.05489462614059448, 0.08375238627195358, -0.056761231273412704, 0.08184005320072174, -0.051799338310956955, -8.486822359123243e-33, -0.039598070085048676, 0.01291254535317421, -0.046540096402168274, 0.06540296226739883, 0.0014535215450450778, -0.03610575199127197, 0.042090728878974915, -0.03180926665663719, 0.084294892847538, 0.0007646477897651494, -0.10552220046520233, -0.028987132012844086, 0.01668103225529194, -0.02249075099825859, -0.0010880957124754786, 0.03460408374667168, -0.06574571877717972, -0.044280532747507095, 0.010321971960365772, 0.0053083524107933044, -0.02524545043706894, 0.05115014314651489, -0.11419247835874557, -0.00474114203825593, -0.0016889804974198341, 0.034497737884521484, -0.08615132421255112, 0.06222457066178322, 0.0245150588452816, 0.001362369628623128, 0.0010121328523382545, -0.0017477126093581319, -0.028323564678430557, -0.01920502632856369, 0.02658531442284584, 0.04393758997321129, 0.038058388978242874, -0.0013817871222272515, -0.010384736582636833, -0.05105127394199371, 0.10581056028604507, -0.06743636727333069, -0.04279794543981552, -0.06627846509218216, 0.007780615705996752, 0.04287981986999512, -0.12901152670383453, -0.03520667180418968, -0.07889636605978012, 0.03134652599692345, 0.07478340715169907, -0.010925359092652798, 0.039450209587812424, -0.0337771438062191, -0.09867454320192337, -0.03286094591021538, 0.10093372315168381, 0.010049439035356045, -0.077128104865551, -0.0077440463937819, 0.022144420072436333, -0.010237181559205055, 0.06476213783025742, 0.07650888711214066, 0.02074849046766758, -0.018337439745664597, 0.061106517910957336, 0.03790381923317909, 0.0012759045930579305, -0.06822551786899567, 0.04406334459781647, -0.06875671446323395, -0.015336393378674984, 0.0030410452745854855, 0.01765427179634571, 0.09693168103694916, 0.04010627791285515, -0.12081202864646912, -0.0017450216691941023, -0.019818540662527084, -0.06598374992609024, 0.008322960697114468, 0.06783435493707657, 0.04687446728348732, -0.07813139259815216, 0.0604206807911396, -0.013901881873607635, 0.02900845743715763, -0.0037203768733888865, 0.012537466362118721, -0.0384196974337101, 0.024339647963643074, -0.024778498336672783, 0.10229890793561935, 0.016350680962204933, -5.742217368265301e-08, -0.03769918531179428, -0.019886936992406845, 0.046616148203611374, 0.0379611998796463, 0.02912243828177452, -0.044438205659389496, -0.04320236295461655, 0.0767998918890953, 0.037590913474559784, 0.03492667153477669, -0.0028597423806786537, -0.028251295909285545, -0.06643787771463394, 0.06069832295179367, 0.052820947021245956, -0.005237719044089317, -0.033212993294000626, -0.01692362129688263, 0.029428843408823013, -0.03357556462287903, 0.06227460503578186, 0.024626294150948524, -0.0347307026386261, -0.039614781737327576, 0.014657975174486637, -0.08200270682573318, -0.04056123271584511, 0.09802845865488052, -0.05792292207479477, -0.028176024556159973, -0.03069341741502285, -0.030384136363863945, 0.07767847925424576, -0.046261779963970184, 0.01156679354608059, -0.01104861032217741, -0.06311023980379105, -0.0952000543475151, 0.01583041623234749, 0.053524818271398544, 0.041353072971105576, 0.017645642161369324, 0.008291725069284439, -0.08191817253828049, -0.015348494984209538, -0.04729415476322174, -0.05698859319090843, -0.11475594341754913, 0.04594559222459793, 0.008508034981787205, -0.06018280237913132, 0.009280652739107609, 0.05579141527414322, 0.04058973118662834, 0.07072608172893524, -0.0038075291085988283, 0.045168694108724594, -0.0058381338603794575, 0.10809345543384552, 0.09701666235923767, 0.04444342851638794, 0.044743746519088745, 0.035832107067108154, 0.02278711460530758]}