{"file_name": "botpenguin.com_solutions_hire-chatbot-developers", "text": "URL: https://botpenguin.com/solutions/hire-chatbot-developers\nBotPenguin's Chatbot Developers- Outsource Best Development\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nContact Us\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nHire chatbot developers to create\nyour unique chatbot\nOpt for our chatbot developers to get your unique custom-built bot. Build seamlessly integrated chatbot solutions for your existing applications.\nHire experienced developers with 5+ years of expertise on a full-time, part-time, or hourly basis.\nContact Us\nTrusted by\n40,000+\nGlobal Brands\nWhy should you hire chatbot developers?\nOur developers can create AI chatbots capable of delivering personalized and automated assistance to\nyour customers. They know their way around NLP and LLM bot development in different frameworks.\nAI chatbots\nHire chatbot developers from us to create AI chatbots with human-like conversational ability and program intent-based automation to capture leads, book schedules, support customers, or any custom use case.\nCustom chatbot development\nOur team of chatbot developers assists startups, enterprises, and entrepreneurs in developing customized, tailor-made chatbot applications\nChatGPT clone chatbots\nLeverage our ChatGPT developers to create chatbots based on the GPT models for your specific use case. Let your chatbot reply quickly, carry real-time conversations with customers, and train on your data to give accurate answers only.\nLLM integration\nOur devs can assist you in implementing the large language model into your chatbot to enhance its language understanding and generative capabilities, depending on your business needs.\nFacebook chatbot development\nWe can develop a custom Facebook Messenger bot to manage your conversations and user interactions with ease. The AI bot can be customized to serve your target user base.\nCustom WhatsApp chatbot\nGet a custom WhatsApp chatbot powered by the official WhatsApp API. Tailor the chatbot to offer bookings, ticketing, sales, customer support, lead generation, or any objective suited to your business.\nTesting and debugging chatbots\nOur QA and Troubleshooters Teams are the best guns for any duel, solving and suggesting the best ways around all your roadblocks.\nChatbot consultation\nTake advice from the masters of chat automation and build as we guide you into the thrilling world of AI.\nBenefits of hiring chatbot developers\nfrom BotPenguin?\nWe are a trusted chatbot provider with thousands of clients across the globe. Our solutions range from\nwebsites to social chatbots to any custom chatbot integrated into your existing application.\nYour platform, our chatbot\nOur chatbot developers can Implement the AI chatbot on the platform of your choice, be it SMS, Facebook, Website, WhatsApp, Telegram, or any custom app.\nOne-stop solution\nWhether it’s design, UX, development, or testing, our chatbot developers resolve all your chat automation problems.\nEnterprise-grade expertise\nOur developers have experience providing scalable and future-proof AI chatbot solutions to enterprises globally.\nEfficiency\nCut short development time, save money, and beat the competition with experienced developers who excel at creating automated, integrated systems.\nIntegrations and APIs\nPerfection comes through collaboration; our outsourced developers will integrate your custom-built chatbot with all the existing applications with APIs and webhook expertise.\nData handling and training\nData is the new money; expert outsourced developers can walk you through this shift with insights about custom training and data handling.\nTechnical and domain knowledge\nSeasoned Developers have been developing AI chatbots for a while, gaining expertise in NLP, Generative AI, LLMs, backend development framework, cloud storage, and analytics.\nCustom performance reports\nOur hired developers have expertise in SAP, Tableau, Big Query, and Power BI to generate the reports you require for custom behavior analysis.\nBuild solutions for your specific use case with\nexpert chatbot developers\nGot a specific use case to fulfill? Hire chatbot developers from\nBotPenguin to create a personalized bot just for you.\nConcierge chatbots\nAdd a helpful assistant to guide your customers in your place.\nAirline ticketing chatbots\nLet customers complete itinerary and ticketing while texting\nInsurance claim chatbots\nBuild chatbots that can process insurance claims through conversational UI\neCommerce chatbots\nShare product catalogs in chats and allow customers to purchase.\nHospitality chatbots\nManage stays, trip plans, food, and more through a chat interface.\nHealthcare chatbots\nAppointments, reports, and prescriptions can all come to chat for accessibility.\nReal estate chatbots\nDeploy a virtual real estate agent to capture high-value leads.\nBanking chatbots\nAlert, inform, and sell with our bankable Chatbots developers.\nFinance chatbots\nChatbots for those who advise, invest, and earn.\nTourism chatbots\nMake traveling places a breeze with automated bookings.\nEducation chatbots\nKeep parents, teachers, and students informed with Chatbots.\nRecruitment chatbots\nFrom interviews to onboarding, streamline the whole hiring process with AI chatbots.\nWe have a fair development process and pay-per-\nrequirement pricing model\nHire chatbot developers with no annual commitment. Pay only for what you use. Enjoy the benefits of a\ndedicated chatbot development team with the flexibility to hire as per business needs.\nFull Time\nCost\nStarts from $1000 per month\nWork Timings\n40hr/week Or 160hr/month\nCommunication\nEmail,Skype,Phone, Slack\nBilling Cycle\nMonthly\nHiring Period\n15 days\nProject Management\nZoho Project/JIRA\nContact Us\nPart-time\nCost\nStarts from $15 per hour\nWork Timings\n10hr/week Or 20hr/month\nCommunication\nEmail,Skype,Phone, Slack\nBilling Cycle\nMonthly\nHiring Period\n7 days\nProject Management\nZoho Project/JIRA\nContact Us\nHourly\nCost\nStarts from $15 per hour\nWork Timings\n40hr/week Or 160hr/month\nCommunication\nEmail,Skype,Phone, Slack\nBilling Cycle\nWeekly\nHiring Period\n3 days\nProject Management\nZoho Project/JIRA\nContact Us\n6 Reasons why you should hire chatbot developers from BotPenguin\nWe’ve got dedicated chatbot developers with excellent technical, communication, and soft skills; here are\nsome reasons to hire chatbot developers from BotPenguin.\nIntegrity and transparency\nBotPenguin signs an NDA with all the chatbot developers and maintains high security to ensure IP protection. Your idea is in safe hands as we respect your innovation.\nUser-friendly\nWe provide highly experienced chatbot developers who write neat and clean code to develop user-friendly experiences.\nScalable Architecture\nHire chatbot developers trained on architectural aspects of the OpenAI to develop a scalable experience.\nCancel anytime\nGot a change in your launch plans or any other reason? Cancel anytime, no questions asked.\nFlexible and affordable pricing model\nChoose to pay for the needed time. Be it hourly, monthly, or part-time basis. BotPenguin engages with flexibility as per the needs of the project\nExcellent communication skills\nCommunication skills, apart from technical and logical skills, are the critical parameters assessed when BotPenguin hires Chatbots developers.\nHire Expert chatbot developers to create\nyour industry-specific chatbot\nHire Chatbot Developers\nOur team of Chatbot developers is an expert in\nevery chat automation framework\nHire chatbot developers with Industry knowledge, competitor analysis, leading technologies, multi-channel support, and\ncomprehensive skills across all frameworks. Our devs will keep you at the forefront of innovation and AI.\nOpen AI\nChatbots chatbots are the rage of the moment. BotPenguin is the leading custom Chatbots whitelabel and plugin creator and provider.\nAmazon Lex\nHire chatbot development with Amazon Lex to build conversational interfaces with deep learning and natural language understanding (NLU).\nMicrosoft Bot Framework\nWe specialize in Azure Bot to build, test, deploy and manage intelligent bots by providing an environment for bot development with Microsoft Bot Framework. Our team helps you create bots that provide speech, language understanding, and Q&A.\nIBM Watson\nOur team leads in building and optimizing advanced chatbots with Watson Assistant. Watson offers data discovery, automated predictive analytics, and cognitive capabilities.\nDialogflow\nBotPenguin specializes in Dialogflow end-to-end development suites to build conversational interfaces for web and mobile apps, messaging platforms, and IoT devices.\nRasa NLU\nRasa provides flexible conversational AI software for building text and voice-based assistants. It is used by developers, conversational teams, and enterprises; BotPenguin enables you to harness its power.\nFastText\nBotPenguin’s consultants use fastText’s Natural Language Processing (NLP) to create a framework for learning word representations created by Facebook’s AI Research (FAIR) lab.\nOracle intelligent bots\nHire chatbot developers to deliver a complete AI platform to create conversational experiences for business applications through text, chat, and voice with Oracle.\nHow do our Chatbot Development Services work?\nSimply put, you tell us what you need, and we will take care of bot development.\n1\n2\n3\nSend us your requirements\nProject discovery aims to identify all the functional and non-functional requirements along with initial timelines, product roadmap and risk management planning.\nChoose from the selected talent pool\nProject envisioning aims to give visual understanding to the custom chatbot using user journey flows and design prototypes.\nInitiate Project On-Boarding\nWe work and start building on the complete blueprint of the custom chatbot with the aim of defining the architecture, UX design and other important elements.\nKnow more\nHire chatbot developers with all the development resources\nAs chatbot providers, we have every resource available to create your custom-built chatbot. Be it\ninfrastructure, project management, or hiring, we’ve got you covered.\nInfrastructure\nBack-office Processes\nHiring Process\nComfortable office\nPayrolls and taxes\nOffice management\nLegal support\nHardware\nCorporate events\nAccountants\nInsurance\nInfrastructure and security\nBotPenguin has more opportunities for\nyou to grow and earn\nIf you like the development process, you can extend your trust to become a brand\nadvocate for use and use our solutions to earn good bucks.\nChatGPT NLP chatbots\nUpgrade to our ChatGPT integrated chatbots and rise above your competitors with a conversational and user-friendly chat interface. Our NLP chatbots can deliver meaningful conversations with minimum human intervention.\nWhitelabel ChatGPT chatbots and GPT clones\nOffer your alternative to ChatGPT by building on its foundations. Hire chatbot developers from BotPenguin to get white-labeled ChatGPT bots and sell them with custom branding & pricing.\nChatGPT consultation\nOur team of expert chatbot solutions providers can help you build, scale, or advance your GPT chatbots. We draw on years of expertise to offer valuable insights and advice.\nChatbot reseller programs\nJoin our family as an affiliate, implementation, or white-label partner. Earn and grow with us through our reseller programs and become a chatbot provider.\nFrequently Asked Questions\nWhat services do BotPenguin's chatbot developers provide?\nWhen you hire chatbot developers from BotPenguin, you can access various services, including integrations, omnichannel messaging, human handover support, and multi-platform support. We specialize in creating automated experiences and smooth transitions into conversational AI.\nHow can chatbots benefit my business?\nHire chatbot developers to benefit your business. Chatbots are cost-efficient, saving money and time by handling customer queries. They streamline lead management systems, increase reach and engagement, and create memorable brand interactions. Chatbots also provide conversational UX for engaging user experiences.\nWhy should I hire dedicated chatbot developers?\nHire dedicated chatbot developers to simplify the process of chatbot automation. Our experienced team excels in design, UX, development, testing, and more. With their expertise, they efficiently create integrated systems, saving time and costs. We handle integrations, API, data handling, and training, and we provide custom reports using tools like SAP, Tableau, Big Query, and Power BI.\nWhat specific solutions can BotPenguin's chatbot developers build?\nBotPenguin's chatbot developers excel in diverse solutions. We craft concierge, airline ticketing, insurance claim, recruitment, eCommerce, hospitality, healthcare, real estate, banking, finance, tourism, and education chatbots for your specific needs.\nWhat frameworks and technologies are BotPenguin's developers proficient in?\nHire BotPenguin's chatbot developers who are proficient in frameworks and technologies such as OpenAI's ChatGPT, Amazon Lex, Microsoft Bot Framework, IBM Watson, Dialogflow, Rasa NLU, fastText, and Oracle Intelligent Bots.\nHow does the engagement model with BotPenguin's chatbot developers work?\nBotPenguin offers a flexible engagement model where you can hire chatbot developers based on your requirements. We provide full-time, part-time, and hourly options. The costs and work hours vary depending on the engagement model you choose.\nWhat benefits will I get if I hire chatbot developers from BotPenguin?\nThere are several reasons to hire chatbot developers from BotPenguin. We maintain integrity and transparency by signing NDAs to protect your ideas. The developers focus on creating user-friendly experiences, offering scalable architecture, providing flexible and affordable pricing models, and possessing excellent communication skills.\nHow do you hire chatbot developers with BotPenguin?\nThe hiring process with BotPenguin involves initial resume screening and multiple interviews to assess soft skills, logical ability, technical skills, and cultural fit. We also conduct a thorough background check.\nWhat solutions does BotPenguin offer apart from chatbot development?\nIn addition to chatbot development, BotPenguin offers AI chatbots, ChatGPT NLP chatbots, white-label ChatGPT chatbots, custom chat automation solutions, chatbot consultation, and chatbot reseller programs.\nHow can I get started with BotPenguin's chatbot developers?\nTo start with our chatbot developers, you can send us your requirements and choose from their talent pool. Once selected, the project onboarding process begins, and you can kickstart your chatbot development journey.\nHow long do I need to hire chatbot developers?\nYou can hire chatbot developers per your specific needs for as long as you need. Our flexible plans give you complete freedom.\nWhat if I am not satisfied with the chatbot developers I selected?\nOur rigorous process ensures that you are paired with developers that will not stop until the completion of your project. In the strange case you are left unsatisfied, we will provide you with another developer.\nIs it possible to build a bot that supports multiple languages?\nYes, it is possible to build a chatbot that supports multiple languages by using language processing capabilities and integrating language-specific datasets to understand and respond in different languages.\nDo I need to learn A.I. and machine learning to deploy a chatbot?\nIn the initial stages, we train your NLP and LLM chatbot on the existing data. Also, AI chatbots get better with time through customer interactions. That’s another good reason to hire chatbot developers.\nFor more FAQs and Guides\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nHire chatbot developers to create your custom chatbot\nHire Chatbot Developers\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.11302343010902405, -0.053403887897729874, 0.03361554071307182, 0.010589894838631153, -0.0075536444783210754, -0.04332640767097473, 0.0365644209086895, 0.0817694216966629, 0.0020289854146540165, 0.01859082654118538, 0.03493586182594299, -0.018073052167892456, -0.003977983258664608, 0.02861979231238365, 0.11068650335073471, -0.008787989616394043, 0.10994108766317368, -0.10792814940214157, -0.06931598484516144, -0.035451266914606094, -0.016382405534386635, -0.02101387083530426, 0.05283908173441887, -0.03554214537143707, -0.013458337634801865, -0.04407181590795517, -0.030474340543150902, -0.012657200917601585, -0.011292577721178532, -0.07534057646989822, -0.015243160538375378, 0.018530961126089096, 0.0040341024287045, 0.05696519464254379, -0.011091727763414383, -0.03341571241617203, -0.03192714974284172, 0.012712911702692509, 0.08109014481306076, -0.03902177885174751, -0.08353423327207565, -0.06655542552471161, -0.05942797288298607, -0.015989508479833603, 0.0882623940706253, -0.01947787031531334, -0.05849459767341614, 0.020985133945941925, 0.00649303151294589, 0.09436210244894028, -0.07289904356002808, -0.04653312638401985, 0.0506172701716423, 0.046675845980644226, -0.0437907949090004, 0.027276059612631798, -0.032136399298906326, 0.011955159716308117, 0.05741775780916214, -0.006825546734035015, -0.021737297996878624, -0.003424745285883546, 0.034117624163627625, 0.03537994250655174, -0.035040680319070816, 0.018652955070137978, -0.11023803055286407, 0.0026022696401923895, -0.02004430815577507, -0.032475560903549194, -0.011189443990588188, -0.01893448270857334, -0.052324000746011734, 0.062289975583553314, 0.02661498822271824, -0.022797249257564545, 0.014722896739840508, -0.012626037001609802, 0.018642224371433258, -0.05791988968849182, -0.015220856294035912, 0.02333817072212696, -0.011423076502978802, 0.06119846552610397, -0.036569319665431976, -0.03274162858724594, 0.012126329354941845, 0.04952652379870415, -0.011673828586935997, 0.009194325655698776, 0.04382462054491043, 0.004528867080807686, 0.017322473227977753, 0.03280764818191528, 0.01428383868187666, 0.018193967640399933, -0.055803801864385605, 0.041615355759859085, -0.06393567472696304, -0.013090464286506176, 0.0014940998516976833, -0.054898809641599655, -0.05990958958864212, -0.08449027687311172, -0.03731333091855049, 0.010770784690976143, 0.06019465625286102, -0.024078020825982094, 0.14384688436985016, 0.023193977773189545, -0.1310696005821228, -0.06896921247243881, -0.019833486527204514, -0.01840355433523655, 0.014902671799063683, 0.018230434507131577, -0.04199732467532158, 0.06523203104734421, 0.12683707475662231, 0.01541164517402649, 0.07333427667617798, 0.0650685504078865, -0.000498281151521951, -0.015143225900828838, 0.051744770258665085, 0.03216283395886421, -0.010217002592980862, 1.0810463184695938e-32, -0.027447225525975227, 0.027595646679401398, -0.05638651177287102, 0.094703808426857, 0.03448435664176941, 0.015361129306256771, 0.027022872120141983, 0.06515494734048843, -0.0679614320397377, -0.03560689464211464, -0.10721416026353836, 0.08130500465631485, -0.079184390604496, 0.04013089835643768, 0.022714177146553993, -0.07917961478233337, -0.007819987833499908, 0.022491086274385452, 0.05002954602241516, 0.012838280759751797, 0.07154165953397751, -0.03332805633544922, 0.052283722907304764, 0.09251122176647186, 0.13621138036251068, 0.033941980451345444, 0.08610951155424118, 0.016574079170823097, 0.050400298088788986, 0.03409980982542038, -0.08664649724960327, 0.01312155183404684, -0.03931105136871338, 0.019044287502765656, -0.04589986801147461, -0.04395776614546776, -0.05720793455839157, -0.10626716911792755, -0.06948214024305344, 0.05186858028173447, -0.14207641780376434, 0.01459424290806055, -0.09026862680912018, -0.06961488723754883, 0.046508532017469406, 0.0058589898981153965, 0.029135430231690407, 0.0168096162378788, 0.03309984877705574, 0.026201382279396057, -0.05943102017045021, 0.028549283742904663, 0.026795273646712303, 0.07599643617868423, -0.005373803898692131, -0.05686512961983681, 0.036810167133808136, -0.050082575529813766, -0.0029691278468817472, -0.034418415278196335, -0.014133261516690254, -0.025311501696705818, -0.010202084667980671, -0.031055139377713203, 0.039952851831912994, 0.016772275790572166, 0.049213845282793045, 0.02119806967675686, 0.016264863312244415, 0.03217754140496254, 0.0482991598546505, 0.04945020750164986, -0.004801461473107338, 0.02747991494834423, -0.057150948792696, 0.013205200433731079, -0.10007090866565704, 0.05272447317838669, -0.0240738894790411, -0.0004938244237564504, -0.03028971143066883, -0.008465827442705631, -0.008340129628777504, -0.036707803606987, 0.06509894877672195, -0.04067658260464668, 0.035476986318826675, -0.03632693365216255, -0.007710569072514772, 0.06949429959058762, -0.04099568724632263, 0.08749806880950928, -0.08191606402397156, 0.0726129487156868, -0.039438385516405106, -8.466820588060033e-33, -0.056620366871356964, 0.027959922328591347, -0.04550781100988388, 0.08944778889417648, 0.004443997982889414, -0.025343311950564384, 0.03499831259250641, -0.03445817902684212, 0.12000488489866257, -0.0061517623253166676, -0.11231978982686996, -0.014814327470958233, 0.012749647721648216, -0.037733037024736404, -0.019292090088129044, 0.03268946707248688, -0.05565424636006355, -0.047249216586351395, 0.02643182873725891, -0.0031442639883607626, -0.033856797963380814, 0.05715004354715347, -0.09605280309915543, 0.01672878861427307, 0.003914450760930777, 0.03270767256617546, -0.06911872327327728, 0.039541225880384445, 0.01916172355413437, 0.014937602914869785, -0.008068629540503025, -0.00597129762172699, -0.035062771290540695, -0.002294214442372322, 0.009659577161073685, 0.05837918072938919, 0.01782749965786934, -0.01555616594851017, 0.0036888583563268185, -0.05223775655031204, 0.10717758536338806, -0.04904761537909508, -0.035325173288583755, -0.07864751666784286, 0.00281455903314054, 0.02163429744541645, -0.13351266086101532, -0.04767739027738571, -0.056383077055215836, 0.03205827251076698, 0.050147537142038345, 8.247802179539576e-05, 0.03710046783089638, -0.04796389117836952, -0.08865374326705933, -0.04100867360830307, 0.09607191383838654, 0.028320617973804474, -0.07933223247528076, 0.019520575180649757, 0.03830723837018013, 0.018454907462000847, 0.08645502477884293, 0.05693788453936577, 0.027829326689243317, 0.0008698428864590824, 0.07393863797187805, 0.04394963011145592, 0.0015008895425125957, -0.10093608498573303, 0.039808932691812515, -0.07432172447443008, -0.01929873786866665, -0.002021986059844494, 0.006026312708854675, 0.09411384910345078, 0.03670972213149071, -0.10996271669864655, 0.009977178648114204, -0.03102678246796131, -0.05547164008021355, -0.004326728172600269, 0.07321954518556595, 0.049692679196596146, -0.08242291212081909, 0.07521102577447891, -0.01803528144955635, 0.006135986652225256, -0.0077558704651892185, 0.015689630061388016, -0.051653165370225906, 0.012661769054830074, -0.02130211517214775, 0.09221749007701874, 0.01438381802290678, -5.659487456455281e-08, -0.021098507568240166, -0.0048326896503567696, 0.045372944325208664, 0.03008861280977726, 0.01558657269924879, -0.06707693636417389, -0.03477073088288307, 0.09592624753713608, 0.039824675768613815, 0.038317061960697174, 0.013137509115040302, -0.03298933058977127, -0.0482182651758194, 0.08950214833021164, 0.0685989260673523, -0.020289819687604904, -0.0322447307407856, -0.00027732408489100635, 0.00439605163410306, -0.04885149747133255, 0.06048592925071716, 0.03146810829639435, -0.023878753185272217, -0.034664541482925415, 0.018922504037618637, -0.0692201778292656, -0.06426478177309036, 0.07858125865459442, -0.05404718220233917, -0.019367527216672897, -0.0373593345284462, -0.027404114603996277, 0.05737840384244919, -0.03405967727303505, 0.03589123860001564, -0.021373201161623, -0.08476945757865906, -0.08288803696632385, 0.024372994899749756, 0.06979327648878098, 0.011959832161664963, 0.020901024341583252, 0.009049171581864357, -0.0784846693277359, -0.014595432206988335, -0.05361657962203026, -0.06675678491592407, -0.10639844834804535, 0.024008234962821007, -0.0065742009319365025, -0.05233113840222359, 0.003068881342187524, 0.05613162741065025, 0.025044551119208336, 0.08896344155073166, -0.011011810973286629, 0.056211430579423904, -0.010478615760803223, 0.08881907165050507, 0.09493020176887512, 0.02204066701233387, 0.0241092536598444, 0.031518787145614624, 0.02451203390955925]}