{"file_name": "botpenguin.com_chatbot-use-cases_appointment-bookings", "text": "URL: https://botpenguin.com/chatbot-use-cases/appointment-bookings\nAppointment booking Chatbot | Scheduling bot | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nUtilize the Appointment Booking Chatbot to Let\nUsers Book Slots in 30 Seconds!\nBotPenguin's Appointment Booking Chatbot lets users effortlessly book meetings, sessions, & events through chat.\nConnect your generative AI-driven bot to Google Calendar, Calendly, Simplybook, & more.\nGet Started FREE\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nBring Appointment Booking Automation\nTo Your Customers' Chatbox!\nUse the AI chatbot to offer effortless appointment booking. No more forms, just friendly conversation. Seamlessly integrate\nwith your booking software to keep your calendar in sync & get 50% more slots booked.\nConversational Appointments\nEnable visitors to effortlessly select dates, desired slots, & meeting partners with a generative AI chatbot. No more dealing with tricky calendar widgets!\nConnect Your Booking System\nEnable hassle-free booking automation by integrating with your favourite appointment booking systems like Google Calendar, Calendly, Simplybook, Calendar Hero, etc.\nOne Interface\nSync your calendar easily across all chatbot channels so all customer bookings are aligned with your updated schedule.\nDuration of Appointment\nKeep your interviews short and precise with specific time durations.\nNumber of Days and Slots that Appear\nOrganize your availability with a number of days and slots.\nSmart Slot Configuration\nLet customers see the availability and select the perfect time slots for booking an appointment. No more double bookings or packed timelines.\nSend a Booking Confirmation Message\nIt is better to be sure than sorry. Send booking confirmation to your customers’ through email, SMS, or DMs after their appointments are scheduled.\nCollect Feedback on Past Appointments\nOur generative AI bot enjoys collecting feedback from past appointments to make future ones worthwhile.\nComplete Calendar Automation\nSync up your appointment booking chatbot with your Calendar application and let it update the slots automatically upon every booking.\nPrevent Double Booking\nTake off the slot that has already been booked. This will make it easy for everyone and reduce the chances of double booking to zero.\nPayment Gateway Integration\nConnect your scheduling chatbot with the popular payment gateways to facilitate payments for booking tickets, paid lectures, & other events.\nConnect with Your CRM\nSend captured data to your favourite CRM, like HubSpot, Zoho, Agile, Salesforce, & more. BotPenguin connects to all major CRMs & any custom ones.\nLive Chat with Human Assistance\nIf your customer needs a human touch, we got you covered there too. Let your service agents connect with customers and render reliable support with appointment bookings.\nGet Started\nFREE\nConnect BotPenguin With Your Prefered\nCalendar Applications\nAchieve seamless booking automation with BotPenguin’s calendar integrations. Schedule meetings\naccording to your availability and send invites to all meeting members.\nGoogle Calendar Integration\nEffortlessly sync events, meetings, and deadlines with Google Calendar, enhancing organization and time management through chatbot interaction.\nSimplyBook.me Integration\nWith SimplyBook Chatbot Integration, your customers can book slots for events, classes, meetings, webinars, etc.\nCalendly Integration\nSimplify scheduling with Calendly integration, allowing smooth coordination of appointments & meetings directly within the chatbot interface.\nCalendarHero\nEnable customers to book appointments, events, & meetings with CalendarHero integration with BotPenguin. Make scheduling management easier for you & your users.\nOther Booking Platform\nBotPenguin also connects to third-party booking apps like Appointly, Setmore, etc. Also, integrate your custom calendar apps for a compatible slot-scheduling solution.\nOmni Channel – Schedule Meetings from\nAnywhere with BotPenguin\nGive freedom to your customer using any channel and let\nBotPenguin streamline the Appointment Bookings!\nWhatsapp\nWhatsapp\nThrough this integration, enjoy a non- robotic conversation with your customers 24x7.\nTelegram\nTelegram\nKeep your customers close and well-served with Telegram live chat support.\nFacebook\nFacebook\nConvert potential clients into loyal customers by adding diligent support through Messenger.\nInstagram\nInstagram\nEngage customers with interactive messages and schedule a meeting for product demonstrations.\nMicrosoft Teams\nMicrosoft Teams\nConnect with your team & boost their productivity using automated meeting bookings and invites.\nGet Started\nBook Smarter Appointments with\nGenerative AI Chatbot!\nEmpower your users with appointment-scheduling chatbots driven by generative AI. Seamlessly manage\nbookings, understand user preferences, and automate appointment confirmation.\nTrain AI On Your Website Data\nTransform various URLs into insightful training data, enabling your AI chatbot to excel in managing appointment-related queries.\nAdjust to Your Use Case\nEnhance your appointment booking capabilities by uploading custom datasets, letting your generative AI chatbot provide personalized booking assistance.\nConnect With ChatGPT\nIntegrate your slotting bot with Any ChatGPT model to boost its generative AI capabilities and help customers book appointments anytime.\nUpload FAQs\nEffortlessly prepare your chatbot to solve appointment-related inquiries by integrating FAQ files, and streamlining the booking process.\nCatch Conversation Context\nEnable your appointment booking AI bot to learn from previous interactions, responding with context-aware understanding for a tailored booking experience.\nTalk in the Customer’s Language\nFacilitate customer appointment booking in any language with ChatGPT-powered instant translation. Get the right details and book more schedules with your AI chatbot.\nBook a demo\nTailor Appointment Booking Chatbots\nfor Your Business Use Case\nLaunch dedicated appointment booking assistants with generative AI! Automate bookings,\nslash manual work by 100%, and provide 24/7 efficiency with ChatGPT integration!\nHealthcare\nImprove patient experience by allowing them to book appointments with doctors, specialists, and medical services.\nEducation And Tutoring\nFacilitate student-teacher meetings, academic sessions, and virtual classroom scheduling.\nBeauty And Wellness\nSimplify the process of scheduling appointments for spa treatments, salon services, and wellness sessions.\nReal Estate\nAllow potential buyers & renters to book property viewings, agent consultations, and virtual tours.\nAutomotive Services\nStreamline the booking process for car repairs, maintenance services, and test drives.\nSports And Fitness\nEnable customers to reserve gym sessions, fitness classes, sports facilities, and personal training.\nGet Started\nFREE\nAn established Eyewear Store-Chain got a Chatbot to\nBoost their Appointment Bookings & Sales!\nBotPenguin created an appointment booking chatbot integrated with Simplybook.me. The bot features a friendly persona, “Meg,”\ndelivering booking automation for eye tests across Website, Facebook, & WhatsApp.\nBusiness\nAn established eyewear solutions provider with 20 stores chain across South Africa.\nProblem\nTime-taking appointment booking process, drop in engagement rates, & high costs of the service team to answer routine queries.\nSolution\nAn automated appointment booking chatbot for eye test scheduling on Website, WhatsApp, & Facebook coupled with Live Chat.\nResults\nGot 50% more bookings leading to an impact of 15% - 20% increase in revenue.\nDeploy Appointment Booking Bots\n& Get Bang for Your Buck\nUse the AI chatbot to offer effortless appointment booking. No more forms, just friendly conversation. Seamlessly\nintegrate with your booking software to keep your calendar in sync & get 50% more slots booked.\nGet More Bookings\nIncrease the number of booking with effortless & speedy appointment scheduling automation.\nSave Time\nAutomate appointment scheduling, saving time for both businesses and customers.\nSave Effort\nAutomate appointment tasks, reducing manual work and allowing staff to focus on more important responsibilities.\nSave Money\nDecrease staffing needs, minimize errors, and improve operational accuracy, resulting in potential business cost savings.\n24/7 Availability\nAllow customers to book appointments anytime, even outside regular business hours.\nReduced No-Shows\nSend automated notifications and reminders to minimize the number of missed appointments.\nIntegrate With Your Favorite Tools\n- Native Integrations\nSchedule appointments and follow up with leads using the\nsoftware you love. Enjoy a seamless integration with\nand more than 80 tools to integrate\nBuild Slot Booking Bot\nAppointment Scheduling Chatbot Supports\nYour Customers in Every Field!\nAccelerate your bookings with ChatGPT Brilliance! From healthcare to education, fitness\nto eCommerce, our chatbot ensures intelligent appointment automation.\nSaaS Business Demos\nAccelerate your SaaS business growth by effortlessly scheduling product demos and consultations with potential clients.\nDoctor Appointment Booking\nLet healthcare patients book an appointment to visit their preferred doctor & select from the available slots. No more standing in long lines.\nStudent Class Booking\nMake students learn more efficiently with easy booking for classes, workshops, & live lectures.\nSchedule Interviews for Candidates\nYour new intern BotPenguin chatbot can help you schedule interviews and make the hiring process smoother.\nConference Booking\nGrow your business with amazing, delightful conference meetings, all thanks to BotPenguin.\nGym or Yoga Sessions\nGym or Yoga? It's totally up to you since BotPenguin helps you schedule both. Who says you can’t be relaxed and pumped at the same time?\nUnleash Appointment Booking Automation\nwith BotPenguin’s AI Chatbot\nCreate a ChatGPT-driven scheduling chatbot that books appointments like a skilled assistant. BotPenguin\nfuels your appointment booking 24/7, integrated with your preferred platforms.\nBooking Platform Integration\nSend Invites & Reminders in Chat\nPayment Integration for Paid Bookings\nBot AI Training on FAQs & URLs\nChatGPT Integration\nSend Files in Chat\nPabbly & Zapeir Integration\nWhatsApp Green Tick Verified Business Number\nKey Customer Analytics\nFrequently Asked Questions\nHow do I make an appointment with chatbot?\nFollow these steps to create a scheduling chatbot with generative AI for your business: - Login to BotPenguin. - Click on “Create a New Bot”. - Select the purpose as “Appointment Booking”. - Name your chatbot and configure its avatar. - And you are done. - Set up the condition flow and integrate it with your ChatGPT account to enable the AI features.\nCan I integrate the slotting bot with external applications?\nYes, you can integrate with 80+ third-party applications, including ChatGPT, Zoho, Salesforce, GoHighLevel, and more. Our appointment booking chatbot also integrates with Pabbly and Zoho, enabling you to connect your generative AI bot with over 1000 apps.\nCan I integrate the booking chatbot with my Google Calendar?\nYes, effortlessly sync BotPenguin's appointment chatbot with Google Calendar for efficient scheduling and automated updates.\nCan I use this Appointment Booking template for free?\nAbsolutely! BotPenguin offers a FREE Forever Plan for the appointment booking chatbot, no credit card required. You get the basic features, 2000 messages, and unlimited contacts. You can also use the ChatGPT features for upto 100 messages. Afterward, integrate your own ChatGPT account to use the AI at full scale.\nHow does ChatGPT help with appointment booking?\nChatGPT enhances appointment booking by providing a conversational interface, answering queries, and making the scheduling process seamless and user-friendly.\nCan I sell event tickets from the Appointment Booking Chatbot?\nYes, you can integrate your scheduling chatbot with your preference booking platform and sell event tickets & collect payments in chat. After successful booking, you can send tickets as images or PDFs within the chat interface.\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nGet ready to transform your appointment\nbooking experience!\nBook a demo\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09908543527126312, -0.0539984367787838, 0.013907120563089848, 0.028734000399708748, -0.028025005012750626, -0.03531687334179878, 0.04264812543988228, 0.06107516959309578, 0.005819379352033138, 0.019435817375779152, 0.03308992460370064, -0.016319023445248604, -0.0024542640894651413, 0.03735775128006935, 0.1193472370505333, -0.016800958663225174, 0.1150575652718544, -0.10594215244054794, -0.06243347376585007, -0.0032076688949018717, -0.030600350350141525, -0.02071439102292061, 0.028121480718255043, -0.03692900016903877, -0.04284309968352318, -0.04856656491756439, -0.033578600734472275, -0.015250842086970806, -0.014088695868849754, -0.0761268362402916, -0.0010459462646394968, 0.0252063125371933, 0.005940721835941076, 0.05338152498006821, 0.010861008428037167, -0.03586248308420181, -0.03133701533079147, 0.008163714781403542, 0.08066529035568237, -0.04376710578799248, -0.07425924390554428, -0.07989707589149475, -0.0597822330892086, -0.008154083043336868, 0.09656325727701187, -0.013429176062345505, -0.060644324868917465, 0.023084405809640884, 0.0032548813614994287, 0.10364202409982681, -0.07595468312501907, -0.0479586087167263, 0.04453656077384949, 0.053484849631786346, -0.05276495963335037, 0.04132090508937836, -0.006879436783492565, 0.002659648424014449, 0.028169171884655952, -0.009390740655362606, -0.053233783692121506, 0.0037910323590040207, 0.04225258156657219, 0.04417429119348526, -0.059290193021297455, 0.04853298142552376, -0.13206987082958221, 0.003313446417450905, 0.007664880249649286, -0.029376910999417305, -0.023336755111813545, -0.005516598932445049, -0.052148353308439255, 0.06085116043686867, 0.028205059468746185, -0.03275451064109802, 0.007034999784082174, -0.0012077528517693281, 0.04641760513186455, -0.058855678886175156, -0.03745972365140915, 0.014371632598340511, 0.003995751962065697, 0.05652891844511032, -0.016767717897892, -0.03121265023946762, 0.004687811713665724, 0.0368058905005455, -0.03467077761888504, -0.0011796510079875588, 0.04785144329071045, 0.024106279015541077, 0.011670444160699844, 0.01621134765446186, 0.023562485352158546, 0.02379101701080799, -0.070606529712677, 0.04721914604306221, -0.04560025781393051, -0.002520558424293995, 0.0022522439248859882, -0.022262532263994217, -0.06339075416326523, -0.05079742148518562, -0.06178077682852745, 0.0033994941040873528, 0.05867345631122589, -0.033346354961395264, 0.12436114251613617, 0.009446080774068832, -0.1282164305448532, -0.06634186208248138, 0.0132687296718359, -0.031856756657361984, -0.005407128017395735, 0.0337165929377079, -0.0384443961083889, 0.06875386089086533, 0.1448417603969574, 0.026790887117385864, 0.061767566949129105, 0.07297614961862564, 0.010271303355693817, -0.025051431730389595, 0.058428630232810974, 0.027178030461072922, 0.01344845350831747, 1.103844002846235e-32, -0.03659025952219963, 0.017987316474318504, -0.06164347752928734, 0.0768788680434227, 0.047979697585105896, 0.024006374180316925, 0.0021681946236640215, 0.04438681900501251, -0.055248431861400604, -0.03170620650053024, -0.09468385577201843, 0.0875595360994339, -0.06251248717308044, 0.02319510281085968, 0.01537343766540289, -0.06460123509168625, 0.0032173465006053448, 0.04073866084218025, 0.05407748743891716, -0.0007284650928340852, 0.06946168839931488, -0.04850543662905693, 0.048078276216983795, 0.08532267808914185, 0.12052498012781143, 0.06718553602695465, 0.07960283011198044, 0.026176409795880318, 0.06569908559322357, 0.03167951479554176, -0.0863795056939125, -0.009196367114782333, -0.05411028116941452, 0.027767334133386612, -0.025834523141384125, -0.035700827836990356, -0.04022243246436119, -0.09261079132556915, -0.07228317856788635, 0.04884789511561394, -0.14802560210227966, -0.002884464804083109, -0.10838653147220612, -0.062443993985652924, 0.014091657474637032, 0.015471681021153927, 0.029681475833058357, 0.022363997995853424, 0.03584522381424904, 0.05366118624806404, -0.05689200386404991, 0.015438941307365894, 0.02584993466734886, 0.054303932934999466, -0.022122252732515335, -0.057809751480817795, 0.0393613763153553, -0.05263640359044075, 0.0010784867918118834, -0.043745942413806915, -0.0011930082691833377, -0.03159792721271515, -0.018070075660943985, -0.025034965947270393, 0.030289702117443085, -0.009408468380570412, 0.037079472094774246, 0.0033626288641244173, 0.03372983634471893, 0.029829898849129677, 0.04648631811141968, 0.06515722721815109, 0.0044112782925367355, 0.03360943868756294, -0.04136990010738373, 0.012104581110179424, -0.08008451014757156, 0.0371292382478714, -0.0512705035507679, 0.004183644894510508, -0.013672656379640102, -0.017262177541851997, 0.0046373168006539345, -0.04088814556598663, 0.06220196932554245, -0.049419987946748734, 0.03231671825051308, -0.043634552508592606, -0.017687875777482986, 0.044542115181684494, -0.04677245765924454, 0.08225100487470627, -0.07294674962759018, 0.07939355075359344, -0.039174359291791916, -8.643166046518484e-33, -0.03484616056084633, 0.007917790673673153, -0.045112717896699905, 0.07037489861249924, 0.01544368639588356, -0.021588431671261787, 0.034851621836423874, -0.05162140354514122, 0.1157950609922409, -0.007126555312424898, -0.11195451766252518, -0.0077124424278736115, 0.03614199161529541, -0.035578735172748566, -0.0016192568000406027, 0.03360654041171074, -0.0628027468919754, -0.04818437620997429, 0.020907774567604065, 0.01752755418419838, -0.034870706498622894, 0.06939694285392761, -0.10866212099790573, 0.006716722622513771, -0.0013076771283522248, 0.0450713187456131, -0.07819259911775589, 0.04832375794649124, 0.014301426708698273, 0.023821329697966576, -0.035916443914175034, -0.029411809518933296, -0.04005656763911247, 0.00736608449369669, 0.012296859174966812, 0.058835022151470184, 0.0164774339646101, 0.01842137612402439, -0.01013247948139906, -0.03814447298645973, 0.10432125627994537, -0.06093709170818329, -0.04772639274597168, -0.08063696324825287, 0.007578272372484207, 0.025841156020760536, -0.1324038952589035, -0.04092320054769516, -0.05454056337475777, 0.03273018077015877, 0.024280834943056107, -0.008453423157334328, 0.02547062747180462, -0.03760683164000511, -0.08853056281805038, -0.018221750855445862, 0.09031584113836288, -0.0045342338271439075, -0.0684266909956932, 0.020328214392066002, 0.03725714609026909, -0.009324912913143635, 0.07201414555311203, 0.0737055167555809, 0.04661256819963455, -0.02099962905049324, 0.07013871520757675, 0.022990144789218903, 0.00997687317430973, -0.08732873946428299, 0.04084748029708862, -0.05138714984059334, -0.013030895963311195, 0.012711710296571255, 0.02120630256831646, 0.09099826216697693, 0.04747476428747177, -0.10449805110692978, 0.001570850028656423, -0.024869972839951515, -0.05614256113767624, -0.003257113043218851, 0.06518470495939255, 0.032979466021060944, -0.1025656908750534, 0.07276944816112518, -0.020756255835294724, 0.002035111654549837, -0.023710040375590324, 0.006804945878684521, -0.06319940835237503, 0.023464830592274666, -0.01968298852443695, 0.10004251450300217, 0.006463769823312759, -5.729981822355512e-08, -0.025973889976739883, -0.009716889820992947, 0.0561976283788681, 0.0291188582777977, 0.04533695429563522, -0.09514421224594116, -0.04056156799197197, 0.09123489260673523, 0.03220565244555473, 0.044257860630750656, 0.024804705753922462, -0.03218214213848114, -0.048941921442747116, 0.06426715850830078, 0.05898435041308403, -0.005239933263510466, -0.026768961921334267, 0.002454709494486451, 0.005162992514669895, -0.0404125452041626, 0.06440024822950363, 0.025653177872300148, -0.00881343986839056, -0.03964807838201523, 0.030281072482466698, -0.06728024780750275, -0.06340942531824112, 0.08959463983774185, -0.03578072041273117, -0.01883569546043873, -0.03314809128642082, -0.02058631181716919, 0.07360172271728516, -0.05266837403178215, -0.003022137563675642, -0.030390216037631035, -0.10057107359170914, -0.07418563216924667, 0.016988564282655716, 0.05608063191175461, 0.021150322631001472, 0.018178004771471024, 0.012216654606163502, -0.08557648956775665, -0.019140120595693588, -0.04233456030488014, -0.060042936354875565, -0.10890800505876541, 0.038254011422395706, 0.003553197020664811, -0.0631285235285759, 0.0029274672269821167, 0.06555074453353882, 0.040646959096193314, 0.08249286562204361, 0.00624829763546586, 0.08066394925117493, -0.014718937687575817, 0.10332674533128738, 0.1083124503493309, 0.011785374954342842, 0.02361239679157734, 0.030738404020667076, 0.008625331334769726]}