{"file_name": "botpenguin.com_chatbot-industry_healthcare", "text": "URL: https://botpenguin.com/chatbot-industry/healthcare\nFREE Healthcare Chatbot | AI Medical Chatbot | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nCreate an AI Healthcare Chatbot for Instant\n& Intuitive Medical Assistance\nBotPenguin is your omnichannel healthcare chatbot that streamlines outpatient care, solves routine queries 24/7,\nand effortlessly automates appointment bookings, prescriptions, and reports.\nGet Started FREE\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nBuild an AI Healthcare Chatbot to Engage\n& Diagnose Patients.\nDeploy your healthcare chatbot to streamline operations from consultations to post-surgery care. Automate your\nmedical services on web, social media & apps with one healthcare chatbot.\nAppointment Scheduling\nSimplify the appointment process for patients, allowing them to easily select available dates, time slots, & doctors and confirm their bookings with just a few clicks.\nAnswer Medical FAQs\nProvide patients with essential medical information, such as treatment guidelines, medication instructions, and post-care recommendations, ensuring they can manage their health.\nSymptom Checker Tool\nOffer a symptom checker feature powered by healthcare AI, enabling patients to assess symptoms and receive guidance on potential causes or conditions.\nSend Medical Test Reports in the Chat\nAllow patients to receive their medical test reports directly through the chatbot interface, ensuring convenient access to important health information in a secure and timely manner.\nIntegration With EMR Tools\nIntegrate your Healthcare bot with Electronic Medical Record (EMR) and efficiently sync accurate patient data and medical records, improving patient care & administrative processes.\nEfficient Patient Data Collection\nCollect patient information via digital forms and questionnaires in chat to complete before appointments, reducing paperwork and administrative burdens for patients and healthcare providers.\nAutomated Prescription Refills\nEnable patients to request prescription refills through the healthcare chatbot, automating the refill process and ensuring they receive their medications on time.\nSelect Hospital Beds\nLet clients book hospital beds for themselves or their loved ones in advance to ensure critical care. Avoid hassles in emergency situations.\nSchedule Blood Donations\nDeploy an AI chatbot for patients to learn about blood donations, check available blood types, & schedule appointments for donors & receivers.\nWellness Program Recommendations\nRecommend personalized wellness programs through medical chatbots, encouraging proactive health management and preventive care tailored to patients' needs.\nInsurance Coverage and Claims Assistance\nHealthcare bots can help patients understand insurance coverage and manage claims, simplifying the process and reducing administrative burdens.\nPayment Gateway Integration\nConnect your preferred payment gateway with your healthcare IA chatbot and enable patients to conveniently purchase medicines, book tests, health evaluations, & other healthcare services.\nTailor the Healthcare Chatbot for\nYour Business Use Case\nCustomize your AI chatbot to cater to your industry needs. Engage patients, streamline processes, and\nprovide personalized healthcare. Connect with 80+ native integrations & support your business-specific workflows.\nIndividuals Seeking Healthcare Information\nAccess medical advice, schedule appointments, and receive health tips conveniently through healthcare chatbots.\nHealthcare Providers and Clinics\nStreamline patient care and administrative tasks with healthcare chatbot integration.\nHospitals and Medical Centers\nOptimize services and improve patient experiences with healthcare chatbots for appointment scheduling and education.\nPharmacies and Drugstores\nAssist customers in refilling prescriptions and accessing medication information through pharmacy-based healthcare chatbots.\nHealthcare Insurance\nSupport policyholders with insurance inquiries and claims processing using healthcare chatbots integrated into insurance platforms.\nHealth and Wellness Organizations\nEngage members with health advice and wellness program recommendations through health-focused chatbots.\nPut a Generative AI Cap on Your Healthcare Chatbot\nAssist your patients with a Generative AI-driven chatbot trained on your data. Enhance user experience with FAQ resolution, auto-translation, and chat based on patient’s medical history.\nPersonalized Medical Advice\nUse the healthcare AI chatbot to send medical advice tailored to each patient's unique health profile. The chatbot analyzes medical history and current data for accurate suggestions.\nAI Symptom Checker\nA user-friendly symptom checker guides users in assessing symptoms, offering insights into potential conditions and suggesting next steps like hospital visits or self-care measures.\nTriaging & Patient Referrals\nOur Healthcare AI chatbots can understand a user's symptoms and point them to correct healthcare services, including emergency services, if necessary.\nAI-driven Post-Operation Care\nHealthcare chatbots offer post-surgery care and chronic disease management. With 24/7 access, it helps patients recover & addresses questions based on treatment protocols.\nMental Health Support\nLet the healthcare chatbot offer support & resources for mental health concerns through confidential conversations with an empathetic and understanding chatbot.\nIntegrate ChatGPT for Enhanced Conversations\nSeamlessly integrate ChatGPT into your healthcare chatbot to improve its conversational capabilities & provide more accurate and relevant responses.\nCreate Healthcare AI Bot\nBenefits of Generative AI Chatbot's\nRx for Healthcare\nImprove patients' healthcare experience with our generative AI chatbot. Reduce operations costs, avoid\ndouble bookings, sell more goods & services, and streamline consultations.\nSave Money\nSave operational costs by automating routine tasks such as information retrieval and FAQ answering with ChatGPT.\nSave Time\nStreamline information retrieval and FAQ answering processes to improve efficiency and save valuable time.\nSave Manual Effort\nAutomate healthcare tasks and rely on our AI chatbot to handle repetitive and time-consuming work.\nAutomate Healthcare\nAutomate routine tasks and processes with our AI chatbot, reducing manual effort and improving cost efficiency.\nStreamline Consultations\nFacilitate seamless communication between patients and healthcare providers, reducing wait times and enhancing efficiency.\nEnhanced Patient Experience\nProvide personalized and prompt patient assistance, improving satisfaction and loyalty.\nPrevent Double Bookings\nEnsure smooth appointment scheduling and avoid overlapping bookings with automated management.\nBoost Revenue\nIncrease sales of medicines, tests, and consultations by leveraging the chatbot for product recommendations and upselling opportunities.\nData-driven Insights\nGain valuable insights into patient preferences and behaviors through analytics, enabling targeted improvements and optimizations.\nEmpower Your Customer Support Team with AI Healthcare Chatbot\nEnhance patient care through tailored greetings, personalized profiles, 24/7 support, & no-code integration\nwith ticketing systems. Transform your healthcare services with our ChatGPT-powered chatbot.\nOptimized Customer Care\nTailored greetings, personalized profiles, round-the-clock support, and seamless integration for enhanced patient care.\nEfficient Team Collaboration\nEasily add and assign roles to your support team for efficient patient query management.\nStreamlined Inquiry Management\nIntegrated ticketing systems for seamless routing and effective handling of patient inquiries.\nOrganized Communication\nConnect with patient records management tools for structured and organized communication channels.\nMultichannel Support Options\nReach patients on various platforms like Facebook, WhatsApp, MS Teams, and Telegram for versatile communication.\nEnhanced Patient Understanding\nGather demographic, device, and contact data for improved insight and personalized patient service.\nPromote Your Healthcare Services with Effortless\nMarketing Automation\nWho says healthcare can’t be trendy? Go viral with BotPenguin’s omnichannel Healthcare chatbot offering\ndrip & broadcasts, bulk messaging, personalized notifications, & more.\nDrip & Broadcast Campaigns\nAutomate drip campaigns and send targeted broadcasts on WhatsApp, Facebook, and Telegram and stay in the minds of all your patients & leads.\nNewsletter Subscriptions\nHealthcare chatbots can provide users with the option to subscribe to newsletters, delivering relevant healthcare news, updates, and educational content directly to their inbox.\nPromote Healthcare Services\nChatbots can share promotions, discounts, and offers on healthcare services like tests, wellness programs, consultations & more to attract new patients and encourage existing ones.\nPersonalized Healthcare Plans\nPromote Healthcare plans to individuals or groups based on their health status, increasing participation in your healthcare programs.\nMental Health Support\nLet the healthcare chatbot offer support & resources for mental health concerns through confidential conversations with an empathetic and understanding chatbot.\nShare Interactive Content\nUtilize healthcare chatbots to engage patients by sharing health-related articles, quizzes, infographics, and videos and resolving FAQs.\nCapture Healthcare Leads & Book Appointments Easily With\nHealthcare AI Bot\nCapture, qualify, & segment leads with BotPenguin’s ChatGPT-driven healthcare chatbot. Grow your\npotential client's list with a conversational interface.\nCapture Leads with a Human Tone\nEngage website visitors with interactive chatbot conversations, capturing contact & demographic details & qualifying leads with ease.\nIntegrate With Your CRM\nSeamlessly sync captured leads with your CRM system, including Hubspot, GoHighLevel, Zoho, etc., ensuring efficient lead management and follow-up processes.\nBook Appointments On the Go\nEnable patients to book appointments directly within the healthcare chatbot. Let them select day, time slots, & doctors for efficient appointment scheduling.\nConnect With Preferred Booking Platforms\nIntegrate with popular booking platforms like Google Calendar, Calendly, and Simplybook for a seamless appointment booking experience. Custom booking systems are also welcome.\nSend Appointment Confirmation & Reminders\nMake sure your patients show up on time. Send confirmation after use book their appointments and timely reminders as their slot nears.\nBuild Healthcare AI bot\nUse Conversation Starter Chatbot Templates for Healthcare.\nUse healthcare chatbot templates to jump right into action mode. No skills needed. Keep your audience engaged and heard with our awesome chatbot templates.\nLead Generation Chatbot\nGenerate leads easily with BotPenguin being an awesome conversational Penguin.\nPatient Support Chatbot\nHelp your Patients with prescriptions, reports, & consultations with a single click.\nDoctor Appointment booking\nBook an appointment with a Doctor in just a few moments. No more waiting on calls & ques.\nTry the Templates today\nChoose BotPenguin To Build a Generative AI Healthcare Chatbot\nCreate your healthcare chatbot and integrate it with ChatGPT. Improve their Healthcare journey with health tips, treatment recommendations, medicine refills, FAQ answering, & more.\nGenerative AI Chatbot Maker\nBooking Platform Integration\nIntegration with EHR\nLive Chat with Human Handover\nPayment Integration\nQuick Replies\nChatGPT Integration\nPabbly & Zapeir Integration\nWhatsApp Green Tick Verified Business Number\nUse Drag-and-Drop chatbot builder\nDetailed Customer Analytics\nAwesome 80+ Native Integrations\nAre Here\nYour healthcare chatbot integrates with 80+ apps, including HubSpot, ChatGPT, and Calendly.\nYou can also utilize Pabbly and Zapeir integration to create custom workflows with 1000+ apps and tools.\nand more than 80 tools to integrate\nBuild your conversational chatbot today\nFrequently Asked Questions\nDo hospitals use chatbots?\nHospitals utilize healthcare chatbots for efficient patient communication, appointment scheduling, and FAQs, enhancing service quality and accessibility.\nCan chatbot replace doctors?\nChatbots complement doctors by offering preliminary information, appointment booking, and symptom assessment, but can't replace comprehensive medical expertise.\nWhat AI is used in healthcare?\nHealthcare chatbots employ Natural Language Processing (NLP), Machine Learning (ML), and ChatGPT to offer personalized assistance, symptom checking, and appointment scheduling. You can build NLP-driven healthcare bot with BotPenguin’s no-code chatbot platform.\nHow to build a healthcare chatbot?\nDevelop a healthcare chatbot by defining objectives, designing conversational flows, integrating AI technologies, testing, and deploying on preferred platforms. To create a healthcare bot, BotPenguin is your go to platform. You can build your bot in under 2 minutes and get a head start with healthcare templates for appointment booking, reports, & prescriptions.\nWhy are chatbots important in healthcare?\nChatbots streamline healthcare by offering 24/7 support, reducing wait times, enhancing patient engagement, and automating administrative tasks, improving overall efficiency.\nCan chatbot diagnose disease?\nWhile chatbots can aid in symptom checking and information provision, they can't diagnose diseases independently; they serve as complementary tools to medical professionals.\nWhat are the disadvantages of ChatGPT in healthcare?\nDisadvantages of ChatGPT in healthcare include potential inaccuracies in responses, privacy concerns, and the need for robust data protection measures.\nWhat is the future of chatbots in healthcare?\nThe future of chatbots in healthcare is promising, with advancements in AI, personalized medicine, and telehealth driving improved patient care, accessibility, and efficiency.\nHow can chatbots improve healthcare?\nChatbots enhance healthcare by providing instant assistance, personalized recommendations, appointment scheduling, medication reminders, and post-care support, improving patient outcomes.\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nProvide Efficient Healthcare Services with Healthcare AI Chatbot!\nGet a Demo\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10236362367868423, -0.05319515988230705, 0.031461555510759354, 0.0003190611023455858, -0.014337568543851376, -0.046565745025873184, 0.03836166486144066, 0.07924071699380875, 0.01917499490082264, 0.016609670594334602, 0.04494239017367363, -0.011654027737677097, -0.002237417735159397, 0.025853054597973824, 0.11256778985261917, -0.026493562385439873, 0.0997118428349495, -0.11894286423921585, -0.0796741247177124, -0.0009134273859672248, -0.022022414952516556, 0.01356615498661995, 0.05754664167761803, -0.03148175776004791, -0.029266992583870888, -0.05504266172647476, -0.03622516617178917, -0.028981860727071762, -0.015413129702210426, -0.05929036810994148, 0.008349352516233921, 0.016149772331118584, 0.01061264704912901, 0.056814394891262054, -0.01594327576458454, -0.05014604702591896, -0.031444426625967026, 0.033172737807035446, 0.053537797182798386, -0.03476477414369583, -0.07397976517677307, -0.0844932273030281, -0.049769628793001175, -0.000920816557481885, 0.10537593066692352, -0.010035722516477108, -0.07984151691198349, 0.005625615827739239, 0.027476739138364792, 0.10770037770271301, -0.0972977876663208, -0.041637931019067764, 0.05518234893679619, 0.0753706768155098, -0.05133117735385895, 0.02066059596836567, -0.038262564688920975, -0.0019220288377255201, 0.005683444906026125, -0.0012785439612343907, -0.04857824370265007, 0.0020472193136811256, 0.06749607622623444, 0.0367913693189621, -0.038383930921554565, 0.05252818390727043, -0.11673501878976822, -0.01048665214329958, 0.00042160137672908604, -0.03135305270552635, -0.028310706838965416, -0.026825614273548126, -0.03800055757164955, 0.07967790961265564, 0.012620431371033192, -0.025050844997167587, 0.008254297077655792, -0.011480673216283321, 0.0211862213909626, -0.05439797043800354, -0.020925387740135193, 0.032010167837142944, 0.00346332392655313, 0.05804342031478882, -0.03571617975831032, -0.030480291694402695, -0.005381906870752573, 0.04046865180134773, -0.02469906210899353, -0.0016871570842340589, 0.04078276455402374, 0.004141674842685461, 0.020401587709784508, 0.014110516756772995, 0.032840363681316376, 0.0014830748550593853, -0.0538676455616951, 0.02897757850587368, -0.07038609683513641, -0.017733849585056305, -0.01165441982448101, -0.04816420003771782, -0.06006579101085663, -0.06294533610343933, -0.04170212149620056, 0.012502094730734825, 0.05366915464401245, -0.039566658437252045, 0.1414279043674469, 0.008508888073265553, -0.11711455881595612, -0.055870212614536285, -0.00040012181852944195, -0.029129642993211746, -0.007468550931662321, 0.03121195361018181, -0.04025838151574135, 0.04010014608502388, 0.146709606051445, 0.04246809333562851, 0.05915530025959015, 0.047260019928216934, 0.002082548337057233, -0.022681234404444695, 0.0653192549943924, 0.025879545137286186, -0.0038470998406410217, 1.094165349703549e-32, -0.028639115393161774, 0.026226073503494263, -0.02883765660226345, 0.0859045460820198, 0.03819778934121132, 0.03422652557492256, 0.0014258665032684803, 0.034449514001607895, -0.05124392360448837, -0.03155199810862541, -0.12641575932502747, 0.09419761598110199, -0.06339000165462494, 0.03521890565752983, 0.008651710115373135, -0.08508462458848953, -0.012462078593671322, 0.01880720816552639, 0.032483261078596115, 0.024222273379564285, 0.0651962086558342, -0.04194876179099083, 0.046799205243587494, 0.0901898518204689, 0.09841500967741013, 0.044207341969013214, 0.06176499277353287, 0.01079357136040926, 0.07076982408761978, 0.02746003121137619, -0.1082579642534256, 0.01406587939709425, -0.04740755632519722, -0.009320657700300217, -0.03745296970009804, -0.0475282222032547, -0.03378685191273689, -0.0887167677283287, -0.0769588053226471, 0.03425219655036926, -0.13323073089122772, 0.005551130976527929, -0.09143652766942978, -0.05653727799654007, 0.04647804796695709, 0.0013403557240962982, 0.01362305972725153, 0.01269608922302723, 0.021756486967206, 0.01461790595203638, -0.0525890588760376, 0.03085133247077465, 0.017657505348324776, 0.04966622218489647, -0.014387071132659912, -0.04449959099292755, 0.02191978320479393, -0.0225661750882864, -0.0013184138806536794, -0.0249742791056633, -0.0069610909558832645, -0.022191423922777176, 0.0022618374787271023, -0.025490116328001022, 0.04371729493141174, 0.01120724342763424, 0.04676922783255577, 0.006760892923921347, 0.01822289451956749, 0.038672514259815216, 0.042055219411849976, 0.07371827214956284, -0.01567164435982704, 0.032737888395786285, -0.05818099528551102, 0.03315577656030655, -0.09062923491001129, 0.025963038206100464, -0.042556505650281906, -0.0011395181063562632, -0.015866469591856003, -0.0017823021626099944, -0.015083924867212772, -0.017364777624607086, 0.08501441776752472, -0.05075107514858246, 0.009332404471933842, -0.03167052939534187, -0.03944706544280052, 0.03379819169640541, -0.05778982490301132, 0.10456719994544983, -0.05716635286808014, 0.08019621670246124, -0.03547193482518196, -9.15293827353577e-33, -0.05234014242887497, 0.02363547682762146, -0.039355602115392685, 0.0755530446767807, 0.023392125964164734, -0.03497898951172829, 0.043087415397167206, -0.031533196568489075, 0.11691004037857056, 0.013245378620922565, -0.0749158263206482, -0.02406303398311138, 0.013557778671383858, -0.031574323773384094, -0.005644476972520351, 0.05035451427102089, -0.07511583715677261, -0.040417544543743134, 0.006571448873728514, 0.02403738908469677, -0.026129039004445076, 0.0683288648724556, -0.0981505960226059, 0.028646256774663925, -0.006464014761149883, 0.06841766089200974, -0.07301586866378784, 0.06129828840494156, 0.027620647102594376, -0.0003735873324330896, -0.040571022778749466, 0.002780057257041335, -0.03428901359438896, -0.007701392285525799, 0.013550633564591408, 0.04704286530613899, 0.016723820939660072, -0.015135753899812698, -0.015179136767983437, -0.06510227918624878, 0.12055136263370514, -0.06860942393541336, -0.05604323372244835, -0.05711495876312256, 0.0003665813128463924, 0.007343972101807594, -0.14319318532943726, -0.05911999195814133, -0.04559331014752388, 0.0415201298892498, 0.04967986419796944, -0.00969564076513052, 0.03763537108898163, -0.036169569939374924, -0.08342524617910385, -0.038450781255960464, 0.08911806344985962, 0.0004551869351416826, -0.09605702757835388, -0.0029643457382917404, 0.04083961620926857, -0.001564415404573083, 0.051795508712530136, 0.07041999697685242, 0.03485393524169922, -0.012477348558604717, 0.08970918506383896, 0.04753713309764862, -0.0048897662200033665, -0.09421640634536743, 0.040406614542007446, -0.05774129182100296, -0.013450528495013714, -0.007192249409854412, 0.038683705031871796, 0.09119293093681335, 0.03641171753406525, -0.11842160671949387, -0.0073922257870435715, -0.023406976833939552, -0.037725064903497696, -0.03422848507761955, 0.06976877897977829, 0.04192916676402092, -0.08777613192796707, 0.061202675104141235, -0.025893494486808777, 6.815457891207188e-05, -0.020657353103160858, 0.027074409648776054, -0.05550576001405716, 0.024955634027719498, -0.03116338700056076, 0.08668063580989838, -0.0016183949774131179, -5.8618429221724e-08, -0.010517727583646774, -0.013675089925527573, 0.06840088218450546, 0.03833036869764328, 0.027129847556352615, -0.08700426667928696, -0.05301274359226227, 0.09387116879224777, 0.014978164806962013, 0.03745032101869583, 0.007433266378939152, -0.011888556182384491, -0.05537780001759529, 0.07254532724618912, 0.07730778306722641, -0.012049784883856773, -0.04471708461642265, -0.010604163631796837, 0.012915445491671562, -0.047113675624132156, 0.046705711632966995, 0.006141315214335918, -0.021475592628121376, -0.029212135821580887, 0.018986355513334274, -0.0592028982937336, -0.0646476224064827, 0.07744591683149338, -0.04293728992342949, -0.01248086616396904, -0.019329911097884178, -0.03244559466838837, 0.06617888808250427, -0.024730445817112923, -0.0026353669818490744, -0.029374530538916588, -0.06926470249891281, -0.09659379720687866, 0.012099404819309711, 0.04152822494506836, 0.023498015478253365, 0.01793885976076126, 0.010912790894508362, -0.08690386265516281, -0.02180745080113411, -0.06670363247394562, -0.044329334050416946, -0.10376691073179245, 0.04320698231458664, -0.006855559069663286, -0.05034489929676056, 0.007604308892041445, 0.08191109448671341, 0.03647985681891441, 0.07445406913757324, 0.010577230714261532, 0.08191119134426117, 0.0024195616133511066, 0.09184717386960983, 0.11325831711292267, 0.03979926556348801, 0.016438692808151245, 0.0445968359708786, 0.016303976997733116]}