{"file_name": "botpenguin.com_blogs_types-of-white-label-saas", "text": "URL: https://botpenguin.com/blogs/types-of-white-label-saas\n11 Types of White Label SaaS Ideal for Reselling Businesses\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\n11 Types of White Label SaaS Ideal for Reselling Businesses\nPartner\nUpdated at Nov 13, 2024\n12 min to read\nAjay Pratap Sudhakar\nProduct Manager, BotPenguin\nTry BotPenguin\nTable of Contents\nWhat is White Label SaaS?\nBenefits of Reselling White Label SaaS\nWho Should Consider White Label SaaS Business Model?\nTypes of White Label SaaS\nConclusion\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nThe rise of Software-as-a-Service (SaaS) has revolutionized the way businesses operate, enabling them to access cutting-edge software solutions without the need for complex installations or extensive infrastructure.\nWhite label SaaS products have emerged as a compelling opportunity for reselling businesses to offer customized, branded solutions to their clients.\nAccording to a report by MarketsandMarkets, the global white label SaaS software market is expected to grow from $53.8 billion in 2022 to $87.6 billion by 2027, at a Compound Annual Growth Rate (CAGR) of 10.3% during the forecast period (MarketsandMarkets, 2022).\nThis growth is driven by the increasing demand for cost-effective and flexible software solutions across various industries.\nWith a wide range of white label SaaS products available, reselling businesses can cater to diverse customer needs, from project management and customer relationship management (CRM) to email marketing and business intelligence tools.\nBy leveraging these white label SaaS solutions, resellers can provide their clients with tailored, branded experiences, fostering customer loyalty and enhancing their competitive edge.\nSo continue reading to know the top 11 types of white label SaaS for reselling business.\nWhat is White Label SaaS?\nWhite label SaaS refers to software developed by one company but branded and sold by another.\nThis allows businesses to offer additional services to their clients without having to develop the technology themselves.\nEssentially, white label saas software is like buying a house you can put your name on and sell as if you built it from scratch.\nCompanies typically purchase a subscription from a white-label saas platform, then rebrand the software with their logos, colors, and other identifying elements.\nA great example of white label saas products is email marketing platforms. A vendor develops the software, and various businesses can rebrand it to offer it as their solution.\nThis approach saves development time and costs while enabling companies to expand their service portfolios.\nBenefits of Reselling White Label SaaS\nSource: Faster Capital\nThere are several compelling reasons why businesses choose to resell\nwhite-label saas:\nBrand Enhancement\n: Reselling white label SaaS under your brand name strengthens your market presence and helps establish customer loyalty.\nCost-Effectiveness\n: Developing software from scratch is expensive. By reselling white label saas, you avoid the high costs of development and maintenance.\nFaster Time to Marke\nt: You can launch new services quickly since the product is already developed and tested. This rapid deployment gives you a competitive edge.\nScalability\n: As a white label saas reseller, you can scale your offerings without the need to invest in additional technical infrastructure.\nFocus on Core Business\n: Outsourcing the complex white label SaaS software needs allows you to focus on your core business strategies and customer relationships.\nCustomization and Integration\n: Most white label saas software offers options for customization and integration, which means you can tailor the software to meet the specific needs of your clients or integrate it seamlessly with existing offerings.\nThese benefits illustrate why white label saas is not just a cost-effective solution, but a strategic one, enabling businesses to grow and adapt in a fast-evolving market.\nWho Should Consider White Label SaaS Business Model?\nThe white label saas business model is suitable for a broad range of businesses. Here are some entities that should consider it:\nMarketing Agencies:\nAgencies can add services like social media management, SEO, and email marketing through white label saas software, providing a full spectrum of marketing tools under one roof.\nIT Consultants:\nProfessionals in IT consulting can expand their offerings with white label SAAS products like CRM and project management tools, enhancing their value to clients.\nEntrepreneurs\n: Start-ups and entrepreneurs can utilize white-label saas to launch services swiftly and with lower upfront costs.\nE-commerce Platforms\n: E-commerce businesses can integrate\nwhite-label chatbot\nservices or advanced analytics tools to enhance user experience and backend operations.\nTelecom Companies\n: These businesses can offer additional services like VoIP or messaging platforms through saas white-label reseller programs, diversifying their product lines.\nAnyone looking to expand their product offerings without significant investment in new software development should consider the white label saas reseller model.\nWhite label SaaS offers a pathway to growth that aligns with entrepreneurial agility and efficiency.\nTypes of White Label SaaS\nIn the expanding uses of white label SaaS, businesses can quickly adapt and expand their offerings without the overhead of developing new technologies.\nThis section explores the various types of white label SaaS products: white label chatbots and white label marketing automation tools.\nWhite Label Chatbot\nA\nwhite label chatbot\nis a customizable chatbot service that companies can brand and sell as their product.\nThis type of white label AI saas harnesses artificial intelligence to provide automated customer service, lead generation, and engagement tools across various platforms like WhatsApp, Telegram, websites, and more.\nBotPenguin\nBotPenguin\nenables businesses to offer advanced white label SaaS chatbots that seamlessly integrate with platforms like Shopify, WordPress, WooCommerce, etc.\nHere’s a deeper look at this tool:\nCustomization and Branding Options\n: Complete customization with zero BotPenguin branding on the final product.\nTechnical Support and Service\n: Dedicated support and training are provided to ensure smooth operation and deployment.\nIntegration Capabilities\n: High compatibility with major platforms ensuring a broad application scope.\nTraining and Resources\n: Access to regular updates and enhancements to keep the service competitive.\nBotPenguin can be sold to any business looking to enhance its customer service or engagement without the technical hassle of developing its chatbot solutions.\nDocument\nShake Hands with BotPenguin to\nBecome a Leading Chatbot Reseller!\nBecome a Partner\nWhite Label Marketing Automation Tools\nWhite label marketing\nautomation tools are software solutions that automate various marketing tasks such as email campaigns, social media posting, and lead tracking.\nBusinesses can rebrand these tools and sell them as if they developed the software themselves, helping their clients to increase efficiency and marketing impact.\nActiveCampaign\nSource:\nActiveCampaign\nActiveCampaign allows companies to offer a robust marketing automation platform under their brand. Here's what it entails:\nCustomization and Branding Options\n: Offers extensive customization of the user interface and features, with the option to remove all ActiveCampaign branding.\nTechnical Support and Service\n: Includes comprehensive support and ongoing service updates to assist resellers and their clients.\nIntegration Capabilities\n: Strong integration capabilities with over 300 apps and services.\nTraining and Resources:\nProvides extensive training materials and resources to ensure resellers can effectively use and offer the platform.\nActiveCampaign is ideal for marketing agencies and consultants who wish to offer added value to their clients with powerful automation tools without the need for in-house software development.\nWhite Label Social Media Management\nSocial media management is crucial for businesses aiming to maintain an active, engaging online presence.\nA white label social media management tool allows companies to offer comprehensive social media solutions under their brand, helping clients manage multiple accounts, schedule posts, track engagement, and analyze performance.\nHootsuite\nSource:\nHootsuite\nHootsuite is a leader in social media management, widely adopted for its robust features and adaptability.\nCustomization and Branding Options\n: Offers branding options for dashboards and analytics reports.\nTechnical Support and Service\n: 24/7 support and dedicated account managers for enterprise levels.\nIntegration Capabilities\n: Extensive, with over 150 integrations including major social networks and business tools.\nTraining and Resources\n: Comprehensive training resources and certifications are available.\nHootsuite can be effectively sold to marketing agencies, large corporations, and SMEs looking to streamline their social media efforts.\nWhite Label CRM\nA white label CRM (\nCustomer Relationship Management\n) platform allows businesses to manage customer interactions, support, and relationships under their brand, tailoring features to specific business needs.\nZoho\nSource:\nZoho\nZoho CRM is a popular choice for its adaptability and extensive features. Here's a closer look:\nCustomization and Branding Options:\nHigh customization capabilities, including the removal of Zoho branding for a completely white-labeled experience.\nTechnical Support and Service:\nIncludes 24/7 support and dedicated account managers.\nIntegration Capabilities:\nRobust integration with over 300 popular business apps.\nTraining and Resources:\nOffers detailed training sessions and a rich library of resources for resellers.\nZoho CRM is ideal for businesses that require a detailed overview of customer interactions, making it perfect for B2B service providers and companies with a sales-driven approach.\nWhite Label Ecommerce Platform\nE-commerce platforms are the backbone of online retail, providing the tools necessary for web store creation, inventory management, and sales processing.\nA white label e-commerce platform enables companies to offer these services under their brand, tailored to specific market needs.\nSimvoly\nSimvoly is a white-label SaaS that focuses on simplicity and user experience, providing tools for building websites and e-commerce stores quickly.\nCustomization and Branding Options\n: Offers complete white labeling on website and checkout pages; Simvoly’s branding is minimal and mostly absent from client-facing components.\nTechnical Support and Service\n: Includes chat and email support, with generally positive reviews.\nIntegration Capabilities\n: Limited compared to larger platforms but includes key e-commerce and marketing tools.\nTraining and Resources\n: Access to marketing materials, onboarding documents, and responsive customer support.\nSimvoly is best sold to small businesses and entrepreneurs who need an easy-to-use platform to start their online store without extensive technical knowledge.\nSuggested Reading:\nLevel up your business game by reselling whitelabel chatbots\nWhite Label Landing Page Builder\nA white label landing page builder enables businesses to offer bespoke landing page creation services under their brand.\nThis tool is essential for marketing agencies and businesses looking to generate leads, run targeted campaigns, and improve conversion rates without the complexity of developing their software.\nUnbounce\nSource:\nUnbounce\nUnbounce is a powerful landing page platform known for its robust drag-and-drop builder that facilitates the rapid deployment of customized pages.\nCustomization and Branding Options\n: Extensive customization with options for branding client-facing elements.\nTechnical Support and Servic\ne: 24/7 support through chat and email, along with dedicated account management for premium clients.\nIntegration Capabilities\n: Integrates with numerous marketing tools and CRM systems.\nTraining and Resources\n: Offers comprehensive online tutorials, webinars, and a community forum.\nUnbounce is perfect for marketing agencies and independent digital marketers who need to produce high-converting landing pages for their campaigns.\nWhite Label Email Marketing Tool\nWhite label\nSaaS software allows businesses to provide comprehensive email marketing solutions, including campaign management, automation, and analytics, under their brand.\nThis helps companies strengthen customer relationships through targeted communication.\nConstant Contact\nConstant Contact is a recognized leader in email marketing, offering extensive tools for campaign management and execution.\nCustomization and Branding Options\n: Moderate customization capabilities for client-facing interfaces.\nTechnical Support and Service\n: Provides phone, email, and live chat support.\nIntegration Capabilities\n: Supports integration with various CRM and e-commerce platforms.\nTraining and Resources:\nAccess to extensive training materials and marketing guides.\nConstant Contact is ideal for small to medium-sized businesses, marketing agencies, and consultants aiming to enhance their clients' email marketing efforts.\nSuggested Reading:\nWhitelabel Chatbot: The Ultimate Solution for Chatbot Resellers\nWhite Label Webinar Platform\nA white label webinar platform enables businesses to host and manage webinars under their own brand.\nThis is particularly valuable for educational providers, event organizers, and corporate trainers.\nGoToWebinar\nSource:\nGoToWebinar\nGoToWebinar is widely acclaimed for its reliability and comprehensive features that support webinar hosting and management.\nCustomization and Branding Options\n: Offers limited customization for branding the user interface.\nTechnical Support and Service:\nIncludes 24/7 technical support and dedicated customer service.\nIntegration Capabilities\n: Easily integrates with CRM tools, email platforms, and learning management systems.\nTraining and Resources\n: Provides training sessions, detailed guides, and customer support.\nGoToWebinar is best suited for educational institutions, corporate training departments, and professional event organizers who need reliable and scalable webinar solutions.\nWhite Label Project Management Tool\nProject management tools are essential for businesses looking to streamline workflow, enhance team collaboration, and track project progress efficiently.\nA white label project management tool allows companies to offer these functionalities under their brand, providing a seamless experience to their clients.\nAsana\nSource:\nAsana\nAsana\nis a renowned project management tool known for its ease of use and powerful features that help teams stay in sync.\nCustomization and Branding Option\ns: Limited branding options mainly to integrations and reporting.\nTechnical Support and Service\n: High-quality support including dedicated account managers for premium accounts.\nIntegration Capabilities\n: Extensive, including hundreds of integrations with other tools.\nTraining and Resources\n: Comprehensive training materials available through Asana Academy and community forums.\nAsana is ideal for technology consultants, IT service providers, and business coaches who work with teams looking to improve productivity and collaboration.\nSuggested Reading:\nChatbot Reseller vs White Label: Which is Best for You?\nWhite Label Reporting and Analytics Tool\nReporting and analytics tools are indispensable for businesses wanting to make informed decisions based on accurate data.\nWhite label reporting and analytics tools allow companies to provide personalized analytics solutions to their clients, all under their branding.\nLooker\nLooker is a powerful data exploration and reporting tool that enables businesses to deliver real-time analytics.\nCustomization and Branding Options\n: Strong customization in dashboards and reports; minimal Looker branding.\nTechnical Support and Service:\nExcellent support with setup, maintenance, and troubleshooting.\nIntegration Capabilities:\nRobust, supports integration with a variety of databases and software platforms.\nTraining and Resources:\nExtensive resources including Looker documentation, community forums, and dedicated training sessions.\nLooker is particularly suited for business intelligence consultants and large enterprises that require detailed insights into their operations.\nWhite Label SEO Tools\nSEO tools are critical for businesses aiming to improve their online presence and search engine rankings.\nA white label SEO tool allows marketing agencies and consultants to offer comprehensive SEO services under their brand, helping clients optimize their websites and content effectively.\nSemrush\nSource:\nSemrush\nSemrush is a comprehensive SEO toolkit that offers extensive capabilities for search optimization, content marketing, and competitive analysis.\nCustomization and Branding Options\n: Offers some level of customization in reporting and client dashboards.\nTechnical Support and Service\n: Includes 24/7 support and a dedicated account manager for enterprise plans.\nIntegration Capabilities\n: Highly integrative with other marketing tools and platforms.\nTraining and Resources\n: Provides extensive training through webinars, e-books, and an online knowledge base.\nSemrush is perfect for digital marketing agencies and independent SEO consultants who wish to provide a complete suite of SEO services to their clients.\nDocument\nJoin the Booming Chatbot Market\nBecome a Reseller Now!\nTry BotPenguin\nConclusion\nIn conclusion, white label SaaS software presents a lucrative opportunity for entrepreneurs and businesses looking to enter the tech market without extensive development costs.\nFrom white label chatbots to comprehensive white label SaaS platforms, the options are diverse and cater to various industries.\nWhite label SaaS resellers benefit from established products while focusing on marketing and customer relationships.\nAmong the best white label SaaS options, BotPenguin stands out as a leading white label chatbot provider. As the demand for AI-powered solutions grows, white label AI SaaS products like BotPenguin offer cutting-edge technology to resellers.\nWhether you're interested in becoming a SaaS white label reseller or exploring white label SaaS products for your business, the market is ripe with opportunities.\nRemember, success as a white label SaaS reseller depends on choosing the right white label SaaS platform and understanding your target market.\nWith platforms like BotPenguin, you can confidently enter the world of white label AI SaaS and chatbot solutions, positioning your business at the forefront of technological innovation.\nFrequently Asked Questions (FAQs)\nWhy is white label SaaS software popular among reselling businesses?\nIt's popular because it enables rapid market entry, brand consistency, and an expanded service offering without the high costs and time commitment associated with developing proprietary software.\nHow can white label SaaS improve a business's service offering?\nWhite label SaaS lets companies offer comprehensive, ready-made solutions to their clients under their own brand, enhancing their market reputation and customer satisfaction.\nCan white label SaaS software be integrated with other systems?\nYes, most white label SaaS solutions are designed with integration capabilities to seamlessly work with existing business systems, enhancing functionality and user experience.\nWhat are the key features to look for in a white label SaaS provider?\nKey features include customization options, scalability, reliability, comprehensive support, and integration capabilities with other tools and systems.\nHow does white label SaaS foster brand loyalty?\nBy allowing businesses to offer reliable and continuous branded services, white label SaaS fosters customer trust and loyalty, which are crucial for long-term business growth.\nAre there specific challenges associated with selling white label SaaS products?\nChallenges include maintaining service quality, managing customer support, and ensuring that the underlying software consistently meets the evolving needs of clients.\nWhat strategies can be effective in marketing white-label SaaS products?\nEffective strategies include focusing on niche markets, emphasizing unique features and benefits of the software, and offering competitive pricing and excellent customer support.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\n11 Reselling Business Ideas that costs less than $250 per Year\nUpdated at Oct 11, 2024\n9 min to read\nRahul Gupta\nAssistant Marketing Manager, BotPenguin\n30 Best Affiliate Programs to Join in 2024\nUpdated at Oct 10, 2024\n15 min to read\nBotPenguin\nContent Writer, BotPenguin\n10 Best White Label Ecommerce Software for Reselling in 2024\nUpdated at Oct 15, 2024\n11 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nWhat is White Label SaaS?\nBenefits of Reselling White Label SaaS\nWho Should Consider White Label SaaS Business Model?\nTypes of White Label SaaS\nConclusion\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10095599293708801, -0.06323675066232681, -0.005549821071326733, 0.01881922036409378, 0.010017299093306065, 0.0014614653773605824, 0.035419244319200516, 0.0747552141547203, -0.01108160987496376, 0.00016102830704767257, 0.02198309823870659, -0.008745362050831318, 0.013116494752466679, 0.019305311143398285, 0.11317307502031326, 0.0035487613640725613, 0.12728844583034515, -0.09633678197860718, -0.09745196253061295, -0.02901614084839821, -0.008055399172008038, -0.026385782286524773, 0.03160639852285385, -0.014033087529242039, -0.04229696840047836, -0.04201299324631691, -0.030390506610274315, -0.027788257226347923, -0.011523657478392124, -0.06598779559135437, 0.002650679787620902, 0.04233279824256897, 0.02963515929877758, 0.06681402027606964, -0.00481459079310298, -0.06495402753353119, -0.022530589252710342, 0.007059306371957064, 0.08335666358470917, -0.03649141639471054, -0.049837421625852585, -0.08298446238040924, -0.05422312393784523, -0.009527727961540222, 0.07945837825536728, -0.015954529866576195, -0.05852045118808746, 0.009012280963361263, 0.008502598851919174, 0.06138458475470543, -0.06263541430234909, -0.06709887087345123, 0.0039505306631326675, 0.047378312796354294, -0.0661974847316742, 0.023730531334877014, -0.030397504568099976, -0.011537431739270687, 0.06101546436548233, -0.026440560817718506, -0.04747595638036728, -0.020283794030547142, 0.03299656882882118, 0.04556727409362793, -0.026500102132558823, 0.03620300814509392, -0.11561624705791473, 0.010226139798760414, -0.02649344503879547, -0.030786950141191483, 0.005224849097430706, -0.027939753606915474, -0.016984380781650543, 0.06366147100925446, 0.015259524807333946, -0.016219086945056915, 0.03560805320739746, 0.00499344477429986, 0.018599219620227814, -0.07183582335710526, -0.011608142405748367, 0.05133657157421112, -0.018337350338697433, 0.08185452222824097, -0.028537431731820107, -0.002651033690199256, 0.015106474980711937, 0.02531171590089798, -0.011139937676489353, 0.01304862555116415, 0.030468929558992386, 0.007230805233120918, 0.02725876495242119, -0.0038991619367152452, 0.023053236305713654, 0.0015129034873098135, -0.06578990817070007, 0.019094809889793396, -0.03719859570264816, 0.005167666357010603, -0.005946740973740816, -0.04596138745546341, -0.026703666895627975, -0.08468212187290192, -0.06079670414328575, 0.0003141098713967949, 0.06434431672096252, 0.0031369125936180353, 0.12112609297037125, 0.01014393288642168, -0.11040893942117691, -0.03434537723660469, -0.028392422944307327, -0.02914358861744404, 0.01279129832983017, -0.01666039600968361, -0.023017508909106255, 0.03827308490872383, 0.13022299110889435, 0.0029272986575961113, 0.058155134320259094, 0.04427983984351158, 0.00829829927533865, -0.05487314239144325, 0.058271247893571854, 0.03273800387978554, -0.0061593856662511826, 1.1486168928959267e-32, -0.03417987376451492, 0.03980463370680809, -0.06298042088747025, 0.06354498863220215, 0.04371079057455063, 0.02992275543510914, -0.0046604289673268795, 0.05355258285999298, -0.06206103041768074, -0.016449106857180595, -0.09829460084438324, 0.13835152983665466, -0.09365946054458618, 0.041015010327100754, 0.033194370567798615, -0.08153257519006729, 0.016787253320217133, 0.014679277315735817, 0.030278438702225685, -0.0225776769220829, 0.08893230557441711, -0.015900447964668274, 0.07034099847078323, 0.07834938168525696, 0.11801239848136902, -0.009072349406778812, 0.06365608423948288, 0.03137426823377609, 0.06286166608333588, 0.031790293753147125, -0.06851588934659958, 0.004503394942730665, -0.039274685084819794, 0.032226722687482834, -0.07810480147600174, -0.018350746482610703, -0.08196808397769928, -0.10390666872262955, -0.05033263564109802, 0.04269693046808243, -0.1305498629808426, 0.04423661157488823, -0.10178906470537186, -0.052311815321445465, 0.05073912814259529, 0.020992392674088478, 0.02144082821905613, -0.004396814852952957, 0.031402286142110825, 0.03895992785692215, -0.06272079050540924, 0.0017365931998938322, 0.048480018973350525, 0.0826575830578804, 0.0004894582671113312, -0.0637877956032753, 0.04427330568432808, -0.06478172540664673, -0.014158945530653, -0.038672540336847305, -0.018985453993082047, -0.04079250618815422, -0.02575167641043663, -0.011422690935432911, 0.0527852401137352, 0.027202622964978218, 0.048422154039144516, 0.03173862397670746, 0.019989803433418274, 0.0010510062566027045, 0.08025354892015457, 0.0375247523188591, -0.011375989764928818, 0.04793152958154678, -0.05694589391350746, 0.0028999149799346924, -0.08159022033214569, 0.020577121526002884, -0.042574308812618256, 0.021543005481362343, -0.02765912003815174, 0.02208702825009823, -0.008194073103368282, -0.0032205230090767145, 0.0441318042576313, -0.027380995452404022, 0.039879582822322845, -0.05245237797498703, -0.006850142031908035, 0.05119022727012634, -0.058997269719839096, 0.08406869322061539, -0.06629826128482819, 0.07429198920726776, -0.04790768772363663, -9.042144992234893e-33, -0.06039833649992943, -0.00011292706039967015, -0.031700361520051956, 0.10090287029743195, -0.0002491435152478516, -0.017034221440553665, 0.05729905143380165, -0.024510959163308144, 0.11276431381702423, -0.006020961795002222, -0.08207030594348907, -0.005973343271762133, 0.002340166363865137, -0.02207232639193535, 0.000895960780326277, -0.007061731070280075, -0.062308840453624725, -0.012248298153281212, 0.02821405790746212, 0.023998383432626724, -0.018938666209578514, 0.10640519112348557, -0.10291776806116104, -0.002275463193655014, 0.015160939656198025, 0.03372262790799141, -0.08189013600349426, 0.06809254735708237, -0.0009052999084815383, 0.024604199454188347, -0.03205854818224907, -0.00914779957383871, 0.0022409074008464813, 0.013388405553996563, -0.01024144608527422, 0.016455359756946564, 0.02165335975587368, 0.005358133930712938, -0.01352462824434042, -0.054512869566679, 0.0870215967297554, -0.04621167853474617, -0.04723476618528366, -0.07559020072221756, -0.014633324928581715, 0.011444437317550182, -0.13585712015628815, -0.03620535880327225, -0.05131598562002182, 0.014252593740820885, 0.04114210605621338, -0.013288862071931362, 0.025281991809606552, -0.046943288296461105, -0.08795098215341568, -0.044923316687345505, 0.09140784293413162, 0.011804403737187386, -0.10497522354125977, 0.036843348294496536, 0.04365863651037216, 0.04141605645418167, 0.053496941924095154, 0.06902113556861877, 0.05971232429146767, -0.023072537034749985, 0.08924894779920578, 0.02150855027139187, -0.032865606248378754, -0.12297260761260986, 0.053221821784973145, -0.0451788455247879, -0.04867022857069969, -0.0019429521635174751, -0.024427201598882675, 0.05828101187944412, 0.020352540537714958, -0.08853417634963989, -0.012683088891208172, -0.018789101392030716, -0.044159725308418274, -0.009375547990202904, 0.0641324371099472, 0.05491077899932861, -0.07452888786792755, 0.08649682998657227, -0.03509404510259628, -0.025570478290319443, 0.005070397164672613, 0.01448600459843874, -0.07920898497104645, 0.005929374136030674, -0.013247883878648281, 0.14895956218242645, 0.014388609677553177, -6.034393607023958e-08, -0.02935709059238434, 0.014123241417109966, 0.05649804323911667, 0.05703682079911232, 0.03595176339149475, -0.05805053561925888, -0.06853068619966507, 0.04615902155637741, 0.03511960059404373, 0.06571401655673981, -0.017807187512516975, -0.0459546260535717, -0.06721034646034241, 0.0848274677991867, 0.047448065131902695, -0.0114698875695467, -0.013016469776630402, -0.004447516985237598, 0.008431492373347282, -0.018847377970814705, 0.06086799129843712, 0.030889788642525673, -0.00399582926183939, -0.04087342321872711, 0.016880054026842117, -0.0828833132982254, -0.04903637245297432, 0.09171097725629807, -0.02901005558669567, -0.0019841522444039583, -0.029155360534787178, -0.019580459222197533, 0.07841109484434128, -0.033109258860349655, 0.014555822126567364, -0.013168202713131905, -0.0756978914141655, -0.0453302226960659, 0.03308694809675217, 0.0696178674697876, 0.010105033405125141, 0.031949374824762344, 0.02680773101747036, -0.08802694082260132, -0.00971790961921215, -0.05417928844690323, -0.09004969894886017, -0.0805525928735733, 0.027429893612861633, 0.00032099528471007943, -0.035561442375183105, 0.006014165002852678, 0.0433531329035759, 0.04010331630706787, 0.07393043488264084, -0.03262493759393692, 0.06849423050880432, -0.013512525707483292, 0.08223065733909607, 0.13222315907478333, 0.046666305512189865, -0.019421355798840523, 0.010511219501495361, 0.019203098490834236]}