{"file_name": "botpenguin.com_glossary_google-analytics", "text": "URL: https://botpenguin.com/glossary/google-analytics\nGoogle Analytics: Benefits & Key Terminology | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nGoogle Analytics\nTable of Contents\nWhat is Google Analytics?\nWho Benefits from Google Analytics?\nWhy Use Google Analytics?\nWhen to Use Google Analytics?\nWhere to Access Google Analytics?\nHow to Set Up and Use Google Analytics?\nKey Google Analytics Terminology\nAdvanced Google Analytics Features\nFrequently Asked Questions\nShare\nLink copied\nWhat is Google Analytics?\nSource: Google\nGoogle Analytics is a free web analytics tool that empowers you to analyze your website's performance and make data-driven decisions. It collects and organizes data related to your site's visitors, their behavior, and sources of traffic. The primary purpose of Google Analytics is to help you understand your audience better, track your marketing efforts, and optimize your website for conversions and engagement.\nHistory and Evolution\nGoogle Analytics has come a long way since its inception in 2005. It all started when Google acquired Urchin Software Corporation, a web analytics company. Google then rebranded and launched the product as \"Google Analytics.\" Over the years, it has gone through several updates, including the introduction of real-time analytics, mobile app analytics, and enhanced e-commerce features, making it the go-to analytics platform for millions of users worldwide.\nImportance in Digital Marketing\nIn the ever-evolving world of digital marketing, keeping track of your online performance is crucial. Google Analytics plays a significant role in helping businesses understand the effectiveness of their marketing strategies. Some of its importance in digital marketing include:\nIdentifying the most valuable traffic sources and channels\nTracking visitors' behavior and engagement on your site\nAnalyzing conversion rates and identifying areas for improvement\nEvaluating the success of content marketing and social media campaigns\nAiding in SEO optimization by providing insights into user queries and site performance\nWith Google Analytics, digital marketers can make informed decisions and allocate resources more efficiently, ensuring a higher return on investment.\nWho Benefits from Google Analytics?\nBusiness Owners\nWhether you're a small business owner or a large enterprise, understanding your website's performance is vital for growth. Google Analytics offers valuable insights that help business owners make data-driven decisions about their marketing strategies, website design, and user experience. By leveraging this information, businesses can optimize their online presence, attract more customers, and ultimately, increase revenue.\nDigital Marketers\nGoogle Analytics is a digital marketer's best friend. It provides them with essential data to measure the success of their marketing campaigns, identify trends, and uncover areas for improvement. With Google Analytics, digital marketers can track not only the number of visitors but also the quality of these visitors. This enables them to refine their marketing strategies, allocate resources effectively, and maximize their impact.\nSEO Specialists\nSearch engine optimization (SEO) specialists rely on Google Analytics to gain insights into their website's organic search performance. With this information, they can identify the most effective keywords, understand user behavior, and uncover opportunities for improving their site's search engine ranking. Moreover, Google Analytics helps SEO specialists track the impact of their optimization efforts, ensuring they stay on top of their game in the competitive online landscape.\nWeb Developers\nGoogle Analytics isn't just for marketers and business owners - it's a valuable tool for web developers too. By integrating Google Analytics into their projects, developers can gain insights into how users interact with the site, identify potential issues, and monitor the site's performance. This information is crucial in creating a seamless, user-friendly experience that keeps visitors coming back for more.\nWhy Use Google Analytics?\nAh, the age-old question: Why bother using Google Analytics? We're glad you asked! There are a plethora of reasons to embrace this powerful tool, and we're here to break it down for you. So grab a cup of coffee, sit back, and let's dive in!\nData-Driven Decision Making\nIf you're not making decisions based on data, you're just guessing. And who wants to be that person at the party who's always guessing? Not us! Google Analytics provides valuable insights into your website's performance, allowing you to make well-informed decisions that can take your business to new heights. From tracking user behavior to identifying popular content, Google Analytics is like having your very own crystal ball. But with actual data instead of murky visions.\nEvaluate Marketing Campaigns\nYou've spent countless hours (and dollars) on your marketing campaigns, so it only makes sense to measure their effectiveness. Google Analytics helps you do just that by providing insights into how users are interacting with your campaigns. You can see which channels are driving the most traffic, how long users are staying on your site, and even track conversions. With this valuable information at your fingertips, you can tweak and refine your campaigns to maximize their impact. After all, you wouldn't want all that hard work to go to waste, would you?\nOptimize Website Performance\nThere's nothing worse than a slow-loading website, am I right? Google Analytics won't make your site faster (sorry!), but it can help you identify areas that need improvement. From page load times to mobile responsiveness, Google Analytics provides the data you need to ensure your website is running as smoothly as possible. After all, a well-performing website leads to happier users, and happier users lead to more conversions. It's a win-win!\nEnhance User Experience\nWebsites are like parties: if your guests aren't having a good time, they're going to leave. Google Analytics helps you create a user experience that keeps your visitors engaged and coming back for more. By analyzing user behavior, you can identify areas of your site that need a little extra love, and make changes that will put a smile on your users' faces. And who doesn't love a good party?\nSuggested Reading:\nTrigger\nWhen to Use Google Analytics?\nNow that we've convinced you of the many benefits of Google Analytics (we hope!), it's time to answer another burning question: When should you use it? Spoiler alert: it's pretty much always!\nSetting up a New Website\nIf you're creating a new website, Google Analytics should be one of the first tools you set up. After all, you want to start gathering data from day one, right? From tracking your initial traffic to understanding user behavior, Google Analytics provides valuable insights that can help you make your website the best it can be right out of the gate.\nOngoing Monitoring and Analysis\nThink of Google Analytics as your website's personal trainer: it's always there to keep you in tip-top shape. By regularly monitoring your site's performance and analyzing the data, you can make ongoing improvements that will keep your website healthy and thriving. Plus, it's a great way to spot trends and identify opportunities for growth.\nDuring and After Marketing Campaigns\nYou've launched a shiny new marketing campaign, and you're eager to see how it's performing. Google Analytics to the rescue! By tracking your campaign's performance in real-time, you can make adjustments on the fly to ensure maximum effectiveness. And once your campaign has ended, use the data to evaluate its overall success and identify areas for improvement in future campaigns. Who knew data could be so fun?\nA/B Testing and Optimization\nIf you're not familiar with\nA/B testing\n, think of it as a friendly competition between two versions of a webpage or marketing element. Google Analytics makes it easy to conduct A/B tests and analyze the results, helping you optimize your website and marketing materials for maximum impact. So go ahead, pit your headlines, images, or call-to-actions against each other, and let the best version win!\nWhere to Access Google Analytics?\nSo, you've decided to take the plunge and explore the magical world of Google Analytics. Fantastic choice! But where do you start? Fear not, dear reader, we've got you covered. Here are the various ways you can access Google Analytics:\nGoogle Analytics Website\nThe most common way to access Google Analytics is through its website. Simply head over to\nhttps://analytics.google.com/\nand sign in using your Google account. If you're new to Google Analytics, you'll need to sign up for a free account first. Once logged in, you'll be greeted with your Google Analytics dashboard, where you can dive into all the glorious data!\nMobile App\nCan't bear to be away from your precious analytics data? We feel you. That's why Google has created the Google Analytics mobile app, available for both Android and iOS devices. With the app, you can access your data on the go, track real-time activity, and stay up to date with your website's performance. Just search for \"Google Analytics\" in your respective app store, download the app, and sign in with your Google account.\nIntegrations with Other Tools\nGoogle Analytics can also be integrated with various other platforms and tools. This allows you to access your analytics data within those tools, streamlining your workflow and making data-driven decisions even easier. Some popular integrations include:\nGoogle Data Studio: Create custom, interactive reports and dashboards using your Google Analytics data.\nGoogle Ads: Link your Google Analytics account to your Google Ads account to track ad performance and optimize your campaigns.\nContent Management Systems (CMS): Many CMS platforms, like WordPress and Shopify, offer Google Analytics integration, allowing you to access your data directly from your website's admin panel.\nHow to Set Up and Use Google Analytics?\nAlright, you know where to find Google Analytics, but how do you set it up and start using it? Let's walk through the process together, step by delightful step.\nStep 1\nAccount Creation and Property Setup\nFirst things first: you'll need to create a Google Analytics account (if you haven't already). Head over to the Google Analytics website and sign up using your Google account. Once you're signed up, you'll be prompted to create a \"property.\" Think of a property as a unique website or app you want to track. Give your property a name, and you're all set!\nStep 2\nInstalling Tracking Code on Your Website\nFor Google Analytics to work its magic, you'll need to install a tracking code on your website. This code collects data from your site and sends it back to Google Analytics for processing. Fear not, it's easier than it sounds!\nAfter creating your property, Google Analytics will provide you with a unique tracking code (it looks like a snippet of JavaScript code).\nCopy this code, and paste it into the header (between the\n<head>\ntags) of every page on your website.\nIf you're using a CMS like WordPress or Shopify, there are plugins and integrations available that can help you install the tracking code without having to edit your site's code manually.\nStep 3\nConfiguring Basic Settings\nNow that your tracking code is in place, it's time to configure some basic settings in Google Analytics:\nSet up your \"reporting timezone\" to ensure your data is reported accurately based on your location.\nConfigure \"goals\" to track specific actions or conversions on your website (e.g., newsletter sign-ups, purchases, etc.).\nEnable \"site search\" tracking if your website has a search functionality, allowing you to analyze how users search within your site.\nApply filters to exclude internal traffic, bots, and spam, ensuring your data is clean and accurate.\nStep 4\nNavigating the Google Analytics Dashboard\nCongratulations! You've set up Google Analytics and are ready to explore your data. The Google Analytics dashboard is your command center, where you can view various reports and gain insights into your website's performance. Here's a quick overview of some key sections:\nReal-Time:\nSee how many users are on your site right now, what pages they're viewing, and where they're coming from.\nAudience:\nDive deep into your website's audience demographics, interests, and behavior.\nAcquisition:\nAnalyze your traffic sources and channels, and see how users are finding your site.\nBehavior:\nUnderstand how users engage with your content, which pages are popular, and how they navigate through your site.\nConversions:\nTrack your goals, e-commerce transactions, and other important actions that drive your business forward.\nKey Google Analytics Terminology\nBefore you dive headfirst into the deep end of Google Analytics, it's essential to familiarize yourself with some key terminology. After all, you don't want to be left scratching your head when faced with a sea of metrics and dimensions! So, let's break down some crucial Google Analytics terms.\nMetrics and Dimensions\nMetrics and dimensions are the bread and butter of Google Analytics. Metrics are the quantitative measurements of your website's performance, while dimensions are the attributes or characteristics that describe your data.\nFor example, \"Pageviews\" is a metric that measures the number of times a page is viewed, and \"Browser\" is a dimension that describes the type of browser your users are using. Together, metrics and dimensions help paint a vivid picture of your website's performance and user behavior.\nChannels and Source/Medium\nChannels and Source/Medium are two ways Google Analytics categorizes your traffic sources. Channels are broad groupings of traffic sources, such as Organic Search, Direct, Social, and Referral. Source/Medium, on the other hand, provides more granular information about where your users are coming from.\nFor example, if a user clicks a link to your site from a Facebook post, the channel would be \"Social,\" and the Source/Medium would be \"facebook.com/referral.\"\nSessions, Users, and Pageviews\nThese three terms are the foundation of your Google Analytics reports:\nSessions:\nA session represents a single visit to your website, encompassing all the actions a user takes within a given time frame.\nUsers:\nUsers are the people visiting your website. Google Analytics differentiates between \"new users\" (first-time visitors) and \"returning users\" (those who have visited your site before).\nPageviews:\nA pageview occurs each time a page on your website is loaded or reloaded in a user's browser. This metric helps you understand which pages are popular and how users engage with your content.\nBounce Rate and Exit Rate\nBounce Rate and Exit Rate are two metrics that help you gauge the effectiveness of your website's user experience:\nBounce Rate:\nThe percentage of single-page sessions, where users leave your site without interacting with any other pages. A high bounce rate may indicate that your content or user experience isn't meeting users' expectations.\nExit Rate:\nThe percentage of exits (when a user leaves your site) from a specific page, compared to the total number of views for that page. This metric helps you identify pages where users tend to leave your site, which may need optimization or improvement.\nGoals, E-commerce, and Event Tracking\nGoogle Analytics allows you to track specific actions or conversions on your website through Goals, Ecommerce, and Event Tracking:\nGoals:\nGoals are custom-configured actions or outcomes that you want users to complete on your website, such as signing up for a newsletter or making a purchase. By setting up Goals, you can measure your website's effectiveness in driving these desired actions.\nEcommerce:\nThe Ecommerce tracking feature allows you to track transactions and revenue generated by your online store, providing valuable insights into your customers' shopping behavior and product performance.\nEvent Tracking:\nEvents are user interactions with your site that don't involve loading a new page, such as clicking a button or playing a video. Event Tracking allows you to measure and analyze these interactions, helping you optimize your site for user engagement.\nAdvanced Google Analytics Features\nOnce you've mastered the basics, it's time to explore some of the more advanced features Google Analytics has to offer:\nCustom Reports and Dashboards\nGoogle Analytics allows you to create custom reports and dashboards tailored to your specific needs. Custom Reports let you choose the exact metrics and dimensions you want to see, while Dashboards provide a visual overview of your data, allowing you to monitor key performance indicators at a glance.\nSegmentation and Filters\nSegmentation and filters enable you to isolate specific subsets of your data for more in-depth analysis. Segmentation lets you compare different user groups or behaviors, while filters allow you to exclude or include specific data in your reports. This helps you uncover hidden patterns and trends in your data, providing actionable insights for optimization.\nMulti-Channel Funnels and Attribution Models\nMulti-Channel Funnels and Attribution Models help you understand the complete user journey and the role of different marketing channels in driving conversions:\nMulti-Channel Funnels:\nThese reports show how users interact with your site across multiple sessions and channels before converting. This helps you understand the value of each channel and allocate your marketing resources more effectively.\nAttribution Models:\nAttribution models\ndetermine how much credit each channel receives for a conversion. Google Analytics offers several pre-built models, such as Last-Click, First-Click, and Linear, as well as the option to create\nFrequently Asked Questions\n1. What is Google Analytics?\nGoogle Analytics is a free web analytics tool that tracks website traffic, user behavior, and provides insights to optimize your website and marketing strategies.\n2. How do I set up Google Analytics?\nSign up for a Google Analytics account, create a property for your website, and add the tracking code to your website's HTML.\n3. What are Google Analytics goals?\nGoals in Google Analytics help measure specific user actions, such as form submissions, purchases, or time spent on a page, to track your website's performance.\n4. Can I track multiple websites with Google Analytics?\nYes, you can create multiple properties within your Google Analytics account to track different websites or subdomains.\n5. How do I grant access to my Google Analytics account?\nIn Google Analytics, go to Admin, select \"User Management,\" and add email addresses to grant access with specific permissions.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat is Google Analytics?\nWho Benefits from Google Analytics?\nWhy Use Google Analytics?\nWhen to Use Google Analytics?\nWhere to Access Google Analytics?\nHow to Set Up and Use Google Analytics?\nKey Google Analytics Terminology\nAdvanced Google Analytics Features\nFrequently Asked Questions\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10775069147348404, -0.06796576082706451, 0.010376143269240856, 0.027136756107211113, -0.010884630493819714, -0.038825709372758865, 0.05871298164129257, 0.051639165729284286, -0.0025085904635488987, 0.025860540568828583, 0.04123523831367493, -0.015042582526803017, 0.019968468695878983, 0.03153609484434128, 0.09047970175743103, 0.008468053303658962, 0.12631520628929138, -0.0951971709728241, -0.08118206262588501, -0.03579308092594147, -0.036894313991069794, -0.018645139411091805, 0.04756028205156326, -0.03669971600174904, -0.01446597371250391, -0.03656526654958725, -0.042532939463853836, -0.022046511992812157, -0.018288668245077133, -0.0643727108836174, -0.020975958555936813, 0.017224658280611038, -0.003506776411086321, 0.06477074325084686, -0.03008953295648098, -0.042824581265449524, -0.02771962247788906, 0.022141335532069206, 0.08949610590934753, -0.04920992627739906, -0.07926192134618759, -0.07541663199663162, -0.04375775158405304, -0.013307946734130383, 0.07796811312437057, -0.009756690822541714, -0.06074399873614311, 0.011296462267637253, -0.0015415732050314546, 0.07947869598865509, -0.08596442639827728, -0.04114729166030884, 0.0466846339404583, 0.04259650409221649, -0.023546593263745308, 0.038375645875930786, -0.04302603006362915, 0.008378734812140465, 0.03690299019217491, 0.019582154229283333, -0.04872077330946922, -0.009947840124368668, 0.0400015152990818, 0.03569692745804787, -0.031206928193569183, 0.0410337969660759, -0.10164166241884232, 0.001519539044238627, -0.02245205081999302, -0.028789080679416656, -0.010309876874089241, -0.016089389100670815, -0.06480192393064499, 0.028455771505832672, 0.015782300382852554, -0.024069132283329964, -0.004241351969540119, -0.0009639819618314505, 0.047800421714782715, -0.061247747391462326, -0.02021019533276558, 0.04923165589570999, 0.021283596754074097, 0.07955519109964371, -0.01771600916981697, -0.047993652522563934, -0.011902940459549427, 0.033024899661540985, -0.032472945749759674, 0.0028664516285061836, 0.032292772084474564, 0.01775851473212242, 0.022189758718013763, 0.009003974497318268, 0.016978556290268898, 0.003745964029803872, -0.08890371769666672, 0.023150872439146042, -0.04254494234919548, -0.013362575322389603, 0.011318419128656387, -0.031367283314466476, -0.05582354962825775, -0.057244379073381424, -0.05468354374170303, 0.00027262797811999917, 0.05620017275214195, -0.01099699828773737, 0.12222981452941895, 0.030222516506910324, -0.11019138991832733, -0.041495807468891144, 0.005305076949298382, -0.022038407623767853, 0.009529338218271732, 0.03487010672688484, -0.05605738237500191, 0.060599666088819504, 0.15988972783088684, 0.048494260758161545, 0.060640037059783936, 0.06500860303640366, 0.015491385012865067, -0.006288615055382252, 0.07024672627449036, 0.05304915830492973, -0.017400572076439857, 1.0999850752976763e-32, -0.03152821213006973, 0.026019299402832985, -0.06750822067260742, 0.07893607765436172, 0.010651876218616962, 0.048655036836862564, -0.006858668755739927, 0.04160194844007492, -0.05985545367002487, -0.016119668260216713, -0.096168652176857, 0.13008923828601837, -0.07736512273550034, 0.0537358894944191, 0.05028733238577843, -0.05508602038025856, -0.008161468431353569, 0.04536935314536095, 0.0324767604470253, -0.001584861776791513, 0.09897910058498383, -0.04464269429445267, 0.06443805992603302, 0.08516856282949448, 0.13870742917060852, 0.028429023921489716, 0.06961411982774734, 0.025599418208003044, 0.032312504947185516, 0.038009654730558395, -0.06431141495704651, 0.0054494477808475494, -0.051553405821323395, 0.03410615772008896, -0.056292179971933365, -0.06664691120386124, -0.03430398926138878, -0.11308132857084274, -0.07685468345880508, 0.050086166709661484, -0.1407962441444397, 0.0215604268014431, -0.1105821505188942, -0.07600148022174835, 0.00526286568492651, 0.02022574096918106, 0.029224418103694916, 0.007152816280722618, 0.051129817962646484, 0.023592796176671982, -0.04921746253967285, 0.027831723913550377, 0.042760442942380905, 0.048341188579797745, -0.012359215877950191, -0.01428189780563116, 0.0383673831820488, -0.05277397111058235, -0.014597699977457523, -0.041002627462148666, -0.02290472202003002, -0.01316000334918499, -0.003539820434525609, -0.04137237370014191, 0.059625644236803055, 0.019555464386940002, 0.0545446015894413, 0.04316212236881256, 0.0336327962577343, 0.03722070902585983, 0.0467858724296093, 0.03801407292485237, -0.020189760252833366, 0.040659692138433456, -0.011437182314693928, -0.011319387704133987, -0.08778020739555359, 0.04324205592274666, -0.05837785452604294, -0.007700914517045021, -0.0182621069252491, -0.038637857884168625, -0.007566165179014206, -0.050558093935251236, 0.056683462113142014, -0.030678225681185722, 0.02983745001256466, -0.03625703230500221, -0.01954931765794754, 0.03745470941066742, -0.04960784688591957, 0.06709560751914978, -0.09521200507879257, 0.0785093903541565, -0.06357356905937195, -9.304730593741422e-33, -0.06314225494861603, 0.017142318189144135, -0.03811652213335037, 0.07720763236284256, 0.001514580100774765, -0.043988827615976334, 0.05057777836918831, -0.06469573080539703, 0.11890013515949249, -0.01106838509440422, -0.10401396453380585, -0.010934374295175076, 0.0010932065779343247, -0.01535727921873331, 0.005168059840798378, 0.006500228773802519, -0.06691082566976547, -0.06035761535167694, 0.006510555278509855, 0.012656919658184052, -0.03887680917978287, 0.035783134400844574, -0.10056469589471817, -0.0005429785815067589, 0.001426173374056816, 0.04038562253117561, -0.07139389216899872, 0.025929179042577744, 0.038401130586862564, 0.022494658827781677, -0.018277471885085106, 0.011756058782339096, -0.020333170890808105, -0.0009236112819053233, 0.008206889033317566, 0.03885228931903839, 0.030266784131526947, -0.019951974973082542, -0.023022767156362534, -0.04698368161916733, 0.0833955779671669, -0.05107371509075165, -0.01695927046239376, -0.07199273258447647, -0.007194426376372576, 0.06462491303682327, -0.13597813248634338, -0.03086109645664692, -0.07772628962993622, 0.026437263935804367, 0.044730573892593384, 0.032128140330314636, 0.03392120078206062, -0.035788945853710175, -0.10253652930259705, -0.05012651905417442, 0.09789355099201202, 0.005711037199944258, -0.10051745176315308, 0.032733023166656494, 0.039040978997945786, -0.005275391507893801, 0.04590198025107384, 0.08094277232885361, 0.030811049044132233, -0.007192372344434261, 0.061226192861795425, 0.01978958584368229, 0.0008043257985264063, -0.095698781311512, 0.04199092462658882, -0.06779435276985168, -0.001631036982871592, -0.012408975511789322, -0.0006082375766709447, 0.10061396658420563, 0.03373751789331436, -0.11163698136806488, 0.015012201853096485, -0.029316188767552376, -0.0536341518163681, -0.005129883997142315, 0.06386100500822067, 0.00658916961401701, -0.06688432395458221, 0.05215029790997505, -0.03861262649297714, 0.021744955331087112, 0.0047492943704128265, -0.0035194840747863054, -0.0551203154027462, 0.012022873386740685, -0.05224684253334999, 0.0747271180152893, -0.004121873062103987, -6.043318023785105e-08, -0.01740773767232895, 0.01778258942067623, 0.060311492532491684, 0.04603242874145508, 0.048341747373342514, -0.06570689380168915, -0.04156853258609772, 0.09899147599935532, 0.024923285469412804, 0.040346261113882065, 0.03506575524806976, -0.0158486720174551, -0.05536636710166931, 0.06780371814966202, 0.056396253407001495, -0.029188906773924828, -0.02355518750846386, -0.027060216292738914, 0.025320861488580704, -0.018584294244647026, 0.044133786112070084, 0.016156943514943123, -0.046467944979667664, -0.04656406119465828, 0.01790737919509411, -0.07340393215417862, -0.05713382363319397, 0.07624547183513641, -0.02350698411464691, -0.019811702892184258, -0.01931050419807434, -0.024974308907985687, 0.07956121861934662, -0.04269000142812729, 0.004350581672042608, -0.0019537063781172037, -0.07125242799520493, -0.08107940107584, 0.028697853907942772, 0.040744341909885406, 0.020492544397711754, 0.028706775978207588, 0.015751108527183533, -0.06416390091180801, -0.03991879150271416, -0.0537036694586277, -0.06404173374176025, -0.11476107686758041, 0.05714781954884529, 0.010132323950529099, -0.03794587776064873, -0.009398299269378185, 0.04786589741706848, 0.05437178164720535, 0.08580715954303741, -0.009325644001364708, 0.06884779036045074, -0.02078445442020893, 0.08561151474714279, 0.11399656534194946, 0.029361197724938393, 0.010981186293065548, 0.012152682058513165, 0.00439932057633996]}