{"file_name": "botpenguin.com_solutions_custom-chatbot-development", "text": "URL: https://botpenguin.com/solutions/custom-chatbot-development\nCustom Chatbot Development | Customize AI Chatbot\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nContact Us\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGet the perfect AI Virtual Assistant with\nCustom Chatbot Development\nLeverage custom chatbot development to launch your AI chatbot tailored to your business. We provide high-end\nchatbot solutions that can be integrated with endless tools and be launched on any platform!\nContact Us\nGuided Growth, Made to Order.\nTrusted by\n40,000+\nGlobal Brands\nCustom Chatbot Development for your\nUnique Business Needs\nOur expert developers provide remarkable chatbot development services to\nensure they align with your business goals.\nGPT Powered Chatbot\nBoost your chatbot’s conversational power with natural language processing models to provide exceptional customer service.\nConcierge Chatbot\nPersonalize your customer service chatbot, which helps you with everything from appointment booking to solving customer queries.\nVoice Based Chatbot\nStay ahead of your competition by developing chatbots equipped with speech recognition and integrated with voice assistants.\nCRM/ERP Integrated Chatbot\nIntegrate with your database and CRM/ERP softwares to ensure all your critical data stays in one place.\nVirtual Assistant Chatbot\nCater to all client requirements, from page navigation to query solving, with a chatbot that feels like a personal assistant.\nStatistical Chatbot\nLeverage the analytical abilities of highly intelligent chatbot solutions to analyze data and give custom reports.\nMenu based Chatbot\nAutomate your business communications through custom chatbots designed to easily navigate conversations through option-based conversations.\nSocial Media Chatbot\nEnsure maximum engagement with your customers across all social media platforms with automated responses, quick replies, etc, through robust social media chatbot.\nContact Us\nGet every application of your choice integrated\nwith your Custom Chatbot\nOur custom chatbot development team ensures that every application you want on your platform is available to you.\nBe it appointment booking or CRM integration, we will get it all integrated into your custom chatbot.\nGoogle Suite\nEnrich your data collection and productivity with complete google suite integration.\nCustomer Relationship Management\nAutomate your sales process and client interactions by integrating your preferred CRM.\nEnterprise Resource Planning\nIntegrate your chosen ERP system to achieve real-time data synchronization and data efficiency.\nAccountancy System\nImprove financial processes by integrating financial systems and providing accurate reports.\nPayment Gateway\nEnhance your user experience by integrating your preferred payment gateway with your chatbot.\nBooking System\nEasily manage appointments and bookings through the chatbot by integrating with popular booking systems.\nCommunication Channels\nEnable integration with multiple communication channels for improved customer interaction.\nField Tracking System\nEnhance operational efficiency and productivity by monitoring real-time field activities.\nBitrix24\nOptimize project management and workflows swiftly integrated with your custom AI chatbot.\nOn-demand Custom Application\nPersonalize your custom AI chatbot with any application you desire from our wide network of integrations.\nContact Us\nGet your Custom Chatbot running across\nall popular platforms\nOur chatbots are designed to be compatible with all popular platforms to ensure that\nno matter where your audience is, your chatbot will reach them.\nWhatsApp Custom Chatbots\n2.7+ billion users\nWebsite Custom Chatbots\nYour Web Traffic\nFacebook Custom Chatbots\n2.9+ billion users\nInstagram Custom Chatbots\n2.4+ billion users\nTelegram Custom Chatbots\n900+ million users\nKik Custom Chatbots\n300+ million users\nSkype Custom Chatbots\n300+ million users\nSlack Custom Chatbots\n35+ million users\nTwilio Custom Chatbots\n350,000 + users\nWeChat Custom Chatbots\n1.3+ billion users\nWordpress Custom Chatbots\n472+ million users\nMS Teams Custom Chatbots\n320+ million users\nAll other platforms available on demand\nGet started on your Custom Chatbot\nDevelopment today\nContact Us\nProviding you with the best Chatbot Development Services\nthrough powerful Generative AI Solutions\nBotPenguin immerses into intensive research to understand the latest trends in the development of\nArtificial Intelligence to ensure we utilize it efficiently in development of your custom AI chatbot\nConversational AI\nBoost user engagement and improve client satisfaction with advanced AI conversational abilities.\nNatural Language Processing\nIntegrate NLP model with your chatbot to allow seamless interaction with your customers.\nIntent-Based Response\nResolve customer queries accurately by providing precise replies based on the customer intent.\nSentimental Analysis\nPersonalize your user experience with custom chatbots that understand customer emotions and interact accordingly.\nMultilingual Ability\nBypass the language barrier and converse with every customer in their preferred language.\nLogic-Based Chatbot\nAutomate tasks, deliver excellent support, and nurture potential customers with logically structured chat flows.\nImage Analysis Chatbot\nIncrease engagement and qualify more leads by enriching user experience through images in the chat.\nContact Us\nFit your specific industrial use case with our\nCustom Chatbot Development Services\nAs a custom chatbot development company, we have got you\ncovered for all your chatbot solution needs.\nLogistics\nStreamline operations with chatbot equipped with real-time tracking and inventory management.\nE-Commerce\nIncrease customer engagement with personalized AI chatbot assistant.\nHealthcare\nProvide reliable customer support with HIPAA-compliant healthcare chatbot.\nReal Estate\nImprove lead generation and sales with smooth property inquiring and booking systems.\nSAAS\nImprove user onboarding and technical support with an advanced, intuitive chatbot.\nFintech\nFacilitate enhanced user experience with financial reports and analytics through statistical chatbot.\nHR\nAutomate human resources tasks like onboarding, recruitment, and employee support.\nRetail\nOffer personalized recommendations based on customer’s interests and improve overall sales.\nFitness\nProvide personalized workout plans, fitness diets, and progress tracking with customer service chatbot.\nTravel\nBoost lead qualification with tailor made travel itineraries and plans for each client.\nEntertainment\nEnrich user experience and improve engagement with interactive content and latest updates.\nEducation\nEmpower users with courses and learning methods based on their personal learning graph and requirements.\nBook a free demo for your Custom Chatbot\nDevelopment today\nContact Us\nUtilizing the latest technological stack to meet\nall your Custom Chatbot demands\nBotPenguin is a custom chatbot development company that believes in staying ahead of the curve by\nproviding our clients top-notch services with their preferred open and licensed language model\nOpen AI\nEmpower your chatbot with powerful AI capabilities of OpenAi, ensuring smart and intelligent solutions.\nAmazon Lex\nBoost the conversation powers of your chatbot with Amazon Lex’s deep learning and NLP\nMicrosoft Bot Framework\nGet robust and versatile chatbot using Microsoft Bot Framework.\nIBM Watson\nMake advanced decisions using predictive analytics and cognitive abilities of IBM Watson.\nDialog FLow\nEnrich user experience by building engaging conversation flow with Google’s Dialog Flow.\nRasa NLU\nUnlock contextual and customizable customer interactions with Rasa NLU’s smooth natural language understanding.\nFast Text\nEnsure efficient language processing and classification with Facebook’s Fast Text.\nOracle Intelligent Bot\nCreate conversational experience for business applications through Oracle Bot.\nContact Us\nWhy choose Custom Chatbot\nDevelopment Services?\nCustom Chatbot development ensures you only pay for what you want. Our team of expert developers ensure we design your custom\nAI chatbot to meet the specific demands of your audience to ensure unparalleled business growth.\nIncreased Engagement\nConnect with your audience on a deeper level with AI chatbot trained to converse in your brand voice.\nDrive Conversions\nBuild trust and boost your conversion rate by providing precise and accurate answers 24/7 using NLP and machine learning.\nCompetitive Edge\nProvide exceptional customer experience to your audience and differentiate from the growing list of competitors.\nCost and Time Efficient\nCustom chatbots cut down personnel costs and let your employees work on high-output tasks, boosting efficiency across avenues.\nData Analytics\nUse advanced built-in data analytics tools to create dashboards and reports that help you analyze customer behavior for more informed decisions.\nContact Us\nWith years of experience in software development,we\nbring the best for your Custom Chatbot Development\nOur team of expert technicians ensure that they understand your requirements and provide you with\nresults that go beyond your expectations.\n1\n2\n3\n4\n5\n6\nProject Discovery & Planning\nProject discovery aims to identify all the functional and non-functional requirements along with initial timelines, product roadmap and risk management planning.\nProject Envisioning\nProject envisioning aims to give visual understanding to the custom chatbot using user journey flows and design prototypes.\nDevelopment Planning\nWe work and start building on the complete blueprint of the custom chatbot with the aim of defining the architecture, UX design and other important elements.\nDevelopment\nThe custom chatbot development team specializing in AI and NLP development develops the product with all your required functionalities.\nTesting\nWe run intensive testing to ensure that no bug or error can be found in the custom chatbot and it can run smoothly on our client’s platform.\nSupport and Maintenance\nOur chatbot development company stays in close contact with the client constantly enhancing and providing thorough support.\nKnow more\nWhy choose BotPenguin as your Custom Chatbot\nDevelopment Service provider?\nBotPenguin holds experience in handling global projects from mobile app development to chatbot\ndevelopment in every industry, bringing you the most trusted and reliable service in the industry\nPricing\nWe believe in mutual growth with our clients. Our custom chatbot development services come at the most reasonable price in the market.\nEnd-to-End Solution\nWe start from the idea of our client, create an actionable model for it, build custom chatbots from scratch and then provide constant support.\nCustomization\nWe find joy in our client’s complete satisfaction so with our custom chatbot development we aim to meet all our client needs from branding to integrations.\nGlobal Expertise\nWe have served leading businesses across 10+ industries spread across the globe adding on to our knowledge base.\nThorough Support\nWe believe in a client-led approach with our support team being extremely active and technologically equipped to support the clients.\nContact Us\nFrequently Asked Questions\nWhat is BotPenguin’s Custom Chatbot Development Services?\nBotPenguin’s Custom Chatbot Development Services create a customized chatbot to meet a business's unique needs and goals. Our custom chatbots can be integrated with various systems and tools to automate processes and improve customer experiences.\nWhat are the benefits of Custom Chatbot Development?\nBotPenguin’s Custom Chatbot Development can help drive sales, enhance customer service, boost brand presence, streamline inventory management, track employee skills, generate deep data insights, and provide enterprise-grade scalability and security.\nWhat types of chatbots can BotPenguin build through Custom Chatbot Development?\nWe can deliver various types of chatbots, including AI chatbots, logic-based chatbots, voice-enabled chatbots, IVR bots, image and document bots, and multilingual and accessibility options-enabled bots which can be integrated with multiple tools and launched across all platforms.\nDoes BotPenguin provide post-development support?\nYes, even after the project is delivered to the client and is made live on their choice of platform, we keep a tab on its performance. We ensure that the ai powered chatbot faces no bugs or errors in its performance and are available 24/7 in case our clients need any additional support from our team of expert developers.\nHow much does Custom Chatbot Development Service cost?\nThe exact cost of custom chatbot development depends on a number of factors which include - customizable features, API integrations, technology stack used, complexity, etc. To get an accurate estimate of your project’s cost, please feel free to contact us.\nHow long does it take to complete the custom chatbot development process?\nBotPenguin’s chatbot development service offers swift AI chatbot development and deployment to ensure you gain an edge over your competitors. Our developers are quick to create a chatbot but the exact timeline of the development service would depend upon the scope of the project.\nFor more FAQs and Guides\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nLaunch your custom AI chatbot today,\nbook a free consultation call\nContact Us\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10108891129493713, -0.06803698092699051, 0.03202810883522034, 0.010080431587994099, -0.01076369360089302, -0.056590452790260315, 0.03638145327568054, 0.06875721365213394, -0.0005029496969655156, 0.025578666478395462, 0.0389849990606308, -0.024567661806941032, -0.0030974491965025663, 0.03469923883676529, 0.11378946900367737, -0.004702843725681305, 0.11605653166770935, -0.10840252041816711, -0.07757203280925751, -0.024107396602630615, -0.013112062588334084, -0.016666674986481667, 0.05394919589161873, -0.0346689447760582, -0.029748789966106415, -0.0350932776927948, -0.04166657477617264, -0.0033546239137649536, -0.024081440642476082, -0.09021196514368057, -0.006023414433002472, 0.021227143704891205, 0.009099438786506653, 0.06349942088127136, -0.020555628463625908, -0.042950622737407684, -0.036163438111543655, 0.008902051486074924, 0.07960131019353867, -0.04645787924528122, -0.07811202108860016, -0.07190284132957458, -0.05731163173913956, -0.00834028422832489, 0.08040215075016022, -0.01143897045403719, -0.06841262429952621, 0.01578609272837639, 0.02179531194269657, 0.10578957200050354, -0.07724622637033463, -0.0378049872815609, 0.03741168603301048, 0.055910445749759674, -0.036685436964035034, 0.045511335134506226, -0.037945304065942764, 0.027097061276435852, 0.056298475712537766, -0.008739102631807327, -0.03319025784730911, -0.0027949465438723564, 0.0548473559319973, 0.02799174375832081, -0.03260087966918945, 0.02832973375916481, -0.10877260565757751, 0.0037572116125375032, -0.008242783136665821, -0.029231423512101173, -0.01022670790553093, 0.005609453190118074, -0.04379407688975334, 0.06806980818510056, 0.009784300811588764, -0.02762772887945175, 0.0153884906321764, -0.011747610755264759, 0.01147036999464035, -0.04980071634054184, -0.02895854227244854, 0.03460821136832237, 0.003428117372095585, 0.04394904524087906, -0.025325298309326172, -0.024197738617658615, -0.0005072619533166289, 0.04937002807855606, -0.022498972713947296, 0.0007791914977133274, 0.029224984347820282, -0.001566847786307335, 0.0295562706887722, 0.02570372074842453, 0.010860150679945946, 0.023991592228412628, -0.0584944412112236, 0.02294430136680603, -0.06330803036689758, -0.011498946696519852, 0.0006508968654088676, -0.050892360508441925, -0.06333735585212708, -0.08142600208520889, -0.0359845794737339, 0.014860951341688633, 0.06341396272182465, -0.023424969986081123, 0.13217583298683167, 0.015353617258369923, -0.12854336202144623, -0.08149810135364532, -0.00013463357754517347, -0.024739675223827362, 0.008157867938280106, 0.03127143904566765, -0.037938911467790604, 0.060179032385349274, 0.13635213673114777, 0.016757937148213387, 0.08303004503250122, 0.04378518834710121, 0.009877677075564861, -0.004725830629467964, 0.05152136832475662, 0.04019687697291374, -0.0031348697375506163, 1.074795847664287e-32, -0.02650332823395729, 0.01854846626520157, -0.06653892993927002, 0.0941365510225296, 0.03827503323554993, 0.025595273822546005, 0.021991001442074776, 0.06055840104818344, -0.06662402302026749, -0.04511705040931702, -0.10006586462259293, 0.08438379317522049, -0.08196093142032623, 0.038458894938230515, 0.025648580864071846, -0.08584287762641907, -0.014837779104709625, 0.022508859634399414, 0.0499434769153595, 0.005201699212193489, 0.06941215693950653, -0.03610483556985855, 0.056309279054403305, 0.1007443442940712, 0.13241660594940186, 0.039583709090948105, 0.08790064603090286, 0.01037117000669241, 0.043703511357307434, 0.029457252472639084, -0.083240807056427, 0.00023909940500743687, -0.04671850800514221, 0.024728499352931976, -0.04133540764451027, -0.04651252180337906, -0.047348786145448685, -0.09909272938966751, -0.07851579040288925, 0.04824073612689972, -0.1297953575849533, 0.002733859233558178, -0.10731063783168793, -0.06481125950813293, 0.030086683109402657, 0.0005865608109161258, 0.02757427468895912, 0.023311980068683624, 0.027503957971930504, 0.01902543008327484, -0.058349646627902985, 0.02827906608581543, 0.025708945468068123, 0.05523835867643356, -0.006047388073056936, -0.06032344698905945, 0.025166941806674004, -0.04141499474644661, -0.0007678989786654711, -0.036163754761219025, -0.014275495894253254, -0.0333859808743, 0.0011102415155619383, -0.027601974084973335, 0.04811237379908562, 0.022136250510811806, 0.044023558497428894, 0.021418992429971695, 0.02451975643634796, 0.03514833375811577, 0.04197264462709427, 0.04954037442803383, -1.6575559129705653e-05, 0.043928418308496475, -0.04285098612308502, 0.011263883672654629, -0.09337518364191055, 0.03114670142531395, -0.03693713620305061, -0.017395660281181335, -0.03268071264028549, -0.009139467030763626, -0.028096454218029976, -0.032149553298950195, 0.0689958930015564, -0.04526454210281372, 0.031368546187877655, -0.042373597621917725, -0.023953575640916824, 0.05500415340065956, -0.0530736930668354, 0.08563656359910965, -0.0689915269613266, 0.06727984547615051, -0.03667164221405983, -8.320652273639097e-33, -0.04156501218676567, 0.029231568798422813, -0.055529311299324036, 0.09457670152187347, 0.005380160175263882, -0.0254556592553854, 0.0410458967089653, -0.023981692269444466, 0.11020307242870331, -0.0030665267258882523, -0.10126873850822449, -0.016920074820518494, 0.011934351176023483, -0.0340750627219677, -0.02405591867864132, 0.0471322238445282, -0.05723392590880394, -0.048167627304792404, 0.02731669321656227, -0.0002803589159157127, -0.03879847377538681, 0.06319386512041092, -0.1034030169248581, 0.01197424903512001, -0.008930135518312454, 0.044318731874227524, -0.07091269642114639, 0.04703008383512497, 0.02750658057630062, 0.009098774753510952, -0.014617111533880234, -0.013833303935825825, -0.03767562657594681, -0.0019950708374381065, 0.036988697946071625, 0.06557869166135788, 0.026798639446496964, -0.016587065532803535, -0.007967422716319561, -0.05138480290770531, 0.11046580225229263, -0.05562685430049896, -0.03870639577507973, -0.06145019084215164, 0.000844237336423248, 0.027787556871771812, -0.1448216438293457, -0.04460601881146431, -0.06154932826757431, 0.031409431248903275, 0.046002622693777084, -0.016887590289115906, 0.04372727870941162, -0.04962904378771782, -0.08543723821640015, -0.031149892136454582, 0.10072462260723114, 0.026699939742684364, -0.0838308185338974, 0.018592292442917824, 0.04109015315771103, -0.003402429400011897, 0.08404368162155151, 0.06162252277135849, 0.028568027541041374, -0.009509197436273098, 0.06009767949581146, 0.04023870453238487, -0.0028575167525559664, -0.09070363640785217, 0.03600812330842018, -0.06941068917512894, -0.007913080044090748, 0.008403917774558067, 0.02425197884440422, 0.07833754271268845, 0.04996867477893829, -0.10428829491138458, 0.020428970456123352, -0.028948098421096802, -0.06371650844812393, 0.013664347119629383, 0.07096418738365173, 0.037598803639411926, -0.07259064167737961, 0.07433755695819855, -0.019687891006469727, 0.024594439193606377, -0.004557205364108086, 0.025107894092798233, -0.03570342808961868, 0.028307661414146423, -0.02142537385225296, 0.08236633241176605, 0.0014472075272351503, -5.735034136478134e-08, -0.026550238952040672, -0.010777533985674381, 0.04552658274769783, 0.04241512343287468, 0.0272415429353714, -0.05574330687522888, -0.032200686633586884, 0.08026126772165298, 0.030034029856324196, 0.017136970534920692, 0.019883206114172935, -0.030185390263795853, -0.052143801003694534, 0.07830794900655746, 0.07222996652126312, -0.025785354897379875, -0.04287746921181679, -0.008990182541310787, 0.013600654900074005, -0.04323035478591919, 0.059713780879974365, 0.02202315255999565, -0.02063777856528759, -0.02335892803966999, 0.016142675653100014, -0.05872899666428566, -0.061206236481666565, 0.07388043403625488, -0.05788272246718407, -0.014446806162595749, -0.02791050262749195, -0.026270795613527298, 0.0570971854031086, -0.03590373322367668, 0.027548963204026222, -0.01678398624062538, -0.09333585202693939, -0.07972065359354019, 0.016801245510578156, 0.05700106546282768, 0.03257513418793678, 0.010453741997480392, 0.0033824467100203037, -0.08024613559246063, -0.006481572519987822, -0.0585593655705452, -0.057842448353767395, -0.12952806055545807, 0.03837117180228233, -0.005173910409212112, -0.05959246680140495, 0.0004818004963453859, 0.06310712546110153, 0.03541349619626999, 0.0930296778678894, -0.0008924930589273572, 0.06590034812688828, -0.017104173079133034, 0.09958425164222717, 0.10360582917928696, 0.03667020425200462, 0.04017559438943863, 0.018953431397676468, 0.022771621122956276]}