{"file_name": "botpenguin.com_glossary_sms-marketing", "text": "URL: https://botpenguin.com/glossary/sms-marketing\nSMS Marketing: Significance, Process & Examples | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nSMS Marketing\nTable of Contents\nWhat is SMS Marketing?\nWhy use SMS Marketing?\nWho can benefit from SMS Marketing?\nWhere is SMS Marketing used?\nWhen to use SMS Marketing?\nHow to Implement SMS Marketing?\nBest Practices for using SMS Marketing\nChallenges with SMS Marketing\nExamples of Successful SMS Marketing\nTrends in SMS Marketing\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nWhat is SMS Marketing?\nSMS Marketing stands for Short Message Service Marketing. It's a strategy that uses permission-based text messaging to send promotional content.\nDefinition\nOften featuring coupons, promotional messages, and opt-in codes, SMS marketing employs a hotline of communication with customers on a platform that is readily available and heavily used by them – their mobile phones.\nComponents\nFundamental components of SMS marketing include the short code, keywords, message, and\ncall-to-action\n. The short code is the number the message gets sent to, the keyword a code customers text to the short code to adhere to a campaign, the message contains the actual content, and the call-to-action invites the customer to perform a specific task.\nPermission-based Method\nUnlike some other marketing methods, SMS marketing is permission-based. This means that customers must give you explicit permission to communicate with them through SMS, maintaining ethical marketing standards.\nRelevance in Today's World\nIn an increasingly mobile world, SMS marketing is extremely relevant. Rapid open rates and the direct interaction between the company and the consumer makes it a powerful tool in engaging with the audience.\nAdvantages\nThe advantages of SMS marketing include high open rates, cost-effective campaigns, immediate impact, and\npersonalized communication\n.\nWhy use SMS Marketing?\nBecause of its unique benefits, SMS marketing can significantly boost your business's impact while enhancing customer engagement and satisfaction.\nIncreases Engagement\nDue to the direct nature of SMS marketing, it increases\ncustomer engagement\nby encouraging immediate action.\nCost-effective\nText messages are relatively cheap to send, making SMS marketing cost-effective for businesses of all sizes.\nReach More Customers\nWith most adults owning a mobile phone, SMS marketing allows businesses to reach more people at the tip of their fingers than ever before.\nReal-time Communication\nThrough SMS marketing, businesses can instantly send crucial information and promotions, thus establishing a real-time\ncommunication channel\nwith the customers.\nEnhances Other Marketing Channels\nBulk SMS can enhance other advertising channels like email and\nsocial media\nby promoting their content and directing customers towards them.\nSupercharge Your Chatbot with Automation Today!\nGet Started FREE\nWho can benefit from SMS Marketing?\nFrom small businesses to large corporations, many sectors can derive significant benefits from strategic use of SMS marketing.\nSmall and Medium-Sized Businesses\nSMBs can use SMS marketing to build strong customer relationships, send timely reminders and offer exclusive promotions instantly without a lot of costs involved.\nLarge Corporations\nLarge organizations can benefit from the virtually limitless scalability of SMS marketing, using it to engage with thousands or even millions of customers promptly.\nRetail Industries\nFor retail businesses, promotional texts can drive customers towards sales, discounts, and in-store events, while transactional texts provide order updates or response to customer queries.\nHealthcare Providers\nMedical practitioners can use SMS marketing to communicate appointment reminders, health tips, medical alerts and more.\nNon-Profit Organizations\nFor non-profit organizations, text messages can make for an effective fundraising tool—galvanizing people towards fundraising events, donation requests, and other relevant activities.\nWhere is SMS Marketing used?\nGiven its flexibility and reach, SMS marketing is employed in a variety of challenging contexts and scenarios.\nPromotional campaigns\nBusinesses often use SMS marketing to promote exclusive offers, discounts, product launches or sales events.\nAlerts and Notifications\nIndustries such as banking, healthcare, travel, and hospitality often use SMS marketing to send automated alerts and notifications related to appointments, transactions, or changes in plans.\nSurveys and Feedback Collection\nMany businesses use SMS surveys as a quick and effective way of gathering\ncustomer feedback\nand conducting market research.\nCustomer Service\nSMS can be used as a direct, informal way to provide\ncustomer support\n, answer queries, or follow-up after a customer's interaction with a product or service.\nEvent Engagement\nText messages can drive interest and action associated with an event, providing reminders beforehand, engaging attendees during the event, and sending follow-up messages afterwards.\nWhen to use SMS Marketing?\nUnderstanding when to use SMS marketing can help businesses effectively engage customers. Timing plays a critical role in SMS campaign success.\nDuring Business Hours\nSMS marketing is generally best received during usual business hours. Sending messages too early in the morning or too late in the evening can be intrusive.\nDuring Sales or Special Events\nEvents such as sales, holidays, or special events can provide businesses an opportunity to significantly ramp up SMS marketing efforts to attract more customers and boost sales.\nTo Notify of Critical Information\nIf it is crucial for customers to receive certain information promptly, such as changes in their appointment or delivery, SMS marketing is the way to go.\nAfter Customer Interaction\nAfter a customer purchases a product or avails of a service, sending a follow-up message can heighten\ncustomer satisfaction\nand open the door to further engagement.\nRecurring Intervals\nPeriodic reminders, be it daily, weekly, monthly or any other recurring interval, can work effectively with SMS marketing for tasks such as bill reminders or health tips.\nHow to Implement SMS Marketing?\nImplementing SMS Marketing involves careful planning, following guidelines, crafting engaging content and deploying successful campaigns.\nObtain Explicit Consent\nBefore sending marketing messages, the first step is to obtain explicit consent from the customer. This can be achieved by including an opt-in in a form or asking them to send a keyword to a short code.\nChoose an SMS Marketing Service\nSelect a reliable SMS marketing service that fits your business requirements. Consider factors like cost, scalability, interface, features, reliability, and\ncustomer support\n.\nCraft Engaging Content\nCreate concise, relevant and engaging content for your text messages. Be clear about your offering and include a strong\ncall-to-action\n.\nTest Your Messages\nBefore launching the campaign, test your messages. Check for content errors, functioning links, and ensure that the message conveys what it’s meant to.\nEvaluate and Tweak Your Strategy\nUse data provided by your SMS marketing service to analyze campaign outcomes. Based on that, make necessary adjustments to improve future campaigns.\nBest Practices for using SMS Marketing\nTo ensure that SMS marketing is a boon and not a bane for your business, these are some best practices you should consider:\nMaintain Compliance with Laws and Regulations\nAlways rely on permission-based marketing to stay on the right side of ethics and the law. Get explicit consent to send SMS to customers by incorporating opt-in methods in your marketing strategy.\nIt’s also crucial to provide an easy opt-out mechanism to allow customers to stop receiving your text messages. Read up on rules and regulations like the Telephone Consumer Protection Act (TCPA) and adhere to these standards at all times.\nPersonalization\nPersonalizing SMS messages can make them more valuable and engaging for your audience. This could be as simple as addressing users by their first name or creating customized offers based on their behaviors or\npreferences\n.\nThe more targeted your message is, the better response rate you’re likely to have.\nConciseness is Key\nSMS means Short Message Service for a reason – keep your messages short and sweet. With only 160 characters to work with, you need to make every character count.\nBe clear, concise, and make sure your message is easy to comprehend.\nOffer Valuable Content\nIt is imperative that your messages offer value – whether it's an exclusive discount, useful information, or a relevant notification.\nThis helps keep your customers engaged, and makes them look forward to your texts.\nTiming Matters\nChoose the right time to send your messages. Sending promotional messages at inopportune times can annoy your customers.\nIt's generally recommended to send SMS during regular business hours. However, pay close attention to your own customer behavior to find the most effective time for your audience.\nChallenges with SMS Marketing\nDespite its advantages, SMS marketing doesn’t come without its potential pitfalls and challenges:\nCompliance Rules\nRules regarding SMS marketing can be stringent. Depending on the region, the rules may focus on how businesses gather opt-ins or what information must be included in the SMS message itself. Failing to follow these rules can lead to penalties, financial loss, and a reputation hit for the businesses.\nLimited Reach\nAs SMS marketing depends on customer opt-ins, marketers may initially face challenges in extending their reach in their target market, particularly compared to traditional channels like radio or TV advertising.\nDelivery Issues\nAn SMS message's successful delivery depends on various factors, including network availability, the recipient's mobile device's status (on/off), and the possibility of changed numbers. Undelivered messages may diminish the marketing campaign's effectiveness.\nMessage Relevance\nThe content in your SMS messages needs to be relevant to your audience. If you send generic or irrelevant messages, customers may ignore them, block them, or even opt out.\nFrequency\nStriking the right balance in the frequency of your SMS marketing messages is critical. Too many messages can cause irritation and opt-outs, while too few can result in lost engagement opportunities.\nExamples of Successful SMS Marketing\nHere are a few examples of powerful SMS marketing campaigns to inspire your strategy:\nDomino's Pizza UK\nDomino's Pizza in the UK developed a simple, effective campaign that allowed customers to order a pizza by texting a single word – 'feed me' – to a dedicated number. This unique strategy played on customer convenience and resulted in a significant increase in sales.\nRedbox\nRedbox, the DVD and video game rental company, uses SMS marketing to send promotional codes to subscribers. These promotional codes offer discounts on their services, thus driving usage and\ncustomer engagement\n.\nSilverstone\nIn order to drive attendance for their events, the race track Silverstone uses SMS marketing to notify customers of last-minute tickets. They use elements of scarcity and urgency to propel customers into buying tickets.\nDunkin Donuts\nIn one of their campaigns, Dunkin Donuts offered discount SMS coupons to Boston-area customers. They incorporated a sense of urgency by making these discounts applicable for a limited time. As a result, they reported a significant increase in store traffic and redemption of the offer.\nIKEA\nIKEA uses SMS mainly for\ncustomer service\npurposes. They send appointment reminders, delivery updates, and even assembly instructions via text. IKEA's SMS marketing strategy helps enhance\ncustomer experience\nand streamline operations.\nTrends in SMS Marketing\nThe rapidly evolving digital space suggests several key trends as we look towards the future of SMS marketing.\nRise of RCS\nRich Communication Services (RCS) takes text messaging to the next level by adding a rich media component. This can lead to a more dynamic and interactive SMS marketing experience.\nIntegration with Other Marketing Channels\nCompanies are increasingly integrating SMS marketing with other channels, leveraging its strength to improve the performance of the overall marketing strategy.\nUse of AI\nWith advances in\nAI\nand\nmachine learning\n, more personalization and automation in SMS marketing can be expected.\n5G and SMS Marketing\nThe advent of 5G will make SMS marketing faster and more reliable than ever before.\nEnhanced Analytics\nIncreased focus on detailed metrics will help businesses get more insights into customer behavior for an effective SMS marketing strategy.\nConnect, Communicate, Convert\nTry BotPenguin\nFrequently Asked Questions (FAQs)\nWhat makes sms marketing effective?\nSMS marketing boasts high open and engagement rates, reaching customers directly on their phones. This immediacy and intimacy make it an effective marketing channel.\nIs there a best time to send marketing texts?\nYes, typically, well-timed SMS campaigns - such as mid-afternoon during weekdays - see higher engagements, but optimal times can vary based on your audience.\nHow can personalization be applied in sms marketing?\nPersonalization involves tailoring messages based on customer data. This could include using a customer's name, reference to past purchases, or personalized offers.\nWhat is the role of opt-ins in sms marketing?\nOpt-Ins are essential for compliance with marketing regulations. They give customers the choice to receive communications, helping build trust and loyalty.\nAre there specific regulations for sms marketing?\nYes, regulations like TCPA (US), PECR (UK), and SPAM Act (AU) govern SMS marketing to prevent unsolicited messaging and ensure consumer privacy.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat is SMS Marketing?\nWhy use SMS Marketing?\nWho can benefit from SMS Marketing?\nWhere is SMS Marketing used?\nWhen to use SMS Marketing?\nHow to Implement SMS Marketing?\nBest Practices for using SMS Marketing\nChallenges with SMS Marketing\nExamples of Successful SMS Marketing\nTrends in SMS Marketing\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09767559915781021, -0.07403665035963058, 0.032470475882291794, -0.0019175823545083404, -0.0008730633417144418, -0.027948619797825813, 0.053497493267059326, 0.08581129461526871, 0.013855703175067902, 0.003314726985991001, 0.07848873734474182, -0.016532931476831436, 0.04528140649199486, 0.01151245180517435, 0.15016506612300873, -0.015589100308716297, 0.10674136132001877, -0.11781246215105057, -0.09233201295137405, -0.009664051234722137, 0.0006447186460718513, 0.010119243524968624, 0.05118483677506447, -0.006271891295909882, -0.022708481177687645, -0.04911220073699951, -0.027934309095144272, -0.004029006231576204, -0.012754686176776886, -0.056911010295152664, 0.005521624349057674, 0.05177900940179825, 0.02122252807021141, 0.06970686465501785, -0.020124102011322975, -0.02851015329360962, -0.053929056972265244, 0.017552921548485756, 0.0756324827671051, -0.03596688434481621, -0.07700468599796295, -0.08640754222869873, -0.05344168096780777, -0.005322733428329229, 0.09723514318466187, -0.01794985681772232, -0.04503760114312172, 0.04499422013759613, -0.006359477061778307, 0.09385765343904495, -0.06739994883537292, -0.025430141016840935, 0.02986964024603367, 0.05638021603226662, -0.049176380038261414, 0.03393971547484398, -0.043291039764881134, 0.017066605389118195, 0.06300800293684006, 0.0101781552657485, -0.04506320878863335, 0.003960337955504656, 0.031129099428653717, 0.03450112044811249, -0.04421256482601166, 0.03770219534635544, -0.14512969553470612, 0.012687787413597107, 0.013044709339737892, -0.02276787906885147, 0.0032720747403800488, -0.0401797816157341, -0.06341099739074707, 0.073024220764637, -0.014188895933330059, -0.016021884977817535, 0.019276512786746025, -0.004053042270243168, -0.019075699150562286, -0.035428959876298904, -0.03821619972586632, 0.0371554009616375, 0.009112478233873844, 0.04279916733503342, -0.03776894137263298, -0.02895553782582283, -0.003839148674160242, 0.049929630011320114, -0.05233890563249588, 0.0011639472795650363, 0.03768603503704071, 0.01616569235920906, -0.017945671454072, 0.042173121124506, -0.0006464346661232412, 0.02356274053454399, -0.09165171533823013, 0.009765762835741043, -0.0433146134018898, -0.007561019156128168, 0.005221310071647167, -0.015213276259601116, -0.0601591020822525, -0.06530123203992844, -0.06378921121358871, -0.006221295800060034, 0.07341749966144562, -0.035055335611104965, 0.131613090634346, 0.01738823764026165, -0.1209772452712059, -0.062241557985544205, -0.002162631368264556, -0.026457685977220535, -0.005965708289295435, 0.012534081935882568, -0.029868563637137413, 0.06655121594667435, 0.14496061205863953, 0.05103922635316849, 0.04377058520913124, 0.0554896704852581, -0.0017176324035972357, -0.019338345155119896, 0.04496753215789795, 0.033150654286146164, -0.006681749597191811, 1.0973286050016118e-32, -0.08128766715526581, 0.03861883655190468, -0.037305258214473724, 0.11379051208496094, 0.028280047699809074, 0.01719234697520733, 0.014850428327918053, 0.012876409105956554, -0.03935099020600319, -0.033889465034008026, -0.08772481232881546, 0.09201831370592117, -0.07892582565546036, 0.05352729558944702, 0.012515190988779068, -0.07536929100751877, -0.009324625134468079, 0.005274789873510599, 0.06756704300642014, -0.011090890504419804, 0.06648118048906326, -0.01368773728609085, 0.06636625528335571, 0.05082252621650696, 0.11533049494028091, 0.03683430328965187, 0.07996716350317001, 0.01023252122104168, 0.07008329778909683, 0.030766163021326065, -0.08364158123731613, -0.0021242236252874136, -0.02237667702138424, 0.03142647445201874, -0.06441710144281387, -0.03609896078705788, -0.04043947905302048, -0.1254565715789795, -0.06699707359075546, 0.024327291175723076, -0.14968615770339966, 0.021907133981585503, -0.1169036477804184, -0.05632181093096733, 0.006798045709729195, 0.021283000707626343, -0.002392504131421447, 0.0036823495756834745, 0.05172264575958252, 0.021546458825469017, -0.028062473982572556, 0.008567364886403084, 0.040163472294807434, 0.05113167315721512, -0.002165977144613862, -0.029933353886008263, 0.025519680231809616, -0.05314135551452637, -0.029063565656542778, -0.039620500057935715, -0.011435805819928646, -0.0506281852722168, 0.004219676833599806, -0.027530105784535408, 0.07312699407339096, 0.006370016373693943, 0.040391843765974045, -0.017225349321961403, 0.013633000664412975, 0.02188735641539097, 0.03414361923933029, 0.06102825328707695, -0.020936401560902596, 0.042964085936546326, -0.054194375872612, 0.019440706819295883, -0.08955827355384827, 0.056389253586530685, -0.021319137886166573, 0.028768502175807953, -0.019192280247807503, -0.03347422927618027, -0.0002174638502765447, -0.034863729029893875, 0.08389277011156082, -0.021731259301304817, 0.01384331937879324, -0.07961750775575638, -0.011715183965861797, 0.06485370546579361, -0.058438632637262344, 0.10143937915563583, -0.07857704162597656, 0.08865451067686081, -0.03798645734786987, -9.190091241861447e-33, -0.06867064535617828, 0.039082061499357224, -0.054562024772167206, 0.07431111484766006, 0.0033008833415806293, -0.01654311642050743, 0.00900434609502554, -0.03568273037672043, 0.08141996711492538, -0.006168168969452381, -0.11233077198266983, -0.018858984112739563, 0.021770261228084564, -0.05417899414896965, -0.012641179375350475, 0.02506997250020504, -0.013479368761181831, -0.009445794858038425, 0.005005796439945698, 0.02048666961491108, -0.021385222673416138, 0.060572102665901184, -0.12241506576538086, 0.010488077998161316, -5.331431748345494e-05, 0.036725886166095734, -0.07231317460536957, 0.07222916930913925, 0.02915932796895504, -0.004108681809157133, -0.012845237739384174, -0.003977494314312935, 0.0026343276258558035, -0.014599193818867207, 0.011898786760866642, 0.04008861258625984, 0.02539895847439766, 0.006568090990185738, 0.018493471667170525, -0.021884551271796227, 0.11686871200799942, -0.04702232778072357, -0.023345952853560448, -0.09403376281261444, -0.013464747928082943, 0.019389647990465164, -0.10560262948274612, -0.07116944342851639, -0.04319537431001663, 0.031162463128566742, 0.059963636100292206, -0.010959526523947716, 0.038248028606176376, -0.026010559871792793, -0.08715540915727615, -0.045679572969675064, 0.1000824123620987, 0.006409817840903997, -0.08561070263385773, -0.0068112765438854694, 0.043339528143405914, 0.0036264576483517885, 0.08001355826854706, 0.01830291748046875, 0.036335304379463196, -0.002285189460963011, 0.06632285565137863, 0.013274233788251877, -0.016733698546886444, -0.09473435580730438, 0.047872480005025864, -0.07950790971517563, -0.029389480128884315, 0.015144208446145058, 0.009343421086668968, 0.0785030722618103, 0.01100105419754982, -0.10714298486709595, -0.024877896532416344, -0.05752113461494446, -0.030849995091557503, 0.02920033410191536, 0.03108477033674717, 0.0268092043697834, -0.07090897858142853, 0.051642850041389465, -0.021997198462486267, 0.011655393987894058, -0.019250374287366867, 0.00944715179502964, -0.047172196209430695, 0.01887103170156479, -0.008207007311284542, 0.11261069774627686, -0.010388272814452648, -6.014289510858362e-08, -0.03227828070521355, -0.04158429428935051, 0.048502612859010696, 0.011733300052583218, 0.021598264575004578, -0.05098113790154457, -0.044795066118240356, 0.06083749234676361, 0.05664519593119621, 0.017812276259064674, 0.014373233541846275, -0.026038838550448418, -0.06820790469646454, 0.0748126357793808, 0.04884765297174454, -0.016709337010979652, -0.023557567968964577, -0.02839810401201248, 0.025534737855196, -0.02603793703019619, 0.0550631545484066, 0.043840955942869186, -0.029075028374791145, -0.02089412696659565, 0.02461341954767704, -0.051915571093559265, -0.04104577749967575, 0.0885927602648735, -0.026536274701356888, -0.04605439305305481, -0.025043120607733727, -0.04167114198207855, 0.06396783888339996, -0.04967918246984482, -0.03827081248164177, 0.0004563762340694666, -0.04521654173731804, -0.10685179382562637, 0.018606364727020264, 0.038179054856300354, 0.02813342958688736, 0.02823876403272152, 0.007338971830904484, -0.07993286103010178, -0.016949553042650223, -0.04631541296839714, -0.056548502296209335, -0.10138425976037979, 0.037092503160238266, 0.020606767386198044, -0.06946840137243271, 0.01983584091067314, 0.04932922124862671, 0.017798777669668198, 0.05135846510529518, -0.02686285600066185, 0.06511610746383667, 0.01455939281731844, 0.09520341455936432, 0.0810503289103508, 0.042493004351854324, 0.015822021290659904, 0.02987903356552124, 0.014213993214070797]}