{"file_name": "botpenguin.com_blogs_create-live-chat-widget-live-chat-software-guide-2023", "text": "URL: https://botpenguin.com/blogs/create-live-chat-widget-live-chat-software-guide-2023\nCreate Live Chat Widget: Live Chat Software Guide [2023]\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nCreate Live Chat Widget: Live Chat Software Guide [2023]\nLive Chat\nUpdated at Aug 5, 2024\n10 min to read\nBotPenguin\nContent Writer, BotPenguin\nTry BotPenguin\nTable of Contents\nIntroduction\nWhat is a live chat widget?\nDifferent types of live chat widgets\nHow does a live chat widget work?\nChoosing the Right Live Chat Software\nTips for selecting the best live chat software for your business\nConclusion\nFrequently Asked Questions\nShare\nLink copied\nIntroduction\nDo you want to avoid losing potential customers on your website because they need help finding the information they need? Have you considered implementing a live chat widget to improve customer support and business growth? If you still need to, you're taking advantage of a valuable opportunity to engage with your audience in real-time.\nFor a good reason, live chat software has become an increasingly popular way to interact between businesses and customers. According to a study by Comm100, customers who engage with a business through live chat are three times more likely to purchase. Additionally, 82% of customers report being satisfied with their live chat experience, making it a valuable tool for improving customer satisfaction and loyalty.\nBut what exactly is a live chat widget? Simply put, it is a feature on your website that allows visitors to initiate a conversation with your support team in real-time. It's like having a personal assistant available to respond to questions and provide assistance around the clock. And the benefits continue beyond there.\nA live chat widget can improve website conversion rates, reduce response times, and provide valuable insights into customer behavior and preferences.\nIn this article, we'll walk you through establishing a live chat widget for your website.\nWe'll go through everything you need to know about creating a successful live chat widget, from selecting the correct live chat software to developing an aesthetically beautiful and user-friendly gadget.\nSo, let's get this party started!\nWhat is a live chat widget?\nA live chat widget is a feature or component added to a website to enable real-time communication between website visitors and a business's support team or customer service representatives. It usually appears as a small chat box or window that visitors can interact with to ask questions, seek assistance, or engage in conversations with the support team.\nThe\nlive chat widget\nallows visitors to initiate a chat session by clicking on the widget, which opens up a chat interface. Visitors can type messages through this interface, and the support team can respond quickly. The widget often includes features such as chat history, file-sharing capabilities, and sometimes even automated chatbots to assist with common queries.\nConnect, Engage, Convert\nGet Started FREE\nDifferent types of live chat widgets\nSeveral types of live chat widgets are available, including\nEmbedded widgets\n: These widgets are integrated into the layout of your website and are constantly visible on one or multiple pages. They typically appear as a chat box or icon in a fixed position, such as in the corner of the screen or along the side. Embedded widgets allow visitors to initiate a chat at any time while browsing your website, as the chat interface is readily available.\nPop-up widgets\n: Pop-up widgets, as the name suggests, appear as a pop-up window when a visitor clicks on a specific button, icon, or link on your website. This button or icon often indicates that live chat support is available. Pop-up widgets grab the visitor's attention by displaying the chat interface in a separate window, focusing their attention on the conversation.\nSlide-in widgets\n: Slide-in widgets are designed to slide into view from the bottom or side of the screen as a visitor scrolls or navigates through your website. These widgets are typically less intrusive than pop-up windows but still capture visitors' attention. Slide-in widgets allow visitors to initiate a chat by clicking on the widget as it becomes visible.\nEach type of live chat widget has advantages and can be chosen based on your website's design, user experience preferences, and the level of visibility or attention you want to give to the chat functionality. Ultimately, the goal is to provide an easily accessible and engaging chat experience for your website visitors.\nHow does a live chat widget work?\nWhen visitors initiate a chat, they are connected to a member of your support team who can answer their questions and provide assistance. Live chat widgets often come with features such as chat history, canned responses, and chat routing, allowing you to manage multiple chats simultaneously and provide fast and efficient support.\nA customized live chat widget can help you stand out from the competition and create a unique brand experience for your visitors. A customized widget lets you choose colors, fonts, and styles matching your brand's personality and values, making it more visually appealing and recognizable. Additionally, a customized widget can help you better target your audience and provide a more personalized experience for each visitor.\nChoosing the Right Live Chat Software\nBefore choosing the right\nlive chat software\n, there are some key factors that you should consider before making a decision.\nFactors to consider when choosing live chat software\nSome essential factors to consider when choosing live chat software include pricing, ease of use, scalability, integrations, and reporting and analytics capabilities. Additionally, you'll want to consider the size of your team, the level of support you need, and any specific features you require.\nTop live chat software in the market\nSome of the top live chat software options in the market include\nBotpenguin\n, Zendesk Chat, LiveChat, Olark, Intercom, and Drift. Each software option offers unique features and benefits, making them suitable for different businesses and industries.\nComparison of live chat software based on features and pricing\nWhen comparing live chat software, it's important to consider the features and pricing offered by each software option. For example, some software options provide advanced reporting and analytics features, while others focus more on ease of use and customization options. Similarly, pricing can vary significantly, with some software options offering a free plan or low-cost options, while others may require a significant investment.\nTips for selecting the best live chat software for your business\nWhen deciding on your company's finest live chat software, keep your demands and expectations in mind. Some tips to keep in mind include.\nConducting research and comparing different options, asking for recommendations from other business owners, and\nconsidering a free trial\nto test the software before making a final decision.\nBuilding a live chat widget for your website is an excellent way to provide visitors with real-time support and improve customer satisfaction.\nHowever, designing a visually appealing and user-friendly widget that meets your business's specific needs can be challenging. In this section, we'll guide you through creating a live chat widget for your website from start to finish.\nA step-by-step guide to creating a live chat widget\nChoose your live chat software: First, select the live chat software that best fits your business needs and budget.\nCreate your account: Sign up for your account with your chosen live chat software and set up your account information.\nCustomize your widget: Choose the colors, fonts, and styles that match your brand's personality and values.\nAdd your widget to your website: Install the live chat widget code onto your website.\nUsing live chat software to create a customized widget\nMost live chat software solutions provide built-in customization features that allow you to select colors, fonts, and styles that reflect your brand's personality and values. Some live chat software options offer advanced customization options, such as adding your logo or customizing the widget's shape and size.\nTips for designing a visually appealing and user-friendly live chat widget\nWhen designing a live chat widget, keep in mind that simplicity is key.\nYour widget should be easy to navigate and understand, with clear instructions and a user-friendly interface.\nAdditionally, ensure your widget is visually appealing, with colors and designs matching your brand's personality and values.\nTesting and optimizing your live chat widget\nOnce your live chat widget is installed on your website, testing and optimizing it for maximum efficiency is essential.\nTest your widget's functionality by chatting with your team and ensuring everything works as it should.\nOptimize your widget's performance by tracking and analyzing metrics such as response time, chat duration, and customer satisfaction.\nBest practices for using live chat widget to improve customer experience\nTo provide the best customer experience through your live chat widget, consider the following best practices:\nRespond quickly and efficiently to customer inquiries\nUse canned responses to streamline your support team's workflow\nPersonalize your responses to create a more human connection\nOffer proactive support by anticipating customer needs\nTips for training your live chat support team\nTo ensure your support team is equipped to provide excellent customer support through your live chat widget, consider the following tips:\nProvide comprehensive training on how to use the live chat software and widget\nSet clear expectations and guidelines for response times and customer interactions\nEncourage your team to personalize their responses and create a human connection with customers\nMeasuring the success of your live chat widget\nTrack data like response time, chat duration, customer happiness, and the number of chats launched to determine the performance of your live chat widget. Use this data to discover areas for improved make the required modifications to enhance the performance of your live chat widget.\nConclusion\nImplementing a live chat widget using the right software and designing it to meet your business's specific needs can greatly improve customer support and satisfaction. By providing real-time assistance and personalized interactions, businesses can enhance their website's conversion rates and gain valuable insights into customer behavior.\nEmbracing a live chat widget is a valuable opportunity to engage with your audience in real-time and foster business growth.\nAt\nBotPenguin\n, we provide a chatbot-building platform that makes it simple to construct and deploy a customized chatbot for your company. Our platform offers a wide range of functionality such as live chat widgets and customization possibilities, making creating a chatbot that suits your company's requirements simple.\nSo, what are you holding out for? Consider installing a personalized chatbot for your company in 2023 to reap the rewards. The procedure is simple, fast, and cost-effective when using the correct chatbot-building platform, such as BotPenguin. Begin boosting your client experience and propelling your company forward with a personalized chatbot now.\nConnect, Engage, Convert\nGet Started FREE\nFrequently Asked Questions\nWhat is a live chat widget and why is it important for my website?\nA live chat widget is a tool that allows real-time communication between website visitors and businesses. It's important because it enhances customer support, improves user experience, increases sales, and provides instant assistance.\nHow can I create a live chat widget for my website?\nTo create a live chat widget, you can use live chat software that offers customization options. Sign up for the software, customize the widget's appearance and settings, generate the widget code, and embed it on your website.\nCan I integrate the live chat widget with my existing customer support systems\n?\nYes, most live chat software allows integration with popular customer support systems like helpdesk software, CRM systems, and ticketing systems. This ensures seamless communication and a centralized view of customer interactions.\nCan I customize the chat widget's appearance to match my website's branding?\nYes, live chat software typically offers customization options to match your website's branding. You can customize colors, fonts, and widget placement, and even add your company logo to create a cohesive and branded user experience.\nWhat features should I look for in live chat software for my widget?\nWhen choosing live chat software, consider features like chat routing, canned responses, chat transcripts, visitor tracking, and integration capabilities. These features enhance the functionality and effectiveness of your live chat widget.\nCan I monitor and analyze the performance of my live chat widget?\nYes, most live chat software provides analytics and reporting features. You can track metrics like chat volume, response times, customer satisfaction ratings, and conversion rates. This helps you measure the effectiveness of your live chat widget.\nIs it possible to have multiple chat agents handling chats through the widget?\nYes, live chat software allows multiple chat agents to handle chats simultaneously. This enables efficient customer support and ensures that all incoming chat inquiries are attended to in a timely manner.\nCan I automate certain responses or actions with my live chat widget?\nYes, live chat software often includes automation features like chatbots or canned responses. These can be used to provide instant answers to common questions or gather initial information from visitors before transferring them to a human agent.\nIs it easy for visitors to initiate a chat through the live chat widget?\nYes, live chat widgets are designed to be user-friendly. They usually have a visible chat button or chat icon that visitors can click to initiate a conversation with a chat agent, ensuring easy access to support or information.\nHow can I maximize the benefits of using a live chat widget on my website?\nTo maximize the benefits, ensure you have trained and dedicated chat agents, offer proactive chat invitations, provide personalized responses, and continually monitor and improve the performance of your live chat widget through analytics and customer feedback.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\nIncrease Customer Engagement with Live Chat Software\nUpdated at Aug 10, 2024\n8 min to read\nBotPenguin\nContent Writer, BotPenguin\nHow Live Chat Platforms Can Boost Sales Conversion Rates\nUpdated at Aug 10, 2024\n4 min to read\nBotPenguin\nContent Writer, BotPenguin\nWhat are Chat Transcripts on Live Chat?\nUpdated at Aug 10, 2024\n10 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nIntroduction\nWhat is a live chat widget?\nDifferent types of live chat widgets\nHow does a live chat widget work?\nChoosing the Right Live Chat Software\nTips for selecting the best live chat software for your business\nConclusion\nFrequently Asked Questions\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10792373865842819, -0.053109053522348404, -0.0016952560981735587, 0.0046230703592300415, 0.03258129581809044, -0.03297174349427223, 0.031458642333745956, 0.04765305668115616, -0.034317076206207275, 0.0222390778362751, 0.029525360092520714, -0.018387040123343468, 0.015240347012877464, 0.014478900469839573, 0.11091351509094238, -0.009018459357321262, 0.10569332540035248, -0.10903945565223694, -0.08360455185174942, -0.03372596949338913, -0.014159245416522026, -0.011551444418728352, 0.040908608585596085, -0.030716178938746452, -0.013789846561849117, -0.05544864758849144, -0.016133390367031097, -0.007076275534927845, -0.009508877992630005, -0.038608673959970474, 0.01127295009791851, 0.03290877863764763, 0.006935348734259605, 0.050039712339639664, -0.034025173634290695, -0.0233737975358963, -0.027597054839134216, -0.00655569089576602, 0.08084575831890106, -0.04173142462968826, -0.0889400914311409, -0.08329373598098755, -0.0517054982483387, -0.0027359738014638424, 0.08266783505678177, -0.029307935386896133, -0.06825505942106247, 0.0027168174274265766, 0.02833513915538788, 0.08621753752231598, -0.11604184657335281, -0.0399482324719429, 0.0562962181866169, 0.047760866582393646, -0.024853985756635666, 0.055848561227321625, -0.015283584594726562, 0.031094098463654518, 0.05949666351079941, -0.002176650334149599, -0.022514663636684418, -0.03518831729888916, 0.07676444947719574, 0.03708915784955025, -0.023081336170434952, 0.017320092767477036, -0.11716179549694061, 0.02374183014035225, 0.020526690408587456, -0.033624809235334396, -0.025334103032946587, -0.015404664911329746, -0.06718917191028595, 0.04212955757975578, 0.020275751128792763, -0.030227333307266235, 0.005770096555352211, -0.007489075884222984, 0.03336087614297867, -0.04874490574002266, -0.03486552834510803, 0.02666526846587658, -0.01864207535982132, 0.05327068641781807, -0.03421386703848839, -0.03610998019576073, 0.0076474216766655445, 0.03829299286007881, -0.0169150959700346, 0.022563152015209198, 0.03189367800951004, 0.016947446390986443, -0.0022061141207814217, 0.02093670889735222, 0.0006955209537409246, 0.0004918784834444523, -0.07288409769535065, -0.0020199345890432596, -0.05606427416205406, -0.014332919381558895, -0.007574821822345257, -0.03470459580421448, -0.0449589267373085, -0.05919767543673515, -0.04701518639922142, -0.012942883186042309, 0.06823478639125824, 0.012882532551884651, 0.1227455586194992, 0.04006629437208176, -0.1157645508646965, -0.0555945560336113, 0.014320981688797474, -0.031990520656108856, 0.009162976406514645, 0.025859152898192406, -0.038667336106300354, 0.053095296025276184, 0.12847106158733368, 0.02180328033864498, 0.08840995281934738, 0.058544836938381195, 0.012560737319290638, -0.03171152621507645, 0.08209211379289627, 0.04011579975485802, -0.018350394442677498, 1.0749809880245415e-32, -0.02950076386332512, 0.03548302873969078, -0.03772079572081566, 0.10417219251394272, 0.024839600548148155, 0.004933877848088741, 0.022943716496229172, 0.049734897911548615, -0.05820873752236366, -0.03364143893122673, -0.08142022043466568, 0.11359614133834839, -0.07291985303163528, 0.04827214404940605, 0.03316935896873474, -0.11458813399076462, -0.03366805985569954, 0.010911185294389725, 0.06109265983104706, -0.0031070231925696135, 0.0715276300907135, -0.05285143852233887, 0.05182265490293503, 0.08686603605747223, 0.10951896756887436, 0.05189802497625351, 0.09652934968471527, 0.0034255993086844683, 0.04179973155260086, 0.0432891808450222, -0.08522272855043411, 0.0005767286056652665, -0.04643486067652702, 0.02351379580795765, -0.047662124037742615, -0.052266690880060196, -0.07664454728364944, -0.10420849174261093, -0.0554727241396904, 0.07027225196361542, -0.11906708031892776, -0.017932461574673653, -0.09219984710216522, -0.09163939952850342, 0.011893754824995995, 0.006956907454878092, 0.028498616069555283, 0.022999372333288193, 0.06154116243124008, 0.0220540352165699, -0.04413282126188278, 0.006084531079977751, 0.03404761478304863, 0.05154862627387047, -0.025843236595392227, -0.033406950533390045, 0.004056480713188648, -0.06265627592802048, 0.007342725992202759, -0.03697076067328453, -0.046840887516736984, -0.03058032877743244, -0.011755450628697872, -0.010997082106769085, 0.03327793627977371, 0.01664149761199951, 0.04632768779993057, 0.008892927318811417, 0.020212333649396896, 0.028299745172262192, 0.05582470819354057, 0.03720021992921829, -0.007860521785914898, 0.020960591733455658, -0.04611329734325409, 0.026094889268279076, -0.0896080732345581, 0.025990944355726242, -0.06407240033149719, 0.013567415066063404, -0.03843400254845619, -0.016595404595136642, -0.018839115276932716, -0.033947598189115524, 0.0866120308637619, -0.03746151179075241, 0.023027708753943443, -0.03080248460173607, -0.025750713422894478, 0.03311796858906746, -0.036651093512773514, 0.06148654595017433, -0.05238272622227669, 0.0691298320889473, -0.05106551945209503, -8.202335828492956e-33, -0.06120552495121956, 0.0193912535905838, -0.04545264318585396, 0.0657358393073082, 0.01409817859530449, -0.02500045858323574, 0.02577066607773304, -0.03022281639277935, 0.10367340594530106, -0.007284632883965969, -0.08442559838294983, -0.013039437122642994, -0.025835325941443443, -0.02552350051701069, -0.007043208461254835, 0.01991494745016098, -0.057252876460552216, -0.045652054250240326, 0.01067618653178215, 0.004230859223753214, -0.02553085796535015, 0.05251498147845268, -0.13773995637893677, 0.006610737182199955, -0.014996791258454323, 0.050601761788129807, -0.06897030770778656, 0.07926305383443832, 0.037689775228500366, 0.022595912218093872, -0.0014746903907507658, 0.010702966712415218, -0.04677643999457359, 0.022829808294773102, 0.04247688502073288, 0.04474616050720215, 0.029473671689629555, -0.028810318559408188, -0.005417673848569393, -0.0575750395655632, 0.10608107596635818, -0.061484385281801224, -0.06745599955320358, -0.0628848671913147, 0.001009449944831431, 0.041326429694890976, -0.11403924226760864, -0.04208415001630783, -0.06423917412757874, 0.050877224653959274, 0.06787192821502686, 0.037202175706624985, 0.05150472745299339, -0.054944831877946854, -0.09668880701065063, -0.04580812156200409, 0.10426926612854004, 0.03182901442050934, -0.06576181203126907, 0.03269873186945915, 0.04961078613996506, 0.023987051099538803, 0.06410975009202957, 0.06760650128126144, 0.026004215702414513, 0.00321874488145113, 0.08658985793590546, 0.06101595610380173, -0.010496582835912704, -0.10064388811588287, 0.0628143697977066, -0.0326492041349411, -0.0182975921779871, 0.00038878011400811374, 0.0015717912465333939, 0.0945519432425499, 0.03660210967063904, -0.08502603322267532, 0.002016467973589897, -0.01966395229101181, -0.0352681539952755, -0.000642884464468807, 0.06878642737865448, 0.03782189264893532, -0.07205430418252945, 0.03347790986299515, -0.055779315531253815, 0.020993975922465324, 0.0068739354610443115, 0.013463540002703667, -0.08676378428936005, 0.020635409280657768, -0.034811731427907944, 0.10112869739532471, 0.014063403941690922, -5.950662185227884e-08, -0.041397351771593094, -0.008818482980132103, 0.06364180147647858, 0.053512606769800186, 0.03903282433748245, -0.028031401336193085, -0.03198956698179245, 0.07010318338871002, 0.03877238184213638, 0.02824310213327408, 0.004439803306013346, -0.026131831109523773, -0.044854361563920975, 0.0834975466132164, 0.05969995632767677, -0.023689350113272667, -0.0434562973678112, -0.008240891620516777, 0.0017709332751110196, -0.040319617837667465, 0.06982611119747162, 0.031495798379182816, -0.012549283914268017, -0.0246213898062706, 0.022051986306905746, -0.07402234524488449, -0.02256499044597149, 0.09529376775026321, -0.03837374225258827, -0.01821134053170681, -0.04166944697499275, -0.03579194098711014, 0.0670338124036789, -0.02472550980746746, 0.0002331316063646227, -0.01414238940924406, -0.056569889187812805, -0.06881141662597656, 0.015360808931291103, 0.052713505923748016, -0.013229070231318474, 0.025531208142638206, 0.00679442286491394, -0.10497879981994629, -0.034326549619436264, -0.04066774994134903, -0.09846197068691254, -0.10771545767784119, 0.03642132878303528, 0.01829877682030201, -0.05857009068131447, 0.02847890369594097, 0.053489118814468384, 0.04978789761662483, 0.06911493092775345, 0.015972664579749107, 0.04907062649726868, -0.0012952005490660667, 0.09674714505672455, 0.1099923849105835, 0.03412239998579025, 0.03617200255393982, 0.03325085714459419, 0.020552366971969604]}