{"file_name": "botpenguin.com_glossary_user-engagement", "text": "URL: https://botpenguin.com/glossary/user-engagement\nUser Engagement: Stages and Strategies | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nUser Engagement\nTable of Contents\nUser Engagement: An Overview\nThe Impact of User Engagement on Profitability\nStages of User Engagement\nUser Engagement by Business Type\nStrategies to Increase User Engagement\nBenefits of Gamification in User Engagement\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nUser Engagement: An Overview\nUser engagement is like the excitement and fun you have when playing with your favorite toy, video game, or watching a show you love. It's about how much you enjoy it, how much you want to share it with your friends, and how often you choose to play with it or watch it.\nFor a website or an app, user engagement means that people really like using it, they spend a lot of time on it, and they keep coming back to it because they find it interesting, helpful, or entertaining. It's important because it tells the people who created the website or app that they are doing a good job and making something that people love.\nUnderstanding user engagement begins with knowing what signs to look for. It involves a range of metrics that offer you insights into user behaviors and preferences. Time spent on your platform, website or app, is one of the primary gauges.\nDetailed page views or session lengths can indicate the amount of interest and depth of interaction with your content. Bounce rate and click-through rates speak to the stickiness of your platform—whether users are finding what they’re looking for and quickly moving through your content.\nDuration of sessions, comments, shares, likes, and retweets are some signs of active engagement. On the other hand, purchase-related metrics, such as\nconversion rates\n, cart abandonment rates, and renewal rates, offer insights into the transactional side of user engagement.\nWho: The People Behind the Engagement\nUser engagement cannot exist without the users themselves.\nEngaged users\nwear many hats—they are visitors consuming the content, customers purchasing your services, followers sharing your updates, promoters spreading goodwill about your brand, and even critics providing valuable feedback.\nEngaged users are those who interact with your brand consistently and meaningfully, leaving traces that you can follow and learn from. Identifying this cohort enables you to tailor experiences that resonate with them and boost overall engagement.\nWhen: The Timing of Engagement\nUser engagement is not an isolated event—it’s a journey. It begins from the user's first encounter with your brand and evolves over time. It could be their first visit to your website, first purchase of your product, or even the first follow on your social media profile.\nTheir journey may grow into regular visits, repeated purchases, and constant interaction with your brand, potentially culminating in loyalty and advocacy. Understanding the timing of these stages helps you adapt your interaction to each user's specific journey stage.\nWhere: Finding Engagement Across Channels\nEngagement can happen anywhere users connect with your brand. This could be on search engine results, emails, newsletters, social media platforms, brand-apps, or online communities.\nUncovering where your most active users are engaging helps you understand their preferred channels and allows you to optimize those platforms accordingly. Then, you can create content specifically for those channels, increasing the chances of improving engagement.\nWhy: The Significance of User Engagement\nThe importance of user engagement cannot be underestimated. Engaged users build a deeper bond with your brand—they're the ones who interact more frequently, stay loyal to your brand, and contribute to your business growth.\nBy improving user engagement, you are not just bolstering numbers; you’re fostering relationships that can result in increased visitor retention, conversions, and ultimately, revenue.\nThrough the comprehensive understanding of the 5W's of user engagement, you get closer to creating an enviable user engagement strategy—one that results in a vibrant and engaged user community.\nThe Impact of User Engagement on Profitability\nIn this section, our focus will be on the critical correlation between user engagement and profitability, shedding light on how the former drives the latter to new heights.\nThe Power of User Engagement\nUser engagement is the lifeblood of a successful online presence. It reflects how users interact with your product or service, directly influencing customer loyalty, brand perception, and ultimately profitability.\nTranslating Engagement into Sales\nHigher\nengagement rates\noften lead to increased sales. Engaged users are likely to spend more, repurchase, and even become brand ambassadors. Their behaviors can drive higher revenue, contributing to overall profitability.\nUser Engagement and Customer Retention\nEngaged users show a higher tendency for loyalty and retention. Retaining\nexisting customers\nis cost-effective and results in higher lifetime value, positively impacting profitability.\nLowering Acquisition Costs\nBy fostering user engagement, businesses can reduce customer acquisition costs. Engaged users often promote the brand organically, leading to free word-of-mouth advertising and bringing in new users at lower costs.\nUpselling and Cross-selling Opportunities\nEngaged users are more open to upselling and cross-selling, allowing businesses to increase their average transaction value. This can significantly boost profitability.\nDriving Proactive Improvements\nUser engagement analytics provide valuable insights into user preferences and behaviours. Businesses can use these insights to improve product offerings,\nenhance customer service\n, and drive operational efficiency, all of which bolster profitability.\nIn essence, building and nurturing user engagement should be a priority for businesses looking to enhance their profitability. Whether it's through superior product offerings, excellent customer service or personalized experiences, fostering engagement is always a winning strategy.\nChat with Ease, Connect with Customers\nGet Started FREE\nStages of User Engagement\nFrom initial awareness to brand advocacy, let's uncover each phase of the journey.\nCreating Awareness\nUsers first become aware of your platform. This stage revolves around making a fantastic first impression. Your site's aesthetics, intuitive design, and easy-to-understand content can captivate users' attention from the first interaction.\nPiquing Interest\nOnce users have noticed you, it's time to pique their interest. Deliver engaging, valuable, and relevant content and features. The goal here is to encourage users to stick around and explore more of what you have to offer.\nDriving Consideration\nNow you've got their interest, it's time to nurture it. Users begin to weigh the benefits of further engagement. Showcase unique features, testimonials, or free trials to give them a nudge in the right direction—towards deeper engagement with you.\nEnsuring Conversion\nThis is where users take the plunge! Conversion might mean users sign up for a newsletter, make a purchase, or download a resource. This is a critical stage where sustained engagement translates into tangible action.\nMaintaining Retention\nNow that users have taken action, focus on turning them into repeat customers. Create post-conversion engagement strategies such as follow-up emails, reminders about unused features, or personalized content to keep them loyal to your platform.\nBuilding Advocacy\nIn this final stage, deeply engaged customers become brand advocates. By providing exceptional experiences, you inspire users to share their positive experiences with others, extending the engagement process to a loop of acquiring new users.\nUser Engagement by Business Type\nDifferent types of businesses have unique considerations when it comes to User Engagement:\neCommerce businesses\n: User Engagement in\neCommerce\nis driven by factors such as product discovery, seamless checkout experiences, personalized recommendations, and post-purchase interactions.\nUser Engagement rate calculation\n: User Engagement rate is a metric that measures the level of user involvement. It can be calculated by dividing the total number of engaged users by the total number of active users within a set time frame.\nStrategies to Increase User Engagement\nThis section pulls back the curtain on various strategies that can take user engagement on your platform to new heights. Let's dive into it!\nRevamping Website Design and User Experience\nIt all starts with aesthetics and smooth navigation. Transform your website's design to be visually appealing and easy to use. Clear navigation, responsive design, and intuitive interfaces can significantly elevate the\nuser experience\n, keeping users interested and engaged.\nLeveraging Interactive Content\nHow about turning your online visitors from passive onlookers to active participants? Interactive content, like quizzes, polls, or virtual tours, can do just that! It not only spikes users' curiosity but also encourages their active participation, leaving a lasting impression.\nEngaging through Social Media\nSocial media channels can act as ideal platforms to establish a two-way communication with your users. Regular posting, quick response to comments, and sharing user-generated content on these platforms can foster interaction and create a sense of community.\nMaking Experience Personal\nLet's make it 'personal'! The personalized experience caters to the specific needs of users, making them feel valued. From recommended products to personalized emails, highlight how well you know your users, and they will engage more frequently with your platform.\nInviting User-Generated Content\nWhat better way to engage users than having them contribute to your platform? Invite user-generated content, like reviews, pictures, or feedback. It not only adds a personal touch, but also makes users feel like they're part of your brand story.\nMonitoring and Optimizing Engagement Metrics\nData tells a tale, but only to those who listen. Keep tracking key engagement metrics like bounce rate, time on site, and user retention. Analyzing this data will provide valuable insights to refine your strategies and precisely cater to your user's needs.\nBenefits of Gamification in User Engagement\nIn this section, we'll explore the various benefits that come from making your users' experience more fun and engaging.\nInjecting Fun into Experiences\nGamification breathes life into ordinary tasks, making them more entertaining. By incorporating game-like elements into your platform, you can transform mundane activities into engaging experiences, boosting user interest and satisfaction.\nEnhancing Motivation\nGame mechanics like leaderboards, points, and badges tap into users' intrinsic motivation, encouraging healthy competition and a sense of achievement. As a result, users feel driven to return to your platform and stay engaged longer.\nBoosting Learning and Retention\nGamification can make complex concepts easier to digest. By presenting information through interactive games and quizzes, users can learn at their own pace, enhancing their understanding and knowledge retention.\nStrengthening User Loyalty\nWhen users feel motivated and entertained, they develop a positive association with your platform. This deepens their emotional connection with your brand, ultimately leading to a stronger sense of loyalty and long-term commitment.\nEncouraging Social Interaction\nFeatures like friend invites, social leaderboards, and community challenges foster socialization among users. This encourages them to share their experiences and achievements with friends, amplifying your platform's reach and attracting new users.\nTracking and Analyzing User Behavior\nGamification provides valuable data on user interactions. By monitoring how users interact with game elements, you can gain insights into their preferences, habits, and motivations. This data can be used to improve and tailor the user experience, boosting engagement even further.\nLearn by Experimentation, Build a Chatbot\nTry BotPenguin\nFrequently Asked Questions (FAQs)\nWhat are the benefits of focusing on user engagement?\nFocusing on user engagement leads to increased customer satisfaction, loyalty, and profitability. Engaged users become brand advocates, provide valuable feedback, and contribute to business growth.\nHow can businesses measure user engagement?\nUser engagement can be measured using metrics such as the number of active users, time spent on the product, repeat visits, and conversion rates. These metrics provide insights into user behavior and satisfaction levels.\nWhat strategies can businesses use to improve user engagement?\nBusinesses can improve user engagement through strategies like understanding user needs, improving product usability, providing self-paced learning materials, streamlining customer actions, and incorporating gamification elements.\nHow does user engagement impact profitability?\nUser engagement directly impacts profitability by driving revenue growth through increased conversions, repeat purchases, and customer advocacy. Engaged users are more likely to become paying customers and contribute to business success.\nWhat role does user engagement play in customer retention?\nUser engagement plays a crucial role in customer retention. When users are engaged, they are more likely to continue using a product or service, leading to higher customer retention rates and long-term business sustainability.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nUser Engagement: An Overview\nThe Impact of User Engagement on Profitability\nStages of User Engagement\nUser Engagement by Business Type\nStrategies to Increase User Engagement\nBenefits of Gamification in User Engagement\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.0928148478269577, -0.07285381108522415, 0.01759207248687744, 0.021597545593976974, -0.023515725508332253, -0.036032844334840775, 0.05202304199337959, 0.07901410758495331, -0.004634882789105177, 0.020846186205744743, 0.04306635633111, -0.016012176871299744, 0.009014327079057693, 0.02453763037919998, 0.1264915019273758, -0.014368142932653427, 0.09640342742204666, -0.10835453867912292, -0.08103469014167786, -0.014677670784294605, -0.013790929690003395, -0.02936551347374916, 0.03889954835176468, -0.02579057216644287, -0.031486742198467255, -0.04080190882086754, -0.028770525008440018, -0.015104098245501518, -0.01938915066421032, -0.07362112402915955, 0.0062439339235424995, 0.03247658908367157, -0.0006077793659642339, 0.05376273766160011, -0.0209816861897707, -0.046992674469947815, -0.020058264955878258, 0.01813427172601223, 0.07798422873020172, -0.05441436544060707, -0.08265954256057739, -0.08814401924610138, -0.047895558178424835, -0.002343028085306287, 0.09945854544639587, -0.014948849566280842, -0.061503954231739044, 0.024508431553840637, -0.003723397385329008, 0.09901303797960281, -0.08366921544075012, -0.05745885893702507, 0.033282727003097534, 0.05579815059900284, -0.03793969377875328, 0.038974862545728683, -0.017579693347215652, 0.011746497824788094, 0.047876812517642975, -0.01491549052298069, -0.05477897822856903, 0.0005857725045643747, 0.040891293436288834, 0.04568934813141823, -0.05018734931945801, 0.025296811014413834, -0.10368294268846512, -0.008319228887557983, 0.001545657985843718, -0.018970612436532974, -0.009439663961529732, -0.03389933705329895, -0.04660739004611969, 0.045897457748651505, 0.016916966065764427, -0.036805931478738785, 0.0074270544573664665, -0.00558127649128437, 0.02818792313337326, -0.04898066073656082, -0.013612145557999611, 0.047860048711299896, -0.00399231631308794, 0.056422390043735504, -0.03853346034884453, -0.03491171821951866, -0.014792426489293575, 0.03426879644393921, -0.03374941274523735, 0.00188100163359195, 0.016253910958766937, 0.024306058883666992, 0.015599677339196205, 0.00918145664036274, 0.004938796628266573, 0.018953176215291023, -0.06825839728116989, 0.01326601579785347, -0.060721226036548615, -0.002491358434781432, -0.00602917792275548, -0.029962453991174698, -0.06165291368961334, -0.07887908071279526, -0.05233686789870262, 0.005827934481203556, 0.04376300051808357, -0.025746366009116173, 0.1323166787624359, 0.014964129775762558, -0.1337839961051941, -0.0631549134850502, 0.004676362033933401, -0.026736777275800705, 0.027587613090872765, 0.02868070639669895, -0.048100411891937256, 0.06734582781791687, 0.1687433123588562, 0.023580383509397507, 0.06468901038169861, 0.06465434283018112, 0.023832038044929504, -0.009903213940560818, 0.05080638825893402, 0.03697953745722771, 0.0019994147587567568, 1.0719114784009568e-32, -0.03513505309820175, 0.02066623419523239, -0.056570738554000854, 0.11867021769285202, 0.02903774566948414, 0.019412554800510406, 0.028749527409672737, 0.039324577897787094, -0.07197090983390808, -0.02868371270596981, -0.0931292399764061, 0.12780778110027313, -0.07011477649211884, 0.05348684638738632, 0.027740024030208588, -0.08111253380775452, -0.00806484092026949, 0.0295987818390131, 0.03570352867245674, -0.007511472329497337, 0.08396787941455841, -0.044262275099754333, 0.058283355087041855, 0.07780693471431732, 0.1259571611881256, 0.03481627628207207, 0.0643683448433876, 0.02834170125424862, 0.04082959145307541, 0.033638760447502136, -0.08450278639793396, 0.004916827660053968, -0.05814974382519722, 0.0018887958722189069, -0.041960228234529495, -0.055056892335414886, -0.03555448353290558, -0.11495624482631683, -0.073256716132164, 0.03568487614393234, -0.14772161841392517, 0.00430371705442667, -0.10593575984239578, -0.06550478935241699, 0.012769612483680248, 0.02700592763721943, 0.03132464364171028, 0.01981513202190399, 0.03893876448273659, 0.029116511344909668, -0.041252270340919495, 0.02694740518927574, 0.05234871432185173, 0.06458918750286102, -0.0029090233147144318, -0.040407370775938034, 0.031713735312223434, -0.05088482052087784, -0.005534057971090078, -0.044105302542448044, 0.0016910608392208815, -0.029431691393256187, -0.019737713038921356, -0.03129023313522339, 0.05454515665769577, 0.024732358753681183, 0.050051942467689514, 0.02312341332435608, 0.034342192113399506, 0.03396059572696686, 0.03818826377391815, 0.05607089772820473, -0.008889758959412575, 0.019229821860790253, -0.0304190032184124, 0.002941619837656617, -0.09616558998823166, 0.034114304929971695, -0.049629002809524536, -0.002757180482149124, -0.018961073830723763, -0.021123889833688736, -0.02066947892308235, -0.03574124351143837, 0.0642995610833168, -0.03884628787636757, 0.038550782948732376, -0.04116174206137657, -0.030526606366038322, 0.04036737605929375, -0.05847439914941788, 0.07842270284891129, -0.07099397480487823, 0.0913945883512497, -0.04202621430158615, -8.45804993083496e-33, -0.03576158359646797, 0.014280012808740139, -0.05198581889271736, 0.08694922924041748, 0.025339799001812935, -0.026741962879896164, 0.03554566949605942, -0.04711015895009041, 0.12150239199399948, -0.010333831422030926, -0.09530748426914215, -0.023843707516789436, 0.021143553778529167, -0.022415725514292717, -0.0009907641215249896, 0.007644108962267637, -0.0565883032977581, -0.038186829537153244, 0.01958143524825573, 0.01770239695906639, -0.022298753261566162, 0.04712145775556564, -0.13554701209068298, -0.008980506099760532, -0.004949905909597874, 0.04243485629558563, -0.0789678618311882, 0.04628336802124977, 0.010782482102513313, 0.02127446047961712, -0.007046059239655733, -0.0051568299531936646, -0.020238952711224556, -0.01616401970386505, 0.01777748018503189, 0.05668458342552185, 0.003400527173653245, -0.011219089850783348, -0.019243478775024414, -0.0350666269659996, 0.0956292375922203, -0.051903512328863144, -0.0400644913315773, -0.0603654719889164, -0.0016543215606361628, 0.038345515727996826, -0.13228249549865723, -0.040936969220638275, -0.061183568090200424, 0.045304249972105026, 0.04883243888616562, 0.009168040007352829, 0.030898302793502808, -0.050630807876586914, -0.08359494805335999, -0.04205305129289627, 0.09468314051628113, -0.0029466350097209215, -0.08254119008779526, 0.01530554797500372, 0.035541169345378876, 0.005589939653873444, 0.06233663111925125, 0.07832469791173935, 0.04325568303465843, -0.019091399386525154, 0.05741115286946297, 0.03636905550956726, -0.0036975862458348274, -0.08066889643669128, 0.040965721011161804, -0.050345394760370255, -0.006527835037559271, -0.0008629444637335837, 0.01468526478856802, 0.08197560906410217, 0.031117403879761696, -0.12568537890911102, 0.017120052129030228, -0.025499774143099785, -0.0531705766916275, 0.0030605909414589405, 0.05590980499982834, 0.02808649092912674, -0.09913627058267593, 0.0710705891251564, -0.032279182225465775, 0.023555833846330643, -0.008739035576581955, 0.014465495944023132, -0.036657243967056274, 0.029560912400484085, -0.01856274902820587, 0.08953990787267685, 0.0026511000469326973, -5.932740876346543e-08, -0.03402009233832359, 0.012766925618052483, 0.05578474700450897, 0.050323065370321274, 0.0433681346476078, -0.05069916322827339, -0.036834798753261566, 0.07272569835186005, 0.02958773635327816, 0.027756569907069206, 0.026813484728336334, -0.02283160202205181, -0.04109438508749008, 0.06643904745578766, 0.06804272532463074, -0.013703744858503342, -0.015388165600597858, -0.01459492463618517, 0.008306867443025112, -0.03175780922174454, 0.06827358901500702, 0.02876303903758526, -0.03181220591068268, -0.0530812069773674, 0.009682301431894302, -0.052889805287122726, -0.04661315679550171, 0.08624713867902756, -0.03499459847807884, -0.008570908568799496, -0.02485617995262146, -0.03352751582860947, 0.07210657000541687, -0.04774944484233856, -0.006313921418040991, -0.00296051730401814, -0.07530982047319412, -0.07567612081766129, 0.014705847948789597, 0.04682132229208946, 0.007510868366807699, 0.01982799917459488, 0.015148536302149296, -0.08324228972196579, -0.04521587863564491, -0.035053931176662445, -0.06573689728975296, -0.10755422711372375, 0.04632987454533577, 0.005994846113026142, -0.07329767197370529, -0.0026894845068454742, 0.05262060835957527, 0.0381854772567749, 0.08402342349290848, -0.005809790920466185, 0.0613931305706501, 0.0049826703034341335, 0.09403121471405029, 0.10402822494506836, 0.028249066323041916, 0.018813015893101692, 0.023507079109549522, 0.03199111297726631]}