{"file_name": "botpenguin.com_glossary_deep-learning", "text": "URL: https://botpenguin.com/glossary/deep-learning\nDeep Learning: Types and Challenges | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nDeep Learning\nTable of Contents\nWhat is Deep Learning?\nWhy do we need Deep learning?\nHow Does Deep Learning Work?\nTypes of Deep Learning Models\nCommon Deep Learning Architectures\nDeep Learning Frameworks\nDeep Learning Hardware\nDeep Learning Challenges\nFrequently Asked Questions\nShare\nLink copied\nWhat is Deep Learning?\nDeep learning is a subfield of machine learning that focuses on artificial neural networks with multiple layers, known as deep neural networks.\nThese networks can learn complex patterns and representations from large amounts of data, enabling them to perform tasks such as image recognition, natural language processing, and game playing.\nDeep learning has gained popularity due to its ability to achieve high accuracy in tasks that were previously considered challenging for machines.\nIt has been widely applied across various industries, including healthcare, finance, and autonomous vehicles, driving innovation and improving efficiency.\nApplications of Deep Learning\nDeep Learning is like a Swiss Army knife, with a wide range of applications, including:\nImage and speech recognition\nNatural language processing and translation\nRecommendation systems\nMedical diagnosis and drug discovery\nFraud detection and cybersecurity\nRobotics and autonomous vehicles\nWhy do we need Deep learning?\nEnhanced Pattern Recognition\nDeep learning algorithms excel at recognizing patterns in data. From detecting faces in images to understanding speech, these algorithms identify underlying structures and make sense of complex datasets.\nHandling Unstructured Data\nTraditional algorithms often struggle with unstructured data like text, images, or audio. Deep learning models, however, can effectively process and analyze this type of data, making them invaluable in numerous applications.\nImproved Prediction and Decision-Making\nBy leveraging large datasets, deep learning models are capable of making highly accurate predictions. This ability is crucial in areas like financial forecasting, healthcare diagnostics, and supply chain management.\nScalability with Data Volume\nDeep learning models become more effective as the volume of data increases. Unlike other algorithms that plateau, deep learning continues to improve, making it ideal for big data applications.\nCustomization and Personalization\nDeep learning supports customization and personalization by learning from user data. This is essential for creating tailored experiences, such as personalized content recommendations in streaming services or targeted advertising.\nHow Does Deep Learning Work?\nArtificial Neural Networks\nAt the heart of deep learning are\nartificial neural networks\n(ANNs), which are inspired by the human brain's structure and function. ANNs are made up of interconnected nodes or neurons that process and transmit information. Each neuron receives input from other neurons, applies a mathematical function (called an activation function), and passes the result to the next layer of neurons.\nLayers in Deep Learning\nDeep learning models are like onions - they have layers! These layers of neurons can be grouped into three main types:\nInput Layer:\nThis is where the model receives the raw data, such as images, text, or sound.\nHidden Layers:\nThese layers perform complex transformations on the input data to extract meaningful features and patterns.\nOutput Layer:\nThis layer produces the final result, such as a classification or a prediction.\nActivation Functions\nActivation functions\nare like the bouncers of the neural network world. They're mathematical functions that determine the output of a neuron based on its input. They introduce non-linearity into the model, allowing it to learn complex patterns and relationships in the data. Common activation functions include the sigmoid, ReLU (Rectified Linear Unit), and softmax functions.\nForward and Backward Propagation\nDeep learning models learn by adjusting the weights of the connections between neurons. This is done through a process called\nforward and backward propagation\n. During forward propagation, the input data is passed through the network to produce an output. The model then compares its output to the true target value, calculating an error or loss. Backward propagation involves adjusting the weights of the connections to minimize this error, using a technique called gradient descent.\nDeep Learning vs Machine Learning vs AI\nExplore Now\nTypes of Deep Learning Models\nSupervised Learning\nIn\nsupervised learning\n, the model is like a student with a knowledgeable teacher. It's trained on a labeled dataset, where each input is associated with a corresponding target output. The model learns to map inputs to outputs by minimizing the error between its predictions and the true target values. Examples of supervised learning tasks include image classification, speech recognition, and regression.\nUnsupervised Learning\nUnsupervised learning\nis like a curious explorer, venturing into the unknown. The model is trained on an unlabeled dataset, where the goal is to discover underlying patterns or structures in the data. The model learns to identify similarities and differences between data points, often through techniques such as clustering or dimensionality reduction. Examples of unsupervised learning tasks include anomaly detection, topic modeling, and image segmentation.\nReinforcement Learning\nIn\nreinforcement learning\n, the model is like a video game character, learning to make decisions by interacting with an environment. The model receives feedback in the form of rewards or penalties, and its goal is to maximize the cumulative reward over time. This type of learning is particularly useful for training agents in tasks such as game playing, robotics, and resource allocation.\nTransfer Learning\nTransfer learning\nis like the ultimate life hack for deep learning. It allows a model trained on one task to be fine-tuned for a different, but related task. This can significantly reduce the amount of training data and computational resources required for the new task. Transfer learning is commonly used in tasks such as image recognition, where a model trained on a large dataset (e.g., ImageNet) can be fine-tuned to recognize specific objects or scenes.\nCommon Deep Learning Architectures\nConvolutional Neural Networks (CNNs)\nConvolutional Neural Networks\n(CNNs) are like the superstars of the deep learning world, designed for processing grid-like data, such as images. CNNs use convolutional layers to scan the input data for local patterns, such as edges, textures, and shapes. These patterns are then combined in higher layers to form more complex features, such as objects and scenes. CNNs have been highly successful in tasks such as image classification, object detection, and segmentation.\nRecurrent Neural Networks (RNNs)\nRecurrent Neural Networks\n(RNNs) are like the time travelers of deep learning, designed for processing sequences of data, such as time series or natural language. RNNs have connections that loop back on themselves, allowing them to maintain a hidden state that can capture information from previous time steps. This makes them well-suited for tasks such as language modeling, text generation, and speech recognition. However, RNNs can suffer from issues such as vanishing or exploding gradients, which can make them difficult to train.\nLong Short-Term Memory (LSTM) Networks\nLong Short-Term Memory\n(LSTM) networks are like the upgraded version of RNNs, designed to overcome the vanishing gradient problem. LSTMs use a special gating mechanism that allows them to learn long-range dependencies and selectively remember or forget information over time. This makes them particularly effective for tasks such as machine translation, sentiment analysis, and video analysis.\nGenerative Adversarial Networks (GANs)\nGenerative Adversarial Networks\n(GANs) are like the artists of the deep learning world, able to generate new data samples that resemble a given dataset. GANs consist of two neural networks, a generator and a discriminator, that are trained together in a process called adversarial training. The generator learns to create realistic data samples, while the discriminator learns to distinguish between real and generated samples. GANs have been used to generate realistic images, music, and even 3D models.\nDeep Learning Frameworks\nTensorFlow\nTensorFlow\nis like the popular kid in the deep learning framework world, developed by Google. It provides a flexible and efficient platform for building and deploying\nmachine learning\nmodels, with support for a wide range of neural network architectures. TensorFlow also offers tools for visualization, debugging, and distributed training.\nPyTorch\nPyTorch\nis like the cool, artsy friend in the deep learning framework world, developed by Facebook. It is known for its dynamic computational graph and strong support for research and experimentation. PyTorch provides an intuitive interface for building and training neural networks, as well as a large ecosystem of libraries and tools.\nKeras\nKeras\nis like the friendly, easy-going neighbor in the deep learning library world. It provides a simple and user-friendly interface for building and training neural networks. Keras is built on top of TensorFlow and can also be used with other backends such as Theano or Microsoft Cognitive Toolkit. Keras is popular among beginners and researchers for its ease of use and flexibility.\nCaffe\nCaffe\nis like the speed demon of the deep learning framework world, developed by the Berkeley Vision and Learning Center. It is particularly popular in the computer vision community for its speed and efficiency in training and deploying convolutional neural networks. Caffe provides a wide range of pre-trained models and supports fine-tuning for specific tasks.\nDeep Learning Hardware\nGraphics Processing Units (GPUs)\nGraphics Processing Units\n(GPUs) are like the workhorses of deep learning, specialized hardware devices designed for rendering graphics and performing parallel computations. GPUs have become essential for the large-scale matrix operations required in training neural networks. NVIDIA is the leading provider of GPUs for deep learning, with their CUDA platform and cuDNN library providing optimized support for popular frameworks such as TensorFlow and PyTorch.\nTensor Processing Units (TPUs)\nTensor Processing Units\n(TPUs) are like the custom-tailored suit of deep learning hardware, designed by Google specifically for accelerating deep learning tasks. TPUs are optimized for the low-precision arithmetic required in neural network training and can deliver significant speed improvements over GPUs. TPUs are available on Google Cloud Platform and can be used with TensorFlow.\nCloud-based Deep Learning Platforms\nMany cloud providers offer\ndeep learning platforms\nthat provide access to powerful hardware and software resources for training and deploying neural networks. These platforms can save time and reduce the complexity of setting up and managing your own deep learning infrastructure. Popular deep learning platforms include Google Cloud AI Platform, Amazon SageMaker, and Microsoft Azure Machine Learning.\nDeep Learning Challenges\nHandling Large Datasets\nDeep learning often requires massive datasets for training, which poses challenges in terms of storage, processing power, and memory. Additionally, curating and labeling such datasets can be time-consuming and costly. For smaller organizations without substantial resources, this can create barriers to implementing effective deep learning systems.\nRequiring High Computational Power\nThe computational power required for deep learning is immense. Training deep neural networks involves processing a huge number of parameters, which can take a long time even on powerful machines. This not only increases the costs associated with hardware but also the energy consumption, making it less environmentally friendly.\nLack of Interpretability\nIt’s often difficult to understand how deep learning models arrive at specific decisions or predictions. This lack of interpretability, or the “black box” nature of deep learning, is a significant challenge, especially in sectors where explainability is crucial, like healthcare or finance. Stakeholders may be hesitant to trust or adopt models they do not understand.\nHandling Unstructured Data\nDeep learning models excel at handling structured data but struggle with unstructured data. Unstructured data, like text or images, doesn't fit neatly into traditional database structures. Extracting meaningful features from such data for deep learning is challenging and often requires complex pre-processing and feature engineering techniques.\nVulnerability to Adversarial Attacks\nDeep learning models are susceptible to adversarial attacks where the input data is perturbed slightly to produce incorrect outputs. Such vulnerabilities can have serious consequences, particularly in security-sensitive applications. Researchers are continuously working on developing techniques to make deep learning models more robust against these kinds of attacks.\nFrequently Asked Questions\nWhat is Deep Learning?\nDeep Learning is a subset of\nmachine learning\nthat utilizes neural networks with multiple layers to learn complex patterns and make decisions from data.\nWhat are Neural Networks?\nNeural Networks are computational models inspired by the human brain. They consist of layers of neurons that can learn to recognize patterns in data.\nWhat is the difference between Deep Learning and Machine Learning?\nMachine Learning is a broader concept for algorithms that learn from data. Deep Learning is a subset of Machine Learning using deep neural networks.\nWhat is Backpropagation in Deep Learning?\nBackpropagation is an algorithm used in training neural networks. It calculates the gradient of the loss function to adjust the weights for better predictions.\nHow is Deep Learning used in real-world applications?\nDeep Learning is used in various applications like image and speech recognition, natural language processing, autonomous vehicles, and medical diagnosis among others.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat is Deep Learning?\nWhy do we need Deep learning?\nHow Does Deep Learning Work?\nTypes of Deep Learning Models\nCommon Deep Learning Architectures\nDeep Learning Frameworks\nDeep Learning Hardware\nDeep Learning Challenges\nFrequently Asked Questions\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.11677040159702301, -0.08154841512441635, 0.033272866159677505, 0.01523652859032154, -0.02565358579158783, -0.03808484971523285, 0.025247769430279732, 0.06503672152757645, -0.024445028975605965, 0.0053862472996115685, 0.018047520890831947, -0.014970880001783371, -0.010655795224010944, 0.0232797022908926, 0.09659959375858307, -0.022095007821917534, 0.11368554085493088, -0.08096329867839813, -0.11115094274282455, -0.033604059368371964, 0.004601753782480955, -0.024165652692317963, 0.03599214926362038, -0.038948118686676025, -0.02728121727705002, -0.03534563258290291, -0.0274038128554821, -0.034587614238262177, -0.005463647656142712, -0.07512731850147247, 0.00400144187733531, 0.00976514257490635, -0.007302481215447187, 0.061382077634334564, -0.01204600092023611, -0.019806882366538048, -0.05260087549686432, 0.015608117915689945, 0.0780194029211998, -0.05965593457221985, -0.07907846570014954, -0.09050928056240082, -0.05243520811200142, 0.007634490262717009, 0.10918088257312775, 0.0064952741377055645, -0.057683899998664856, 0.010664486326277256, 0.016961751505732536, 0.07707285135984421, -0.08686666190624237, -0.049410928040742874, 0.03340773656964302, 0.07288825511932373, -0.034745581448078156, 0.03014405444264412, -0.03141765668988228, 0.017024997621774673, 0.01833651401102543, -0.011186345480382442, -0.03516117483377457, -0.02070680819451809, 0.056559182703495026, 0.02251078002154827, -0.04258143529295921, 0.026693053543567657, -0.11477780342102051, 0.0159042589366436, 0.009869187138974667, -0.029361996799707413, 0.009526530280709267, 0.010510801337659359, -0.0523177869617939, 0.0473562516272068, 0.022094745188951492, -0.025269892066717148, 0.018347779288887978, -0.01273793913424015, 0.032328423112630844, -0.06590495258569717, 0.00493339030072093, 0.06717837601900101, -0.004511228296905756, 0.054577428847551346, 0.00044794235145673156, -0.05264574661850929, -0.01621255837380886, 0.03779277950525284, -0.05614055320620537, -0.011336724273860455, 0.03431084007024765, -0.010050899349153042, 0.01767493039369583, 0.012159484438598156, 0.0247185081243515, 0.021526340395212173, -0.0709553211927414, 0.0016887239180505276, -0.07450530678033829, 0.006046842318028212, -0.016404950991272926, -0.03682919591665268, -0.04393499717116356, -0.07224098592996597, -0.04485592618584633, 0.028117025271058083, 0.06633511185646057, -0.021479377523064613, 0.15489494800567627, -0.014622829854488373, -0.11296407133340836, -0.040131017565727234, 0.006000032648444176, -0.018001867458224297, 0.012472359463572502, 0.026541337370872498, -0.04237252473831177, 0.044412825256586075, 0.13026463985443115, 0.05179983749985695, 0.02146652713418007, 0.05531690642237663, -0.00379018927924335, -0.004810376092791557, 0.03443555161356926, 0.020830197259783745, -0.016128282994031906, 1.0898716361819798e-32, -0.024864165112376213, 0.030154971405863762, -0.0701126903295517, 0.08995774388313293, 0.05123177543282509, 0.017915256321430206, 0.015802651643753052, 0.058284588158130646, -0.08105608820915222, -0.0063039823435246944, -0.10269558429718018, 0.09622900187969208, -0.09037543833255768, 0.07607976347208023, 0.024340173229575157, -0.08390022069215775, -0.02685702033340931, 0.021841447800397873, 0.05117325484752655, -0.02020297944545746, 0.08618328720331192, -0.026829583570361137, 0.05754636600613594, 0.0719948410987854, 0.1180591955780983, 0.024633759632706642, 0.08264386653900146, 0.030605372041463852, 0.05446074903011322, 0.028084103018045425, -0.10371807217597961, -0.0018865653546527028, -0.04445115849375725, 0.027095727622509003, -0.03599937632679939, -0.04377983510494232, -0.03557177633047104, -0.09871374815702438, -0.05344018712639809, 0.016747860237956047, -0.12697643041610718, 0.008682009764015675, -0.10029349476099014, -0.07559200376272202, 0.018745586276054382, -0.0020060576498508453, 0.043443698436021805, -0.0005706499214284122, 0.00181475467979908, 0.023959456011652946, -0.04512011259794235, 0.01030027400702238, 0.027264965698122978, 0.017860133200883865, 0.014891770668327808, -0.027499333024024963, 0.05401400104165077, -0.020157182589173317, 0.0075676292181015015, -0.020241379737854004, 0.00512019032612443, -0.027987675741314888, -0.021389663219451904, -0.00562532851472497, 0.04681124538183212, 0.03662315011024475, 0.06624595820903778, 0.04419683665037155, 0.057769909501075745, 0.01324961893260479, 0.040572356432676315, 0.056605011224746704, -0.018282724544405937, 0.02080472931265831, -0.024757102131843567, 0.013302567414939404, -0.07721902430057526, 0.019623583182692528, -0.0527145192027092, 0.014224616810679436, -0.012650365941226482, 0.024123098701238632, -0.013496026396751404, -0.018056148663163185, 0.04613881558179855, -0.01861451379954815, 0.025151381269097328, -0.05837038904428482, -0.003916437737643719, 0.055100589990615845, -0.050597336143255234, 0.07197567820549011, -0.06698939949274063, 0.07226689159870148, -0.03571324050426483, -8.370406541405589e-33, -0.048099834471940994, 0.02994641289114952, -0.08507142961025238, 0.0888620913028717, 0.02873588167130947, -0.024324728175997734, 0.013838465325534344, -0.04419318214058876, 0.07427052408456802, -0.004997605923563242, -0.08100754767656326, -0.02015775442123413, 0.01069288607686758, -0.035275716334581375, -0.009404144249856472, 0.012920593842864037, -0.0802430585026741, -0.041271064430475235, 0.01759251020848751, 0.005742945242673159, -0.01984100043773651, 0.06379223614931107, -0.13052156567573547, 0.008213729597628117, -0.013051418587565422, 0.03539222106337547, -0.08496329933404922, 0.07873963564634323, 0.020103266462683678, 0.021351706236600876, -0.02180369570851326, -0.01800527796149254, -0.045950233936309814, -0.001969041069969535, 0.006369973532855511, 0.07282096147537231, 0.03545409440994263, -0.023511609062552452, -0.020261958241462708, -0.05434912443161011, 0.1125364676117897, -0.06297361105680466, -0.04569553956389427, -0.06654038280248642, -0.018881671130657196, 0.030094800516963005, -0.13815312087535858, -0.04941752925515175, -0.0358639694750309, 0.045202989131212234, 0.062224600464105606, -0.0019845720380544662, 0.02703402377665043, -0.04662267863750458, -0.09550169855356216, -0.02892453223466873, 0.09827864915132523, 0.015257131308317184, -0.06962212920188904, 0.038774583488702774, 0.015193488448858261, -0.012536651454865932, 0.0557732954621315, 0.06484756618738174, 0.032911140471696854, -0.011324124410748482, 0.03981056064367294, 0.06342871487140656, -0.017086680978536606, -0.07527900487184525, 0.05405627563595772, -0.04781471565365791, 0.006779504008591175, 0.008832128718495369, 0.0029841563664376736, 0.072408527135849, 0.03127818927168846, -0.09888995438814163, 0.004158003721386194, -0.0416429378092289, -0.047971222549676895, -0.018342331051826477, 0.039311934262514114, 0.0743352472782135, -0.06618299335241318, 0.08683718740940094, -0.019200369715690613, 0.027634844183921814, -0.0015056035481393337, 0.012073304504156113, -0.046008799225091934, 0.038031455129384995, -0.031182611361145973, 0.08121143281459808, -0.00761899258941412, -5.859891771820003e-08, -0.04186755046248436, 0.022621018812060356, 0.056925904005765915, 0.034504469484090805, 0.05628806725144386, -0.06684258580207825, -0.044294290244579315, 0.10027856379747391, 0.0263694878667593, 0.039877280592918396, 0.0316714309155941, -0.022683652117848396, -0.061523374170064926, 0.05502988398075104, 0.04925055801868439, 0.024619799107313156, -0.0043984679505229, -0.02170049212872982, 0.03295760601758957, -0.0375371128320694, 0.08761394768953323, 0.036530397832393646, -0.028323864564299583, -0.025355475023388863, 0.012490403838455677, -0.09141135960817337, -0.05993633344769478, 0.08611633628606796, -0.04064171388745308, -0.0005561974248848855, -0.023369234055280685, -0.01873612590134144, 0.061273153871297836, -0.05938505753874779, 0.015107540413737297, 0.031664010137319565, -0.059596408158540726, -0.07809736579656601, 0.0001277429546462372, 0.030995212495326996, 0.009682891890406609, 0.046886589378118515, 0.02363159880042076, -0.09236244857311249, -0.03539265692234039, -0.04602938890457153, -0.06684843450784683, -0.11800164729356766, 0.056388381868600845, 0.01181409414857626, -0.05648265406489372, 0.01880148984491825, 0.05821323022246361, 0.052621595561504364, 0.09267457574605942, -0.008735769428312778, 0.07132164388895035, -0.025624265894293785, 0.08075863122940063, 0.13963954150676727, 0.025748781859874725, 0.014590157195925713, 0.016162490472197533, 0.045328062027692795]}