{"file_name": "botpenguin.com_chatbot-industry_education", "text": "URL: https://botpenguin.com/chatbot-industry/education\nEducation Chatbot | Chatbot for Education Industry | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGet Education Chatbot for Universities and\nEducational Institutions\nMake learning as easy as ABC with BotPenguin’s Education Chatbot. Answer admissions queries,\ncapture candidate details share course updates, and instant support for students & staff with a ChatGPT-driven bot.\nGet Started FREE\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nAnswer Repeat Queries & Onboard Students with a Seamless Education Chatbot\nMake admissions a cakewalk with BotPenguin handling FAQs for admissions, fee structure, forms\nsubmissions, document requirements, entrance tests, & much more.\nAnswer All Questions\nBoost registration rates and solve student queries instantly, 24x7. Train our Education Chatbot to answer admission queries on your behalf.\nStudent Enrollment Simplified\nAssist students with eligibility queries, course structure & selection, fees, and document submissions.\nIntegrate with Your LMS\nConnect the learning management system with your education chatbot to enable access to course materials, assignment submissions, grades, & enrollment process.\nLead Generation for Days\nGenerate more admission leads & qualify them with natural conversations. Train the ChatGPT-driven education chatbot to collect leads for new admissions 24/7.\nSend Leads Data To Your CRM\nIntegrate your education bot with leading CRMs like HubSpot, Zoho, GoHighLevel, Freshdesk, etc., and send leads data for efficient marketing automation.\nCall Your Leads\nWith our Twilio Integration, you can call your leads directly from the chatbot platform. No need to switch devices or apps.\nAllow Order Tracking\nEnable customers to track their orders in chat. The eCommerce chatbot sends tracking updates instantly, keeping customers in the loop.\nAssist in Course Selection\nResolve redundant student queries about courses, duration, schedules, credits, internships, and more in real-time.\nLive Chat for Counseling\nConnect with students and their families, listen to their queries and complaints, review the student’s performance, and give honest feedback via live chat.\nFAQs for Parents and Guardians\nThe chatbot can address concerns & questions parents or guardians may have, such as tuition fees, accommodation, campus safety, etc.\nGive Career Guidance\nThe chatbot can offer guidance on career paths, job prospects, and required qualifications for different professions, helping students make informed choices.\nGet Started FREE\nLet Students Hit the Books With\nOur Education AI Chatbot\nUse the education chatbot to assist every student at once & save your time for critical tasks. Give a\npersonalized learning experience at the pace suited to your students.\nTrain AI Learning Bot on Your Resources\nTrain your AI education chatbot on your unique admission process, course details, fee structure, & more to answer all admission questions easily.\nVirtual Teaching Assistants\nAI chatbots can be virtual teaching assistants, helping educators with administrative tasks, grading assignments, providing feedback, and delivering student content.\nPractice and Assessment\nGenerative AI education chatbots can conduct quizzes, offer practice exercises, and give tailored feedback to help students pinpoint areas for improvement.\nAI-Driven Homework & Study Assistance\nAI chatbots in education can assist students with homework, assignments, and studying. They can provide explanations and help with problem-solving.\nPersonalized Recommendations By AI\nBased on user preferences, performance, and learning goals, the AI education chatbot can recommend relevant courses, resources, or learning pathways to support student learning journeys.\nIntegration With ChatGPT\nTired of answering the same questions daily? Let ChatGPT-driven chatbot take care of them. Train on custom data and give accurate answers to curious students.\nChoose Your Bots Personality & Tone\nGive the look & feel you want your students to interact with. Tailor the chatbot’s theme & voice according to your brand.\nAnalyze Student’s Sentiments\nAI chatbots with sentiment analysis aid teachers in understanding student feelings, enabling prompt responses to enhance teaching methods and foster effective learning environments.\nBenefits for Generative AI-Driven Education Chatbot for Learners & Educators\nAvail benefits for yourself and your students with our education chatbot. Save your manual paperwork, teach anytime with an AI tutor, & get more admissions throughout the year..\nGet More Admissions\nAnswer inquiries and provide enrollment guidance, leading to increased admissions.\nSave Time\nAnswer all admission-related and general inquiries with your education chatbot and freeing up educators' valuable time.\nSave Money\nReduce costs by reducing the manpower and automating the routine tasks with your virtual educator.\nReduce Manual Effort\nAutomate FAQ responses and provide feedback, allowing educators to focus on quality teaching and personalized support.\nBoost Sales\nUtilize the chatbot to promote & sell educational courses, materials, & services, growing your educational institution revenue.\nProvide an Omnichannel Learning Experience with an Education Chatbot\nDeploy your ChatGPT-driven education chatbot on your favorite channels. Engage your students, promote your services,\nand be the help that they deserve.\nWhatsApp\nWhatsApp\nConnect with students on the go through WhatsApp, delivering instant answers, study materials, exam reminders, course offers, and personalized guidance.\nMessenger\nMessenger\nInteract with students on Facebook, answer their FAQs, share educational content, provide course updates, & send engaging messages.\nWebsite\nWebsite\nEngage website visitors with an education chatbot, answer FAQs, give admissions guidance, provide course details & fee structure, book consultations, & more.\nTelegram\nTelegram\nDeliver learning support through Telegram bots for education, offering real-time support, sharing resources, and organizing quizzes.\nMicrosoft Teams\nMicrosoft Teams\nCollaborate with students and educators on MS Teams, integrating chatbots to answer queries, distribute assignments, schedule virtual classes, and more.\nSlack\nSlack\nStreamline communication on Slack with chatbots, facilitate student-teacher interactions, solve FAQs, share key updates, and organize discussion channels.\nGet Started FREE\nFit Education Chatbot To Any Business Use Case\nTailor your education chatbot to adapt to your educational business niche, be it school, college, coaching\ncenter, e-learning platform, or more.\nChatbot for Schools\nImplement a chatbot to simplify communication between teachers, students, and parents. Provide resources, answer queries, and streamline administrative tasks.\nColleges & Universities\nUse chatbots for admissions, course registration, career counseling, and campus info. Share scholarship opportunities and guidance on choosing the right program.\nCoaching Centers\nUtilize chatbots to automate student queries, course scheduling, and exam preparation, providing a seamless learning experience.\nOnline Learning (Ed-Tech) Platforms\nIntegrate chatbots to offer personalized learning experiences, interactive quizzes, share study materials, and instant student support.\nLanguage Learning Centers\nImprove language skills with chatbots offering practice exercises, vocabulary drills, cultural insights, and personalized feedback. Offer interactive learning experiences.\nProfessional Training Institutes\nEnhance training effectiveness & student satisfaction with chatbots for course recommendations, career guidance, skill assessment, and job placement assistance.\nEducation Chatbot Organizes Classes &\nAutomates Booking\nWith calendar integrations, learners can book classes and counseling sessions in the chat.\nEducators can also connect with each other through group meetings.\nLet Students Book Classes In Chat\nWith our calendar integration feature, learners can book classes and counseling sessions by selecting slots, days, and teachers directly via chat.\nOrganize Group Meetings With Educators\nYour education chatbot can organize group meetings and share invites with all the team members for maximum appearance.\nConnect With Favorite Booking Platforms\nOur chatbot can connect with Google Calendar, Simplybook, Calendly, or your custom booking app, making it easy for learners to schedule classes.\nMarketing Made Easy with Education Chatbot\nBotPenguin's Education Chatbot can help you create an all-around solution for your customers. Use cool\nwidgets, plan drip campaigns, send class reminders, & share discounts on courses.\nPromote Your Courses\nSend your course details to the target user base and get more enrollments in your plan, increasing revenue with personalized marketing.\nShare Gift Cards or Discount Coupons\nSend your students the latest offers and seasonal course deals. use an educational chatbot to multiply your reach and automate promotions.\nBroadcast and Drip Campaigns\nPromote your educational offerings at scale. Send attractive broadcasts & schedule drip campaigns to existing students & potential candidates automatically.\nEvent Promotion\nChatbots can help promote educational events such as webinars, open houses, or workshops by providing details, answering queries, and helping with event registration.\nSend Alerts to Parents\nKeep parents in the loop with regular class notifications, course updates, fee reminders, student feedback, and result announcements.\nSend Fees Invoice & Reminder\nShare the fee invoice in chat post-submission by the candidate or student. Send reminders to them for timely fee payment.\nResult Announcement\nNotify students of their results by sending them directly in chat or providing a link for them to check their status independently.\nShare Attendance Updates\nSend an attendance report to each student detailing their classes, presents, and absences.\nSend Class Reschedule Notification\nInform your students about changes in class schedule by sending rescheduling notifications through your education chatbot.\nRich Content Delivery\nThe social chatbots can share multimedia content in chat, such as videos, images, and other interactive elements for an immersive learning experience.\nPersonalized Welcome Messages\nGreet students with personalized welcome messages and make them feel as if they’re talking to a person.\nHelp your students have a smooth learning experience\nEnlighten your students with a support team ready to address their questions around the clock. Send\nfeedback, key reminders, and performance assessment.\nLive Chat With Students\nHowever smart your AI is, it can’t handle every student. For those special cases, you can take over the conversation & live chat with your candidate.\nAdd Your Team\nOnboard your team members on the chatbot platform to handle complex queries and offer consultations. Assign roles based on their access level.\nGet Real-Time Feedback\nCollect feedback about your education services after interactions to improve candidates' or students' experiences.\nCourse Enrollment Assistance\nChatbots can guide students to enroll in courses, explain the requirements, select suitable programs, and complete the necessary forms.\nStudy Material Delivery\nEducation chatbots can deliver digital study materials, e-books, lecture notes, and other resources, ensuring students have easy access to the materials they need.\nAssignment and Exam Support\nEducation Chatbots can assist students with assignment or exam-related queries, providing clarifications, suggestions, or additional resources to help them succeed.\nUnified Inbox\nProvide a unified inbox to your admission support team to manage admission support efficiently.\nAutomate Profile Creation\nYour AI learning chatbot will create customer profiles based on demographic data, device, page history, location, etc, helping you understand the student journey faster.\nIntegration With 80+ Tools\nExtend your support by integrating education chatbot with CRM & ticketing platforms like HubSpot, Zoho, Salesforce, Helpdesk, and more.\nSell Your Learning Services Like a Charm with AI Education Chatbot\nGenerate leads, manage sales or engage with your prospects; all done by a single Education Chatbot Educate, promote, and sell while effortleslsly managing administrative tasks..\nSend Course Catalogs In Chat\nShowcase your courses and learning programs directly within the chatbot, making it easy for prospects to explore and choose the right options.\nSell Study Materials & Stationaries\nOffer a range of study materials, textbooks, and stationery items for sale through the chatbot, providing convenience to your customers.\nPayment Integrations\nSeamlessly integrate popular payment gateways like Stripe, Razor Pay, etc., into the chatbot, allowing customers to make secure and hassle-free payments for your learning services.\nCollect, Qualify, & Segment Leads\nGather valuable lead information, qualify them based on their interests and requirements, and segment them for targeted sales and marketing efforts.\nAutomated Sales Support\nAssist customers with placing orders, providing order updates, and addressing FAQs automatically, freeing up your sales team's time for more strategic tasks.\nEnjoy Ready-to-Use and Human like Education Chatbot Templates.\nMade for real people, by real people. Use these templates to give your context a deeper meaning. Utilize them in your chat flows to express a deeper message.\nAnswer Admission Queries\nThink fast! BotPenguiun can answer admission queries and FAQs if you are trained, just like an athlete.\nLead Generation Chatbot for Education\nGenerate leads with BotPenguin for the education sector and grow your lead data.\nStudent Class Booking\nBook appointments in a jiffy with BotPenguin.\nGet BotPenguin Today\nCreate Your Generative AI Education Chatbot With BotPenguin\nLaunch a smart chatbot for education imbued with ChatGPT. Improve students' learning experience with quick answers,\nassessments, feedback, homework assistance, & accurate grading.\nTrainable Generative AI with ChatGPT integration\nLearning Management System Integration\nLive Chat with Human Handover\nPayment Gateway Integration\nChatGPT Integration\nQuick Replies\nPabbly & Zapeir Integration\nNative Integrations\nThere is never a price associated with our integrations. For the finest online education service experience,\nBotPenguin cooperates effectively with others whether it is appointment booking or keeping students informed.\nand more than 80 tools to integrate\nBuild your conversational chatbot today\nFrequently Asked Questions\nWhat is an education chatbot?\nAn education chatbot is an AI-powered tool designed to assist educational institutions by providing instant support, automating processes, answering queries, and enhancing student engagement.\nWhat is the best chatbot for education?\nBotPenguin's Education Chatbot stands out as one of the best options for education. It offers features like admissions assistance, class booking, personalized recommendations, and student support.\nWhat is the purpose of educational chatbot?\nThe purpose of an educational chatbot is to streamline processes, provide instant support, improve student experiences, and boost engagement within educational institutions.\nWhat is student chatbot?\nA student chatbot is a virtual assistant designed to help students with queries, provide information on courses, admissions, schedules, and offer support throughout their academic journey.\nCan chatbot help students?\nYes, chatbots can assist students by answering queries, providing course information, offering study materials, scheduling appointments, sending class reminders, and guiding them through various processes.\nWhat is an example of a chatbot for students?\nAn example of a chatbot for students is BotPenguin's Education Chatbot, which offers features like admission assistance, class booking, student reports, personalized suggestions, and student support.\nWill chatbots replace teachers?\nNo, chatbots won't replace teachers but can complement their roles by automating administrative tasks, providing support, delivering content, and enhancing student experiences.\nWhich is the best AI-driven education chatbot?\nOne of the best AI-driven education chatbots is BotPenguin's Education Chatbot, known for its trainable generative AI, admission assistance, 80+ integrations, admission lead generation, and student support features.\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nGet more convertible leads for your education consultancy\nGet more leads\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09764862060546875, -0.06039639189839363, 0.02591528929769993, 0.011804373934864998, -0.003945525269955397, -0.053064242005348206, 0.028279254212975502, 0.06094555929303169, 0.006904612760990858, 0.028322787955403328, 0.07182665169239044, -0.0027903516311198473, -0.0029116314835846424, 0.030157728120684624, 0.11391688883304596, -0.015592760406434536, 0.09639991819858551, -0.1001708060503006, -0.07588441669940948, -0.0346154049038887, -0.00021838420070707798, -0.000405751692596823, 0.05646716430783272, -0.02659989893436432, -0.02250458113849163, -0.0369226448237896, -0.019573502242565155, -0.030830731615424156, -0.02692783810198307, -0.08532349765300751, -0.0014849182916805148, 0.023547014221549034, 0.0024012092035263777, 0.07132388651371002, -0.00918359775096178, -0.034274086356163025, -0.02292119339108467, 0.032813262194395065, 0.07320652157068253, -0.049769818782806396, -0.10001331567764282, -0.08247337490320206, -0.054565686732530594, -0.012493864633142948, 0.09476076066493988, -0.02044611983001232, -0.07904661446809769, -0.01358654722571373, 0.024762673303484917, 0.09456503391265869, -0.09316201508045197, -0.05743848532438278, 0.06617672741413116, 0.04108460992574692, -0.06804784387350082, 0.048036154359579086, -0.03762121871113777, 0.020985763520002365, 0.034598857164382935, -0.004636088851839304, -0.05713704228401184, -0.00015491711383219808, 0.0453028567135334, 0.04045185446739197, -0.03959126025438309, 0.026365317404270172, -0.12567183375358582, 0.01067956630140543, 0.005285859107971191, -0.02693157084286213, -0.0034116744063794613, -0.02162274904549122, -0.04981076717376709, 0.058651503175497055, 0.025205500423908234, -0.02505721151828766, 0.00414979737251997, 0.0003670367877930403, 0.02682456374168396, -0.05533231049776077, -0.017662400379776955, 0.029722852632403374, -0.0026069169398397207, 0.032329101115465164, -0.032691605389118195, -0.026274481788277626, 0.007506031077355146, 0.05208504945039749, -0.005035795271396637, 0.004226610064506531, 0.03136494383215904, -0.007466226816177368, 0.0331316813826561, 0.03950483351945877, 0.031059373170137405, 0.008082385174930096, -0.04708649963140488, 0.025913601741194725, -0.06488597393035889, -0.01632669009268284, -0.013705244287848473, -0.0355713777244091, -0.06993770599365234, -0.06984739005565643, -0.0525655597448349, 0.017565909773111343, 0.05896122008562088, -0.024294309318065643, 0.15101459622383118, -0.0023862344678491354, -0.12135700136423111, -0.054550785571336746, -0.022259175777435303, -0.01260107010602951, -0.0005209511145949364, 0.033733874559402466, -0.026028597727417946, 0.04775652289390564, 0.13713853061199188, 0.04265258461236954, 0.06539290398359299, 0.06127682700753212, -0.0009840436978265643, -0.021510697901248932, 0.05128038302063942, -0.003019198076799512, -0.02356206811964512, 1.1370810321473383e-32, -0.010151254013180733, 0.036199141293764114, -0.05992602929472923, 0.10006064176559448, 0.03871258348226547, 0.02323370985686779, 0.025144033133983612, 0.05650950223207474, -0.0674302950501442, -0.03408752754330635, -0.10099329799413681, 0.09965231269598007, -0.07252045720815659, 0.04865843430161476, 0.03353448584675789, -0.07981261610984802, -0.023982781916856766, 0.01832444593310356, 0.05300414189696312, 0.021598147228360176, 0.06735139340162277, -0.04202966392040253, 0.06358808279037476, 0.06929776817560196, 0.11161880940198898, 0.04224129766225815, 0.068865105509758, 0.025188609957695007, 0.066553995013237, 0.03469976410269737, -0.08251910656690598, -0.0028339549899101257, -0.06615607440471649, -0.001625707489438355, -0.033422958105802536, -0.052788421511650085, -0.02194874733686447, -0.10081089287996292, -0.07554160058498383, 0.033767491579055786, -0.1398770660161972, -0.002310310024768114, -0.08525831252336502, -0.06184816733002663, 0.03721131384372711, 0.005191496107727289, 0.03147247061133385, 0.015478854067623615, 0.032672230154275894, 0.0449298657476902, -0.06769289821386337, 0.019991697743535042, 0.010963520966470242, 0.035315513610839844, 0.0016903040232136846, -0.045144397765398026, 0.035303354263305664, -0.01970176212489605, -0.014409629628062248, -0.04446643590927124, -0.022869836539030075, -0.020581882447004318, -0.001569857238791883, -0.02182921953499317, 0.05284825339913368, 0.019597750157117844, 0.05075480788946152, 0.02674943022429943, 0.049028180539608, 0.010103288106620312, 0.04222683981060982, 0.038387101143598557, -0.028403444215655327, 0.03995683789253235, -0.053934741765260696, 0.01941251941025257, -0.09796788543462753, 0.02801174856722355, -0.024609576910734177, 0.010509863495826721, 0.00201783305965364, -0.01928573288023472, -0.017467396333813667, -0.056153640151023865, 0.07040859758853912, -0.04583591967821121, 0.0295622069388628, -0.044856831431388855, -0.00787799246609211, 0.05535969138145447, -0.0450609065592289, 0.07901996374130249, -0.0734570175409317, 0.09607713669538498, -0.046111106872558594, -9.367161098713593e-33, -0.033882271498441696, 0.03596474230289459, -0.05218645930290222, 0.08734893053770065, 0.02143763191998005, -0.02606365643441677, 0.060546983033418655, -0.028638850897550583, 0.09780464321374893, -0.006005915813148022, -0.09089542180299759, -0.014616802334785461, 0.007723140995949507, -0.031447846442461014, -0.018125122413039207, 0.031160596758127213, -0.06251653283834457, -0.023112239316105843, 0.016659032553434372, 0.004549006465822458, -0.03509318083524704, 0.05797882750630379, -0.10760612040758133, 0.018663667142391205, -0.003660759888589382, 0.038519300520420074, -0.07837483286857605, 0.053043484687805176, 0.01573307439684868, 0.03877600282430649, -0.00630592368543148, -0.011288580484688282, -0.024862166494131088, 0.016133632510900497, 0.011793149635195732, 0.058601293712854385, 0.01698099821805954, -0.0017302765045315027, -0.025868993252515793, -0.04512729123234749, 0.10939507186412811, -0.06787118315696716, -0.047381117939949036, -0.07609554380178452, -0.011633454822003841, 0.020467422902584076, -0.13729436695575714, -0.04253588989377022, -0.04911903291940689, 0.04760819301009178, 0.05157473310828209, -0.0007543865940533578, 0.05603482201695442, -0.05534578114748001, -0.06459271162748337, -0.03328524902462959, 0.09885403513908386, 0.019977819174528122, -0.09602515399456024, 0.012283963151276112, 0.0474419966340065, -0.008561653085052967, 0.06314301490783691, 0.07090882211923599, 0.03686099126935005, -0.022130083292722702, 0.06783755123615265, 0.0666830837726593, -0.0228617861866951, -0.08960498869419098, 0.06843594461679459, -0.04281531646847725, -0.009100436232984066, -0.020443199202418327, 0.017131753265857697, 0.09301528334617615, 0.04867895320057869, -0.09714240580797195, 0.0012353024212643504, -0.018011268228292465, -0.04383934661746025, -0.015353582799434662, 0.06436211615800858, 0.03665104880928993, -0.07505745440721512, 0.06278961151838303, -0.021337751299142838, 0.005101531278342009, -0.0016061775386333466, 0.015689482912421227, -0.04760660603642464, 0.018602091819047928, -0.016548126935958862, 0.07850922644138336, 0.004671657923609018, -5.901012301023911e-08, -0.024906793609261513, -0.022185318171977997, 0.049598775804042816, 0.04042207449674606, 0.03982453793287277, -0.07134230434894562, -0.04176381975412369, 0.07982437312602997, 0.025734134018421173, 0.042495183646678925, -0.004194390960037708, -0.017069049179553986, -0.0524730458855629, 0.0657634437084198, 0.08516234159469604, -0.008285153657197952, -0.03653150796890259, -0.009812884964048862, 0.017201248556375504, -0.04293275624513626, 0.07493771612644196, -0.0024098940193653107, -0.022918911650776863, -0.01796429045498371, 0.0066755288280546665, -0.06086483970284462, -0.06315462291240692, 0.080354243516922, -0.06116969883441925, -0.0014965500449761748, -0.0256644356995821, -0.04457753151655197, 0.06313952803611755, -0.059441566467285156, 0.020088205114006996, -0.02021016739308834, -0.08016397804021835, -0.08913572877645493, 0.018279727548360825, 0.05580395087599754, -0.0011366395046934485, -0.00938574131578207, 0.022542772814631462, -0.0869169682264328, -0.009291616268455982, -0.04548494145274162, -0.08047327399253845, -0.10889971256256104, 0.03794659674167633, 0.008337634615600109, -0.06657637655735016, -0.009338355623185635, 0.045861467719078064, -0.005062587093561888, 0.09099267423152924, -0.00956150982528925, 0.06867559254169464, -0.017469143494963646, 0.07955771684646606, 0.10273874551057816, 0.04501887410879135, 0.023939916864037514, 0.027676446363329887, 0.027939293533563614]}