{"file_name": "botpenguin.com_blogs_top-ways-email-automation-tools-can-boost-your-revenue", "text": "URL: https://botpenguin.com/blogs/top-ways-email-automation-tools-can-boost-your-revenue\n9 Ways Email Automation Tools can Boost your Revenue in 2023\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\n9 Ways Email Automation Tools can Boost your Revenue in 2023\nAutomation\nUpdated at Sep 9, 2024\n8 min to read\nBotPenguin\nContent Writer, BotPenguin\nTry BotPenguin\nTable of Contents\nIntroduction\nWhat is Email Marketing automation?\nWhy is Email Automation important?\nUncover the Top 10 Workflow Tools of the Year!\n9 ways Email Automation tools can boost your revenue in 2023\nBest practices for using email automation tools\nEmpower Your Business with Intelligent Marketing Automation\nConclusion\nFAQs\nShare\nLink copied\nIntroduction\nDo you know? Email marketing offers a typical ROI of\n$36 for every $1 spent\n. According to Statista, global income from email marketing will reach\n$17.9 billion\nby 2027, up from\n$10.8 billion\nin 2023. Whether you're just starting with email marketing or seeking to expand your success, now is the time to hop on board.\nBecause there are so many fantastic methods to earn cash for your organization with introductory email, email marketing is still as profitable as ever. Email marketing is one of the most successful ways to expand a company's reach and income.\nThe best part is that you can use\nemail automation\nto put your email marketing efforts on autopilot. Several email marketing providers have automated tools to help you save time.\nIn this blog, we'll go through some of the top email automation systems in detail so you can choose the right solution for your business. Are you ready to see your earnings skyrocket? Here are 9 basic strategies you can use with your email marketing plan to do this right now.\nWhat is Email Marketing automation?\nSource: retainful.com\nEmail marketing automation is the technique of automating and streamlining email marketing campaigns via the use of software solutions.\nDepending on their behavior, preferences, and other data, businesses may use email marketing automation to deliver targeted and tailored communications to their subscribers at the appropriate time.\nWhy is Email Automation important?\nEmail automation is a tool that can help businesses save time and get better results from their email campaigns. It can increase productivity so that you can get more done quickly. By\npersonalizing emails\n, companies can increase their return on investment (ROI) and give customers a better experience.\nWhen it comes to email marketing, using automation and email segmentation can be very effective for businesses. These tools can help you optimize your email campaigns and increase your revenue. Many services are available with automation capabilities if you're considering email automation. You can choose the one that's best for your business goals.\nUncover the Top 10 Workflow Tools of the Year!\nExplore the top tools now!\n9 ways Email Automation tools can boost your revenue in 2023\nHere are 9 easy and unique ways\nemail automation\nsolutions may increase your business in 2023.\n1. You can personalize your messages for email automation\nPersonalizing your messaging is one of the most effective strategies to boost the effectiveness of your email marketing initiatives. Email automation technologies enable you to segment your audience and send\ncustomized messages\ndepending on their preferences and activity.\nYou may, for example, deliver tailored communications to subscribers who have just completed a purchase or have abandoned their basket. You may boost the possibility that subscribers will engage with your emails and eventually make a purchase by giving tailored recommendations and offers.\n2. You can divide your audience into separate groups\nThe technique of splitting your audience into separate groups based on specific criteria like geography, hobbies, or behavior is known as segmentation. Email automation solutions simplify splitting your list and sending personalized messages to each group.\nYou may, for example, send a special offer to subscribers in a certain location or a\nfollow-up email\nto subscribers who opened an initial email but have yet to click through. You can enhance engagement and revenue by sending customized communications to each demographic.\n3. You can use drip marketing campaigns to send emails\nDrip campaigns are a series of automatic emails that are sent to subscribers over time. These campaigns may help you\nnurture leads\n, welcome new subscribers, and educate customers about your products or services.\nYou may build up drip campaigns ahead of time with email automation solutions and let the technology do the job for you. You can establish trust and boost the possibility of purchase by giving relevant and quality material to subscribers over time.\n4. You can use campaigns to reduce cart abandonment for email automation\nCart abandonment is a typical issue for\ne-commerce companies\n, but email automation systems can assist you in recovering lost purchases. You may send automated emails to subscribers who have placed products in their basket but have not finished their transaction using a cart abandonment campaign.\nPersonalized recommendations, special discounts, and reminders to complete their purchase can all be included in these emails. You may recoup lost money and boost conversion rates by utilizing email automation solutions to follow up with abandoned carts.\n5. You can use email automation for product suggestions\nProduct suggestions are an effective method of increasing the value of each consumer. Using email automation technologies, you may evaluate client activity and create tailored suggestions based on their interests and previous purchases.\nYou can, for example, send a tailored email proposing things that complement a customer's past purchase or give a discount on products they have expressed interest in. By making appropriate product recommendations, you may enhance the possibility of clients making future purchases, resulting in more significant income.\n6. You can use email automation campaigns for upselling and cross-selling.\nSource: zapier\nUpselling and cross-selling are two successful ways to enhance each customer's value. Using email automation technologies, you may evaluate consumer activity and send targeted messages promoting new items or services.\nFor example, you might send an email promoting a higher-priced product to a client who has already purchased a lower-priced product, or you could offer a bundle of complementary items. You can raise the value of each client and create more revenue by utilizing email automation solutions to upsell and cross-sell.\n7. You may use email automation technologies to send automatic emails\nCustomer comments and reviews are critical for establishing trust and increasing conversions. After purchase, you may use email automation technologies to send automatic emails\nasking for comments or reviews\n.\nThese emails can be solicited review requests, in which you urge the consumer to submit a review on a third-party website, or unsolicited review requests, in which you ask the client to offer feedback directly to your company. You may boost the possibility that consumers will submit a review by utilizing\nemail automation solutions\nto solicit feedback and reviews.\nThis will improve your reputation and make you more money.\n8. You can use email automation for re-engagement campaigns\nInactive subscribers can be a drain on your email marketing efforts, but email automation tools can help you re-engage these subscribers. With a re-engagement campaign, you can send a series of automated emails to subscribers who have not engaged with your emails in a while.\nThese emails can include special offers, exclusive content, or reminders of the value your business provides. By using email automation tools to re-engage inactive subscribers, you can increase engagement and ultimately drive more revenue.\n9. You can use email automation for event marketing\nIf your company offers events, email automation solutions effectively market them to your target demographic. You may use email automation systems to deliver customized communications to subscribers who live in a specific location or have previously expressed interest in similar events.\nYou may also use email automation solutions to send event reminders, updates, and follow-up communications after the event. Increase attendance and income by promoting your events with email automation systems.\nBest practices for using email automation tools\nEmail automation tools may benefit firms that want to boost income through email marketing. Yet, in order to get the most out of these tools, best practices for using them must be followed.\nHere are some pointers for making the most of email automation tools:\nStart with a clear plan:\nBefore implementing email automation technologies, it is critical to have a clear strategy in place. This involves establishing your objectives, identifying your target audience, and creating a customer journey map.\nUse correct and clean data:\nEmail automation technologies rely on accurate and clean data to perform correctly. Check that your subscriber lists are up to date and that you're gathering data legally and ethically.\nPersonalize your messages:\nCustomization is essential for engaging subscribers and increasing income. Create targeted and customized messages that appeal directly to your audience using data.\nTest and optimize:\nEmail automation systems give valuable data and insights that can be utilized to enhance your campaigns. Different message offers and calls-to-action should be tested to find what works best for your audience.\nMonitor and analyze:\nyour email automation campaigns regularly to measure their progress and discover areas for improvement.\nEnsure compliance:\nEnsure that you are adhering to email marketing laws and regulations, like obtaining consent from subscribers and providing an unsubscribe option.\nBy adhering to these best practices, businesses may effectively utilize email automation solutions to enhance income through focused and personalized email marketing campaigns.\nEmpower Your Business with Intelligent Marketing Automation\nGet Started Today!\nConclusion\nWhile social media platforms receive significant attention, email marketing is still one of the most successful ways to engage with and reach customers. By utilizing email automation solutions, businesses can personalize their messaging, segment their audience, and deliver targeted campaigns at the right time.\nThe advantages of using email automation tools include saving time, improving targeting,\nenhancing efficiency\n, and increasing revenue. Email automation technologies may improve revenue through personalization, segmentation, drip marketing campaigns, campaigns to reduce cart abandonment, product suggestions, upsell and cross-sell, requests for feedback and reviews, and event marketing.\nIn 2023, businesses that adopt and improve their email automation practices will have a significant advantage over their competitors.\nWell, that’s a wrap!\nWe hope you found this blog insightful. Fore more such blogs, head onto\nBotPenguin\nright away!\nFAQs\nHow can email automation tools contribute to revenue growth in 2023?\nEmail automation tools have the potential to significantly boost your revenue in 2023. These tools streamline your email marketing campaigns, enabling you to efficiently reach a larger audience. By sending personalized and targeted emails at scale, you can achieve higher engagement rates and increased conversions, translating into revenue growth.\nHow do email automation tools enhance customer engagement?\nEmail automation tools enhance customer engagement by allowing you to deliver relevant and timely content to your subscribers. Through personalized content, dynamic sequencing, and triggered emails, you can ensure that your audience receives messages tailored to their preferences and actions. This results in higher engagement and interaction with your emails.\nIn what ways do email automation tools improve lead nurturing?\nEmail automation tools improve lead nurturing by enabling you to set up automated email sequences that guide leads through the customer journey. By sending targeted and personalized emails triggered by specific actions or behaviors, you can effectively nurture leads and increase the likelihood of conversion.\nCan email automation tools positively impact conversion rates?\nAbsolutely! Email automation tools have a significant impact on conversion rates. By delivering timely and relevant emails, nurturing leads, promoting special offers, and encouraging repeat purchases, these tools greatly contribute to higher conversion rates and increased revenue.\nDo email automation tools provide analytics and reporting features?\nCertainly! Most email automation tools offer comprehensive analytics and reporting features. These features provide valuable insights into key metrics such as open rates, click-through rates, conversion rates, and revenue generated. By analyzing these metrics, you can optimize your email campaigns for better results.\nIn what ways do email automation tools improve customer retention?\nEmail automation tools foster stronger customer relationships through personalized and relevant communication. By sending tailored emails based on customer preferences, purchase history, and behavior, you can nurture customer loyalty, leading to improved customer retention rates.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\nUsing Marketing Automation to Drive Lead Generation\nUpdated at Jan 18, 2024\n9 min to read\nBotPenguin\nContent Writer, BotPenguin\nMarketing Automation Best Practices for Small Businesses\nUpdated at Apr 30, 2024\n9 min to read\nBotPenguin\nContent Writer, BotPenguin\nExploring Contact Center Automation: Future of Service\nUpdated at Sep 16, 2024\n7 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nIntroduction\nWhat is Email Marketing automation?\nWhy is Email Automation important?\nUncover the Top 10 Workflow Tools of the Year!\n9 ways Email Automation tools can boost your revenue in 2023\nBest practices for using email automation tools\nEmpower Your Business with Intelligent Marketing Automation\nConclusion\nFAQs\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.1082715168595314, -0.057255979627370834, 0.023935671895742416, 0.00339701771736145, 0.025246627628803253, -0.03050347790122032, 0.04417555779218674, 0.07412967085838318, -0.02919156476855278, 0.007985214702785015, 0.008784476667642593, -0.009159368462860584, 0.024922288954257965, 0.017362171784043312, 0.11978331208229065, 0.011208626441657543, 0.10258113592863083, -0.0998450294137001, -0.06759528815746307, -0.024997707456350327, -0.0213001798838377, -0.03509896993637085, 0.04180699586868286, -0.038242731243371964, -0.02804708294570446, -0.04105183482170105, -0.048838719725608826, -0.019774511456489563, -0.04337714985013008, -0.07417891919612885, 0.015758441761136055, 0.005382211413234472, 0.015598463825881481, 0.05406196787953377, -0.023428654298186302, -0.049929179251194, -0.030331555753946304, 0.019360097125172615, 0.0883881226181984, -0.06171851605176926, -0.08341566473245621, -0.08701127022504807, -0.05728786811232567, -0.030100079253315926, 0.09099175781011581, 0.002332448260858655, -0.03961775451898575, 0.014698643237352371, 0.005094258580356836, 0.0778549462556839, -0.08580697327852249, -0.04338328540325165, 0.048616521060466766, 0.04174836724996567, -0.03764055296778679, 0.042672112584114075, -0.008805789984762669, -0.0025002562906593084, 0.048741672188043594, -0.017981981858611107, -0.029388828203082085, -0.009637245908379555, 0.029055418446660042, 0.016912614926695824, -0.025608308613300323, -0.0013619351666420698, -0.09765202552080154, 0.00022742158034816384, -0.013786268420517445, -0.024385523051023483, -0.028088325634598732, -0.01813037134706974, -0.04491408169269562, 0.058517370373010635, 0.01578075997531414, -0.030695268884301186, 0.012363323010504246, -0.006845882628113031, 0.025427894666790962, -0.03259992226958275, -0.05874919518828392, 0.05581621080636978, -0.024883562698960304, 0.06394700706005096, -0.02712644450366497, -0.018826596438884735, -0.005745150614529848, 0.03334399312734604, -0.023566698655486107, 0.03506574034690857, 0.04741989076137543, 0.0013683002907782793, -0.01873224414885044, 0.02515297755599022, 0.02441483549773693, 0.013884513638913631, -0.08329488337039948, -0.028863348066806793, -0.04618404805660248, -0.007989717647433281, 0.015404371544718742, -0.01911425217986107, -0.03140706941485405, -0.09850466251373291, -0.04357646405696869, -0.006121902726590633, 0.06212376803159714, 0.007010827772319317, 0.11831116676330566, 0.005874304566532373, -0.08610031008720398, -0.05412429943680763, 0.015758180990815163, -0.042218174785375595, 0.030572200194001198, 0.013108625076711178, -0.05175810307264328, 0.08172664046287537, 0.15535137057304382, 0.029788192361593246, 0.053616564720869064, 0.06451811641454697, 0.01573120802640915, -0.022343942895531654, 0.08358708024024963, 0.04408286139369011, 0.001223188010044396, 9.988806592466575e-33, -0.03915581479668617, 0.05102900043129921, -0.033874619752168655, 0.07743263244628906, 0.0323207788169384, 0.021513886749744415, 0.01673121191561222, 0.05206317454576492, -0.07139040529727936, -0.043213896453380585, -0.10553650557994843, 0.12207287549972534, -0.05080673471093178, 0.042202699929475784, 0.02016971819102764, -0.09277952462434769, -0.0022917368914932013, 0.014078103937208652, 0.05352601781487465, -0.029318565502762794, 0.09576432406902313, -0.060901716351509094, 0.0569559745490551, 0.089165098965168, 0.11522971838712692, 0.00921026710420847, 0.09841568768024445, 0.024673426523804665, 0.03591471165418625, 0.040201179683208466, -0.09293491393327713, 0.012767800129950047, -0.04264010488986969, 0.05618620663881302, -0.05033014714717865, -0.026735983788967133, -0.06648552417755127, -0.08969061821699142, -0.057430118322372437, 0.07800816744565964, -0.12160273641347885, 0.01793481409549713, -0.07403254508972168, -0.07782250642776489, 0.003277474781498313, 0.020569222047924995, 0.025481831282377243, 0.029582945629954338, 0.05656203255057335, 0.012014832347631454, -0.0055422293953597546, -0.00973527878522873, 0.0545179545879364, 0.034729525446891785, -0.002900981344282627, -0.019453011453151703, 0.03217771276831627, -0.039792269468307495, 0.03319385647773743, -0.034147709608078, -0.03590956702828407, -0.041877225041389465, -0.0017501083202660084, -0.015008227899670601, 0.03825175389647484, 0.006148575805127621, 0.07984670251607895, 0.011053185909986496, 0.015284908004105091, 0.05122320353984833, 0.06304671615362167, 0.033515606075525284, -0.020835665985941887, 0.027020389214158058, -0.011136326938867569, 0.016022907570004463, -0.08467143028974533, 0.00949142500758171, -0.04207579419016838, 0.01184695865958929, -0.02575255185365677, -0.007791612762957811, -0.016578983515501022, -0.02923070266842842, 0.07929662615060806, -0.03311241790652275, 0.022599201649427414, -0.011337952688336372, -0.02737114578485489, 0.04946451634168625, -0.020575225353240967, 0.04796595498919487, -0.06018224358558655, 0.09316558390855789, -0.05185726284980774, -7.357881992697334e-33, -0.03437777981162071, 0.017505092546343803, -0.0491633266210556, 0.08145715296268463, 0.012148031033575535, -0.013238804414868355, 0.041148047894239426, -0.03865397721529007, 0.08603180199861526, -0.014034250751137733, -0.10215125977993011, 0.005131129641085863, 0.0005101061542518437, -0.04043980687856674, -0.01657804474234581, 0.00019137880008202046, -0.057609107345342636, -0.05844814330339432, 0.006296594627201557, 0.006754864007234573, -0.050713591277599335, 0.056548766791820526, -0.11289921402931213, 0.005346630234271288, -0.009938953444361687, 0.043800171464681625, -0.11074519902467728, 0.0919874981045723, 0.03970274701714516, 0.017237255349755287, -0.01753089390695095, 0.014356101863086224, -0.01591789349913597, 0.006673955358564854, 0.02277960814535618, 0.03696005418896675, 0.01256023533642292, -0.017684850841760635, 0.02359253168106079, -0.035903118550777435, 0.09232933819293976, -0.031435996294021606, -0.038866907358169556, -0.05657900497317314, 0.0033671832643449306, 0.04035599157214165, -0.13452580571174622, -0.017654290422797203, -0.06578025966882706, 0.047320201992988586, 0.03056636080145836, 0.01935022883117199, 0.03319678455591202, -0.045688629150390625, -0.08522717654705048, -0.01786172389984131, 0.09577963501214981, 0.009164896793663502, -0.0882926806807518, 0.042694251984357834, -0.009458886459469795, 0.02797502651810646, 0.09551183134317398, 0.06797850131988525, 0.03871716931462288, -0.016740648075938225, 0.09578284621238708, 0.038476914167404175, -0.02959856018424034, -0.09586130827665329, 0.05775607377290726, -0.0388203002512455, -0.014932102523744106, -0.025202946737408638, -0.009076301008462906, 0.08439578860998154, 0.04453084617853165, -0.07278616726398468, 0.013183658011257648, -0.02820124663412571, -0.02334444224834442, -0.001712828641757369, 0.062199272215366364, 0.027323700487613678, -0.10495369136333466, 0.03301282227039337, -0.04253234714269638, -0.014805794693529606, 0.030657028779387474, 0.024124668911099434, -0.06542263925075531, 0.004591869655996561, -0.009174419566988945, 0.10290402173995972, 0.007619651034474373, -5.577687289815003e-08, -0.01837458461523056, -0.027070926502346992, 0.0480433851480484, 0.07954800873994827, 0.016671862453222275, -0.030079582706093788, -0.025875477120280266, 0.11424725502729416, 0.041500065475702286, 0.008283887058496475, 0.02121550403535366, -0.03391783684492111, -0.0429624505341053, 0.08864807337522507, 0.06685250252485275, -0.013712435029447079, -0.005768589675426483, -0.033199574798345566, 0.009219550527632236, -0.04574313387274742, 0.07924051582813263, 0.020438337698578835, -0.006684527732431889, -0.0468456856906414, 0.044954102486371994, -0.07307277619838715, -0.045086413621902466, 0.07303759455680847, -0.0534018911421299, -0.012011048384010792, -0.043054986745119095, -0.06534670293331146, 0.0417216420173645, -0.026679780334234238, -0.007878707721829414, -0.012085331603884697, -0.06736764311790466, -0.0973002091050148, 0.005172938574105501, 0.03556982800364494, 0.04433951526880264, 0.023326123133301735, 0.010826952755451202, -0.110483318567276, -0.04708382114768028, -0.0678911805152893, -0.09064318239688873, -0.11890335381031036, 0.03615330532193184, 0.011780221946537495, -0.04544896259903908, 0.025191711261868477, 0.06112648919224739, 0.046156082302331924, 0.058417245745658875, 0.006747719366103411, 0.05654779449105263, -0.03631257638335228, 0.08833490312099457, 0.11364388465881348, 0.024070637300610542, 0.020050467923283577, 0.037036340683698654, 0.005763337016105652]}