{"file_name": "botpenguin.com_blogs_get-the-best-whatsapp-whitelabel-chatbot-with-botpenguin", "text": "URL: https://botpenguin.com/blogs/get-the-best-whatsapp-whitelabel-chatbot-with-botpenguin\nGet the Best Whatsapp Whitelabel Chatbot with BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nGet the Best Whatsapp Whitelabel Chatbot with BotPenguin\nPartner\nUpdated at Oct 15, 2024\n9 min to read\nAjay Pratap Sudhakar\nProduct Manager, BotPenguin\nTry BotPenguin\nTable of Contents\nWhat is BotPenguin’s WhatsApp Whitelabel Chatbot?\nWhat Are the Key Features of BotPenguin's WhatsApp Whitelabel Chatbot Partnership?\nBenefits of  BotPenguin’s WhatsApp White Label Chatbot Platform\nHow Does a WhatsApp Whitelabel Chatbot Partnership Work?\nWho can Choose BotPenguin for WhatsApp Whitelabel Chatbot?\nWhy Choose BotPenguin for WhatsApp Whitelabel Chatbot Partnership?\nHow To Get Started with BotPenguin's WhatsApp Whitelabel Chatbot?\nConclusion\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nWhat’s the biggest reason anyone would want to sell a white-label WhatsApp chatbot?\nThe simple answer is that 50 million brands use WhatsApp as a business tool. These aren’t just brands; they’re your potential customers.\nOptimized and personalized WhatsApp messages from companies achieve a 70% open rate and a 15% clickthrough rate. In addition, chatbot automation makes it more efficient than it already is.\nWhatsApp is a solution that businesses globally need. With BotPenguin's WhatsApp whitelabel chatbot program, you can become a chatbot service provider in less than 12 hours. You can start now if you wish.\nIn this article, I will explain why BotPenguin’s white-label program is the best option for starting a WhatsApp chatbot agency and explore its key features.\nSo, let’s dive in.\nGet Started with\nBotPenguin's WhatsApp Whitelabel Chatbot\nNow!\nWhat is BotPenguin’s WhatsApp Whitelabel Chatbot?\nThe WhatsApp White Label Chatbot Program by BotPenguin offers a robust software platform that allows individuals or businesses to onboard clients to WhatsApp chatbots, providing access to full-scale WhatsApp API features.\nAs a chatbot reseller, you can customize the chatbot provider platform with your branding, logo, domain, and pricing.\nYour onboarded businesses can send broadcast messages, set up drip campaigns, and automate customer interactions, enhancing communication efficiency with the WhatsApp AI chatbot.\nThis solution is perfect for expanding service offerings, improving customer engagement, and driving growth. It's a comprehensive tool for anyone looking to leverage WhatsApp's power for business.\nIf you were to take the traditional route, there would be astronomical costs and resource usage to research and develop a platform from scratch. If you don’t have that luxury, your best bet is to become a\nWhatsApp whitelabel chatbot\nreseller.\nWhat Are the Key Features of BotPenguin's WhatsApp Whitelabel Chatbot Partnership?\nBotPenuin offers a practical set of feature that helps chatbot reseller like you effectively run their whitelabeled platform. Let’s take a look.\nConfigure Taxes\n: Easily configure tax settings based on your country and business preferences, ensuring compliance with local tax regulations and accurate billing for your clients.\nSell Add-Ons:\nBoost revenue by offering additional features, plugins, or services as paid add-ons to your chatbot platform, allowing further customization.\nFree Trial:\nOffer potential customers a free trial period to showcase the value of your WhatsApp chatbots and increase conversion rates.\nAdd Your Own Subscription Plans:\nCreate multiple subscription plans with custom names, features, and integrations to maximize revenue and cater to various customer needs.\nSelect Currency Country-wise:\nOffer multi-currency support to cater to global customers, providing a localized experience and simplifying international transactions.\nCreate Monthly or Quarterly Pricing Plans\n: Provide flexible pricing options based on monthly or quarterly billing cycles, giving customers convenience and choice.\nControl Integrations:\nManage and configure integrations with platforms like Zoho, ChatGPT, and Google Suite to enhance chatbot functionality and meet client needs.\nOnboard as Many Clients as You Want:\nCreate and manage unlimited sub-accounts under a single main account, making it ideal for businesses with multiple departments or clients.\nSafe and Secure:\nBank-level security, high availability architecture, and HIPAA-compliant data governance ensure reliability and compliance. From administrator training to priority technical assistance and expert advisory, our teams actively guide your success.\nThe focus with BotPenguin is empowering partners through purpose-built white-label conversational tools fortified by resilient infrastructure, regular innovation, and dedicated support models.\nBenefits of  BotPenguin’s WhatsApp White Label Chatbot Platform\nElevate your service lineup with BotPenguin's\nWhatsApp White Label Chatbot\nPlatform, which offers unparalleled features and benefits designed to maximize revenue.\nExpand Service Offerings\n: Integrate WhatsApp chatbots with your existing services, providing a comprehensive solution that enhances customer engagement and satisfaction while expanding your service portfolio.\nSell ChatGPT Integration:\nOffer market-leading products with ChatGPT integration, tapping into the generative AI market to provide advanced, intelligent chatbot solutions that enhance user interactions.\nKeep All Profits:\nMaximize your earnings with BotPenguin's zero-commission policy, ensuring you keep all the revenue from your white label chatbot services.\nQuick Onboarding:\nReceive onboarding assistance to get your white label platform up and running within 24 hours, ensuring a swift start to your new business offering.\nComprehensive Training:\nOur training sessions will help you overcome the learning curve and efficiently manage and deploy your white-label WhatsApp chatbots.\nDocument\nTake Advantage of the AI Wave & Make\nMoney by Selling Whitelabel AI WhatsApp Chatbots!\nBecome a Partner\nHow Does a WhatsApp Whitelabel Chatbot Partnership Work?\nA\nWhatsApp whitelabel chatbot partnership\nleverages WhatsApp's Business API capabilities to interact with users and provide automated responses.\nIt consists of various components, including a user interface, backend infrastructure, and a chatbot engine, that work together to deliver a seamless conversational experience.\nThe chatbot interacts with users by analyzing the messages they send. It uses natural language processing (NLP) techniques to understand the intent behind the message and extract relevant information. Based on this analysis, the chatbot engine generates an appropriate response.\nThe chatbot's responses can be predefined and programmed based on frequently asked questions or generated dynamically using machine learning algorithms.\nThe chatbot engine uses the information it has gathered to craft a relevant and helpful response to the user's query.\nThe automated response is then returned to the user via the WhatsApp Business API, enabling the chatbot to provide instant and accurate support or information.\nThis seamless interaction between the chatbot and the user enhances the overall user experience and improves efficiency in customer support.\nWho can Choose BotPenguin for WhatsApp Whitelabel Chatbot?\nEmbrace collaboration with BotPenguin's\nWhatsApp Whitelabel Chatbot\nand discover unique opportunities tailored to your expertise and interests.\nBloggers:\nDive into the world of intelligent chatbots and leverage BotPenguin to enrich your blog content. Educate your audience on the benefits and applications of WhatsApp Whitelabel Chatbots. As a blogger, you play a crucial role in fostering understanding and generating leads for this innovative solution.\nYouTubers:\nCraft engaging videos that showcase the functionalities and advantages of BotPenguin's WhatsApp Whitelabel Chatbot. Demonstrate how businesses can benefit from this cutting-edge technology, making your content a valuable resource for those exploring chatbot solutions.\nSaaS Influencers:\nPosition BotPenguin as a standout choice in the chatbot landscape. Share your insights on how this WhatsApp Whitelabel Chatbot stands apart, making it a preferred option for businesses seeking efficient and intelligent communication solutions.\nWeb Studios:\nBe a catalyst for change in the web development landscape by introducing your clients to BotPenguin's WhatsApp Whitelabel Chatbot. Strengthen your service offerings by providing clients with a powerful tool for enhancing user engagement on their websites.\nMarketing Freelancers:\nElevate your freelancing career by incorporating BotPenguin's WhatsApp Whitelabel Chatbot into your service offerings. Offer clients a trusted chatbot solution that streamlines interactions, providing them with a competitive edge in the market.\nCommunity Managers:\nBoost your community's digital presence by advocating for WhatsApp Whitelabel Chatbots. Position BotPenguin as a reliable and innovative solution for businesses looking to enhance customer engagement. Strengthen your community's connection with cutting-edge technology.\nWhy Choose BotPenguin for WhatsApp Whitelabel Chatbot Partnership?\nWith over a decade of experience building conversational AI solutions for global enterprises, BotPenguin is the platform of choice for creating customized\nWhatsApp chatbots\n.\nThe biggest value BotPenguin provides is making white-label WhatsApp bots with full branding alignment easily achievable for any business without technical complexity.\nIts intuitive bot builder allows you to tweak everything from welcome messages to dialog flows to guide the bot interactions. Configure color schemes, images, and logos so the look and feel resonate with your brand vibe.\nBotPenguin facilitates easy integration of your WhatsApp bot with internal tools like CRMs or CMSs using lightweight APIs for a unified system.\nSo, customer data remains synced in real-time across your support, sales, and marketing teams. Faster information access combined with the bot's 24/7 availability translates to prompt query resolution.\nStay on top of chatbot performance with BotPenguin's detailed analytics, which capture user messages, resolution rates, spikes, and more.\nThese actionable insights and one-click deployment across websites and apps make iteration and improvement continual.\nWhile startups benefit from preset industry-specific bot templates to quickly go to market, the granular customization power allows large enterprises to shape distinct conversational solutions at scale. High availability and security protocols maintain compliance standards.\nUndoubtedly, it is the leading choice for white-label WhatsApp chatbot success.\nHow To Get Started with BotPenguin's WhatsApp Whitelabel Chatbot?\nTo become a BotPenguin's WhatsApp Whitelabel Chatbot Partner, follow these steps:\nVisit the BotPenguin website: Start by opening your web browser and navigating to the\nBotPenguin\nwebsite. Simply search for \"BotPenguin\" and click on the appropriate search result.\nLook for the \"Partner\" tab:\nOnce on the BotPenguin website, navigate to the header section and look for the \"Partner\" tab. It is usually located near the top of the page.\nFind the Whitelabel Partner Option:\nYou will find various partnership options under the \"Partner\" tab. Look for the WhatsApp Whitelabel Partner option and click on it.\nClick the \"Become a Partner\" button:\nOn the Whitelabel Partner page, you will find a \"Become a Partner\" button. Click on this button to proceed with the partnership process.\nFill out the form:\nAfter clicking the \"Become a Partner\" button, you will be redirected to a form. Fill out all the necessary details in the form. This may include your name, email address, contact number, company information, and other required information.\nSubmit the form:\nOnce you have filled out all the necessary details in the form, click the submit button to send your partnership application to BotPenguin.\nWait for a response:\nAfter submitting the form, the BotPenguin team will review your application. They will get back to you within 24 hours to discuss the partnership further and provide more information.\nBecoming a partner with BotPenguin will give you access to their advanced chatbot technology and resources, allowing you to create and customize chatbots for your clients.\nThis partnership opportunity can help you expand your business and capitalize on the growing demand for chatbot solutions.\nBotPenguin's WhatsApp Whitelabel Chatbot Partner program offers you the chance to offer personalized chatbot solutions to your clients.\nDocument\nLaunch Your White Label WhatsApp Chatbot Platform\nUnder Your Brand in Less Than 12 Hours\nTry BotPenguin\nConclusion\nBotPenguin’s\nWhatsApp White Label Chatbot Program is a game-changer for businesses and individuals looking to offer cutting-edge AI chatbot solutions.\nWith features like tax configuration, add-ons, free trials, subscription plans, and unlimited sub-accounts, it empowers you to provide comprehensive and customizable chatbot services.\nLeveraging the power of ChatGPT integration and offering flexible pricing options ensures a wide reach and high customer satisfaction.\nThe quick onboarding process and extensive training support make it easy to get started and succeed. Partner with BotPenguin to tap into the growing demand for WhatsApp chatbots and elevate your business offerings.\nFrequently Asked Questions (FAQs)\nAre there any setup fees involved in getting a WhatsApp Whitelabel Chatbot with BotPenguin?\nNo, there are no setup fees involved. BotPenguin offers a hassle-free setup process for their WhatsApp Whitelabel Chatbot, allowing you to get started quickly and easily.\nDoes BotPenguin provide support and assistance during the implementation process?\nYes, BotPenguin offers comprehensive support and assistance during the implementation process. Their team of experts is readily available to guide you through every step and ensure a smooth integration with WhatsApp.\nIs the Whitelabel Chatbot compatible with multiple languages?\nYes, the Whitelabel Chatbot is compatible with multiple languages. BotPenguin's platform supports various languages, allowing you to cater to a diverse range of customers and provide a seamless experience in their preferred language.\nCan I integrate the Whitelabel Chatbot with other customer service tools?\nYes, you can integrate the Whitelabel Chatbot with other customer service tools. BotPenguin provides seamless integrations with popular tools like CRM systems, ticketing systems, and live chat platforms, enhancing your customer service capabilities.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\nTable of Contents\nWhat is BotPenguin’s WhatsApp Whitelabel Chatbot?\nWhat Are the Key Features of BotPenguin's WhatsApp Whitelabel Chatbot Partnership?\nBenefits of  BotPenguin’s WhatsApp White Label Chatbot Platform\nHow Does a WhatsApp Whitelabel Chatbot Partnership Work?\nWho can Choose BotPenguin for WhatsApp Whitelabel Chatbot?\nWhy Choose BotPenguin for WhatsApp Whitelabel Chatbot Partnership?\nHow To Get Started with BotPenguin's WhatsApp Whitelabel Chatbot?\nConclusion\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10773714631795883, -0.040727514773607254, 0.008334838785231113, 0.019319700077176094, 0.003209075191989541, -0.027526667341589928, 0.039658322930336, 0.051319289952516556, -0.02025705575942993, 0.018551364541053772, 0.023904956877231598, -0.009735445491969585, 0.027965618297457695, 0.02951512485742569, 0.10624737292528152, -0.006222599186003208, 0.11842763423919678, -0.0990205630660057, -0.0887032002210617, -0.03225863352417946, -0.020740823820233345, -0.009052835404872894, 0.04629029333591461, -0.025951702147722244, -0.028813106939196587, -0.029635312035679817, -0.03610352799296379, -0.024752551689743996, -0.015384919941425323, -0.042952392250299454, 0.009421403519809246, 0.019267849624156952, 0.028244858607649803, 0.07749916613101959, -0.039720628410577774, -0.06293880939483643, -0.0135525306686759, 0.013423732481896877, 0.10105212777853012, -0.05487675964832306, -0.08875754475593567, -0.07395900040864944, -0.054314691573381424, -0.009608007036149502, 0.10000398755073547, -0.013111839070916176, -0.06491225212812424, 0.010931302793323994, 0.023606542497873306, 0.07160424441099167, -0.10035685449838638, -0.04018440842628479, 0.04299832507967949, 0.07247499376535416, -0.03203246742486954, 0.05985553190112114, -0.032379504293203354, 0.014187198132276535, 0.07421498745679855, -0.003516441909596324, -0.04032464697957039, -0.036585260182619095, 0.0363241583108902, 0.038424257189035416, -0.018282564356923103, 0.03142561390995979, -0.11355069279670715, 0.00468148197978735, -0.006028642412275076, -0.036829873919487, -0.03265748545527458, -0.019597196951508522, -0.03882425278425217, 0.0427124984562397, 0.009090883657336235, -0.008295629173517227, 0.020447758957743645, -0.011480790562927723, 0.020672747865319252, -0.061479564756155014, -0.009230321273207664, 0.029879555106163025, -0.015827829018235207, 0.08428401499986649, -0.01785808801651001, -0.036355774849653244, 0.016331326216459274, 0.03207693248987198, -0.03161780536174774, 0.012757117860019207, 0.02511468157172203, 0.012682265602052212, -0.04379595071077347, 0.021526146680116653, 0.004434878937900066, 0.012081985361874104, -0.08858688175678253, -0.008585336618125439, -0.051459312438964844, 0.0007036940078251064, -0.0029809647239744663, -0.03917330503463745, -0.0264588613063097, -0.07301896810531616, -0.051037080585956573, 0.002465249737724662, 0.06698384881019592, 0.016775470227003098, 0.13779060542583466, 0.03535667061805725, -0.1049322783946991, -0.05151304602622986, -0.0030277350451797247, -0.019300784915685654, 0.02173064649105072, 0.002814855659380555, -0.026314498856663704, 0.050569068640470505, 0.14270269870758057, 0.01587156392633915, 0.08872678875923157, 0.054860327392816544, 0.007923796772956848, -0.004705493804067373, 0.0502498522400856, 0.04139319434762001, 0.0043116724118590355, 1.0819356534143877e-32, -0.03215829282999039, 0.05618429183959961, -0.03684611618518829, 0.07891722023487091, 0.021516624838113785, 0.012472369708120823, 0.018190890550613403, 0.04301773011684418, -0.06389113515615463, -0.038638703525066376, -0.10193882882595062, 0.11113756150007248, -0.08102346956729889, 0.05163102224469185, 0.02792266383767128, -0.0897277444601059, -0.021757641807198524, 0.025162624195218086, 0.06890414655208588, 0.002448351588100195, 0.08375559002161026, -0.033263444900512695, 0.04894057288765907, 0.07670069485902786, 0.12466742098331451, 0.04712982848286629, 0.09090784937143326, 0.01019342802464962, 0.049895137548446655, 0.0339890792965889, -0.07354775071144104, 0.01170267816632986, -0.04760827124118805, 0.014834702014923096, -0.04118877649307251, -0.04415327310562134, -0.06818921864032745, -0.09345255047082901, -0.07146507501602173, 0.06793996691703796, -0.1300787329673767, 0.011088033206760883, -0.12292762100696564, -0.07424766570329666, 0.024213988333940506, 0.008424313738942146, 0.011351005174219608, 0.02736525796353817, 0.0425557903945446, 0.03027905710041523, -0.04280102252960205, -0.012887788005173206, 0.039545632898807526, 0.06411294639110565, -0.0231858491897583, -0.023185016587376595, 0.024514826014637947, -0.06001822277903557, 0.011124588549137115, -0.026794884353876114, -0.040194351226091385, -0.03138941526412964, -0.035576917231082916, -0.019770758226513863, 0.032204870134592056, 0.0042554400861263275, 0.04258788377046585, 0.03808075562119484, 0.009406746365129948, 0.05290505662560463, 0.05651431903243065, 0.0451163686811924, -0.00015253658057190478, 0.019618989899754524, -0.03676888346672058, 0.015605115331709385, -0.08191076666116714, 0.03189308941364288, -0.05009106546640396, 0.00803870428353548, -0.018320588394999504, -0.006696289870887995, -0.010833688080310822, -0.03153863549232483, 0.07439202070236206, -0.028688987717032433, 0.021969446912407875, -0.032743826508522034, -0.040546517819166183, 0.045562777668237686, -0.04068269208073616, 0.06796368956565857, -0.050464823842048645, 0.08592246472835541, -0.05715059116482735, -7.756600125604653e-33, -0.04792111739516258, 0.010335386730730534, -0.03951317444443703, 0.07893849909305573, 0.009281245991587639, -0.03400050848722458, 0.0358235165476799, -0.022163044661283493, 0.10137610882520676, -0.005336115602403879, -0.0751044824719429, -0.013676479458808899, 0.006780500058084726, -0.025824129581451416, -0.007068014703691006, 0.02393108606338501, -0.045919712632894516, -0.04025381803512573, 0.002267113421112299, 0.0071676080115139484, -0.028313545510172844, 0.06938213109970093, -0.11858716607093811, 5.2450104703893885e-05, 0.008562302216887474, 0.0421605184674263, -0.07027845084667206, 0.0816015750169754, 0.026150641962885857, 0.014022584073245525, -0.015982070937752724, 0.015440481714904308, -0.02377907931804657, 0.005675823427736759, 0.025489922612905502, 0.042911265045404434, 0.006230226717889309, 0.005125059746205807, 0.001182088628411293, -0.05235310643911362, 0.09646774083375931, -0.046699993312358856, -0.07314910739660263, -0.07274755090475082, 0.010698126628994942, 0.0426868312060833, -0.1274670511484146, -0.024354364722967148, -0.07346963882446289, 0.0399504117667675, 0.06027957797050476, 0.015200694091618061, 0.03718094527721405, -0.050557248294353485, -0.09904204308986664, -0.04708082601428032, 0.08954630047082901, 0.030892174690961838, -0.07710321247577667, 0.030413461849093437, 0.03994985669851303, 0.010707930661737919, 0.06310300529003143, 0.06957739591598511, 0.042692866176366806, -0.013233025558292866, 0.08255841583013535, 0.03971784934401512, -0.013593675568699837, -0.08851329237222672, 0.052293941378593445, -0.05074874684214592, -0.03216072916984558, 0.006531929597258568, -0.0003258062060922384, 0.087242491543293, 0.028677165508270264, -0.11251065135002136, -0.0043865288607776165, -0.006276468746364117, -0.04243289306759834, 0.0028543095104396343, 0.06665456295013428, 0.026527319103479385, -0.07335799187421799, 0.04328164830803871, -0.042990729212760925, 0.006100017111748457, 0.0021899600978940725, 0.006398533470928669, -0.0900704488158226, 0.021381482481956482, -0.03421539068222046, 0.0862685814499855, -0.0006450907094404101, -5.962171911733094e-08, -0.04284767061471939, -0.005459139123558998, 0.057861652225255966, 0.06511335074901581, 0.03767426684498787, -0.025006821379065514, -0.031014133244752884, 0.08261716365814209, 0.050137486308813095, 0.016895467415452003, 0.010256514884531498, -0.03925488889217377, -0.054756782948970795, 0.08727582544088364, 0.04214567318558693, -0.02864517830312252, -0.014226716943085194, -0.030812904238700867, 0.016894789412617683, -0.03753356263041496, 0.06503824889659882, 0.035240694880485535, -0.002763534663245082, -0.02640843205153942, 0.03910333663225174, -0.10285661369562149, -0.024220841005444527, 0.08894867449998856, -0.04643416404724121, -0.018909836187958717, -0.04415682703256607, -0.046044547110795975, 0.07249432802200317, -0.04127554967999458, 0.0035732723772525787, -0.0025877910666167736, -0.06409505009651184, -0.08232728391885757, 0.007809846196323633, 0.05290103703737259, 0.02021523378789425, 0.04577385634183884, 0.02414451353251934, -0.10850714147090912, -0.04147977754473686, -0.062081072479486465, -0.08082910627126694, -0.10146298259496689, 0.04756415635347366, 0.019394908100366592, -0.036272428929805756, 0.006006470415741205, 0.04279038682579994, 0.037353139370679855, 0.05979035794734955, -0.011410257779061794, 0.06694372743368149, -0.01687653362751007, 0.09089911729097366, 0.11304601281881332, 0.03844518959522247, 0.045607730746269226, 0.021242644637823105, 0.024122029542922974]}