{"file_name": "botpenguin.com_chatbot-use-cases_customer-service-chatbot", "text": "URL: https://botpenguin.com/chatbot-use-cases/customer-service-chatbot\nCustomer Service Chatbot | Customer Support Chatbot\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nOffer automated help 24/7 with a\nCustomer Service Chatbot\nUse the generative AI-driven support bot to answer common questions, live chat with customers, create tickets in existing\nsystem, & send files or docs to save their time and reduce your manual effort.\nGet Started FREE\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nNo More Waiting. No Queues. Just\nInstant Query Redressal.\nBuild better customer relationships with round-the-clock support integrated with your helpdesk solutions.\nHelp your customers on every touchpoint with ChatGPT-driven customer service.\nLet AI Answer Your FAQs\nAnswer repetitive questions with By training your generative AI chatbot on your knowledge base.\nLive Chat for Complex Issues\nLet our AI chatbot handle your customer queries effortlessly. And if the going gets tough, just hop into a live chat and talk directly to your customers.\nRoute Chats To Live Chat Agent\nLeave no user dissatisfied. Route the critical chats to your live chat so an agent can help your customers better. Choose human handover when your AI needs a break.\nOnboard Your Support Team\nEmpower your support team to work alongside the chatbots. Assign roles, manage access, & collaborate efficiently to deliver exceptional customer service.\nIntegrate With the Ticketing System\nConnect BotPenguin's chatbots with your existing ticketing system to streamline customer support and track and manage customer inquiries efficiently.\nFile Upload\nShare files with your customers & save them time. Send videos, images, PDFs, docs, or any resource when words aren’t enough to help.\nProvide 24*7 Customer Support\nNo brakes on the support train. Keep the customer support going through the live chat from a mobile device, anywhere and anytime.\nUnified Customer Profile\nAutomatically collect & manage customer info such as page history, location, device, email, socials, phone number, etc., letting agents view the complete user profile.\nSave Time with Quick Replies\nToo many boring, bland questions? Use our quick replies to help them out! Provide instant answers with just a click.\nSet Fallback Response\nDeal with unexpected scenarios smartly. Set up automated messages for unknown or offensive inputs. Or you can also trigger a fresh chatflow.\nGet Started\nFREE\nEnhance your Customer Support Team with\nGenerative AI Services\nSupport your customers through generative AI chatbots trained on your resources to answer complex queries, recognize\nintent & reply empathically, and create tickets automatically for time-saving solutions.\nMulti-Turn Conversation Handling\nThe customer support AI bot can learn from chat history and treat the customer accordingly. No need for customers to repeat themselves.\nGet Feedback & Understand Sentiment\nYour customer service chatbot can collect customer feedback in chat and analyze it to identify areas for improvement.\nAnswer Suggestions\nThe chatbot can help agents during live chat by suggesting real-time answers to customers' queries, thus speeding up all resolution processes.\nAccept Images and Documents\nGenerative AI chatbots can analyze & process images or documents users share, extracting relevant information or assisting with document-related queries.\nNo-Code Integration With ChatGPT\nMarry your customer service chatbot with ChatGPT for instant and accurate responses. Elevate your support game with every interaction.\nSet a Helpful Tone\nGive your caring voice to your customer service chatbot. Let it help customers on your behalf and leave a good impression on their minds.\nTrain Virtual Agent on Your Data\nEasily prep your chatbot on FAQs, URLs, documents and chat history to equip it with comprehensive knowledge for accurate answers.\nDeploy a Customer Service Chatbot:\nSave Time, Money, & Effort\nBotPenguin’s generative AI bot makes every chat count.Offering world-class customer service at lightning speeds.\nIt save your agents effort & time with support automation, letting your focus on complex issues.\nA Chatbot in Time Saves Nine\nLet the AI chatbot take care of routine queries 24/7 & save your agents a ton of time.\nAutomate & Sitback\nTime to relax & let the chatbot create tickets, route chats, solve FAQs, & more. Drive your support operations in autopilot mode.\nImprove Customer Support Team Productivity\nDeploy chat routing that elevates your customers and increases team productivity.\nCost-Effective\nReduce your support costs, manual workload, and acquisition costs, and save time all in one go.\nClass-Leading Customer Experience\nInstant and reliable support that works wonders from day one. Try it and see it with our customer service chatbot platform!\nBoost Revenue\nKeep your audience engaged, which leads to satisfied customers and higher sales.\nLet Customer Service Chatbots Render Omnichannel Support\nThrough a single integrated interface, our customer service chatbot can assist your company in providing\ncustomer service, gathering feedback and fostering client trust across all channels.\nAnswer Queries to Your Website Visitors\nNever let your website visitors go unanswered. Help your visitors with their common queries & engage them routinely with our AI customer service chatbot.\nConnect with Facebook Users\nHelp your customers with automated DMs, comment replies, bulk messages, and FAQ resolutions using our customer service chatbot.\nSolve Issues on WhatsApp\nTroubleshooting couldn't get any more user-friendly. Help your customers on whatsapp and keep the confusion at bay with BotPenguin.\nTelegram With BotPenguin\nAssist your customers on Telegram and prevent miscommunication. Keep it more customer-friendly, yeah?\nHelp Users on Instagram\nProvide timely help to your customers on Instagram. Reply to FAQs, share resource links, or connect with a live agent.\nSupport Members on Microsoft Teams\nOur MS Teams integration lets you effortlessly manage tickets, assign tasks, and organize meetings within the Teams interface.\nConnect Your Customer Service Chatbot With Key Integrations\nReduce your manual effort & organize every aspect of your support system. Get no-code integrations, including ChatGPT, CRMs, CMS, Ticketing Systems, and more.\nGet Started FREE\nWhatsApp Automation: A wand in the hands of Marketers\nCreate a complete marketing funnel for your business. Create an end to end all in one customer experience\nfor your WhatsApp customers with the help of whatsapp automation.\nHelpdesk Integration\nEffortlessly manage support with Freshdesk, Zoho Desk, & Zendesk. Streamline processes for quicker resolutions & happier customers.\nCRM Integration\nIntegrate with GoHighLevel, Hubspot, Zoho, Salesforce, and other CRMs for comprehensive customer data management.\nIntegration with Your Support System\nGot a custom solution managing your customer service? Don’t worry! Our chatbot can easily integrate with your existing apps.\nAppointment Booking\nSimplify scheduling processes with seamless integration to platforms like Simplybook, Google Calendar, & Calendly.\nCMS Platforms\nEnhance customer experience on WordPress, Squarespace, and Wix. Save their time with instant answers & navigation support.\nE-commerce Integrations\nStreamline operations on Shopify, WooCommerce, and moreetc, providing real-time customer support, return/refunds, product catalogs, order tracking, & more.\nPabbly & Zapier\nConnect your customer service chatbot with over 1000 apps and automate workflows for enhanced productivity and efficiency.\nOur Customer Service Chatbot Speaks\nYour Customer’s Language\nLocalization is a piece of cake with BotPenguin Our generative AI chatbot understands your customers’ language and translates the text automatically, providing a world-class support experience in a language of your customer’s choice.\nGet Started FREE\nGet Data Insights for Laser-Focused\nCustomer Service Chatbot\nAdapt a data-driven approach and make decisions better than GPS telling you to turn left into a lake.\nRecurring Questions\nRecord the recurring and complex questions and prepare answers for them. Feed answers to your NLP chatbots and leave no stone unturned to ensure optimum care.\nBot-Wise Analytics\nAnalyze the performance of each chatbot platform to determine which one is more effective at resolving customer issues and generating leads.\nGive Your Shoppers a Personalized Support Experience\nwith Customer Service Chatbot\nRun your eCommerce services like a well-oiled machine with our ChatGPT- driven support\nchatbot managing your lost sales, order updates, delivery tracking, & returns.\nShow Product Catalogs\nSend your product catalogs in chat and help customers save their time by selecting products in chat.\nAbandoned Cart Recovery\nEngage the customers who abandon their shopping carts, offering assistance & incentives to encourage purchase completion.\nOrder Confirmation & Fulfillment\nProvide instant order confirmation to customers, update them on order status, & ensure smooth order fulfillment.\nReturn/Exchange Request\nAutomate handling returns & exchanges with chatbots & avoid disputes with customers.\nOrder Tracking\nLet customers easily track their orders, providing real-time updates and ensuring a transparent delivery process.\nMake Healthcare More Accessible with\na Health Service Chatbot\nCure your healthcare system of long cues, length forms, and hectic appointments.\nEase everything with BotPenguin’s Healthcare support chatbot.\n24/7 Medical Support\nInstant access to medical information and round-the-clock support for quick responses to health queries and concerns.\nSymptom Checker & Medical Advice\nAI analyzes symptoms for accurate advice, empowering users to make informed health decisions promptly.\nAppointment Scheduling\nAllow users to book appointments seamlessly, reducing wait times and improving efficiency in healthcare access and management.\nMedication Reminders\nAutomated reminders for medication adherence and treatment plans ensure users stay on track with their prescribed regimens.\nHealth Records Access\nConvenient and secure access to medical records, test results, and appointment history for healthcare information management.\nTelemedicine Integration\nConnect users to virtual consultations and remote healthcare services for accessible healthcare delivery and remote support.\nAdd a Customer Service Chatbot for\nYour Educational Institution\nCure your healthcare system of long cues, length forms, and hectic appointments.\nEase everything with BotPenguin’s Healthcare support chatbot.\nAnswer Students Questions\nLet your ChatGPT chatbot answer students’ queries for courses, seat availability, fee structures, or any other general query.\nEfficient Admission Process\nStudents can save time & complete application tasks through chat by entering their details, uploading files, & paying for their respective course.\nSpeedy Consultations with Live Chat\nEnable students to connect with a live agent and get solutions to their queries. Comfort parents & students with a human touch.\nSchedule Classes\nAssist your students to book classes effortlessly through the chat interface & receive regular reminders for classes.\nPersonalized Learning Experience\nEnhance student learning through a chatbot that offers tutorials, PDF guides, infographics, notes, & more based on individual needs.\nAttendance Management\nAutomate attendance tracking and monitor student engagement through the support chatbot. Share the attendance report to improve student participation.\nWe Help You Support Your Business\nin Every Industry\nFit your customer service chatbot to any business you choose. Automate your support and\nreduce the load from your agents. Solve queries like it's magic!\nEcommerce Support Chatbot\nHelp shoppers with instant support, product queries, product catalog, order tracking, return & refund processing, and more with an eCommerce customer service chatbot.\nHealth Support Chatbot\nThe Healthcare service chatbot streamlines appointment scheduling, symptom checking, clears medical bills, & sends prescriptions.\nEducation Support Chatbot\nOffers course information, enrollment assistance, class booking, payments & FAQ support to ensure students' smooth learning experiences with a customer service chatbot for education.\nSaas Support Chatbot\nEnsure uninterrupted SaaS operations with customer service chatbot. Assist users in technical troubleshooting, product demos, and more.\nInsurance Support Chatbot\nThe customer service chatbot for the insurance industry streamlines claims processing, shares policy details, & assists with coverage inquiries.\nTravel Support Chatbot\nOffer hassle-free journeys with a customer service chatbot for solving flight & hotel queries, flight bookings, itinerary updates, travel alerts and notifications, and local recommendations.\nRestaurant Support Chatbot\nProvide automated reservations, menu inquiries, take orders, track food delivery, and show order recommendations.\nFintech Support Chatbot\nDeploy your Fintech bot to handle transactions, send stock alerts & reports, provide investment advice, and tackle financial queries.\nFrequently Asked Questions\nWhat is ChatGPT customer support?\nChatGPT customer support leverages generative AI to enhance assistance. It enables 24/7 support, quick answers, and personalized interactions, ensuring efficient and cutting-edge customer service.\nWhat are the best customer service chatbots?\nUsing BotPenguin, you can create the best customer service chatbots driven by ChatGPT. Our generative AI-powered chatbots excel in answering queries, creating tickets, and providing instant support. Elevate your customer service experience effortlessly.\nWhat is the best AI for customer service?\nBotPenguin stands out as the best AI for customer service, integrating generative AI with a user-friendly interface. It provides efficient, automated support, boosting customer satisfaction and saving costs.\nHow to train ChatGPT for customer support?\nYou can create a ChatGPT-Integrated customer service chatbot with BotPenguin. Use custom datasets, FAQs, and conversation context to enhance the AI's ability to respond empathetically and effectively.\nHow do you use generative AI in customer support?\nBotPenguin is packed with generative AI features that are perfect for a customer service chatbot. You can train your chatbot on website data, custom datasets, and FAQs for personalized, context-aware responses, ensuring a seamless customer experience.\nAre You Ready to Transform Your Customer’s\nSupport Experience?\nBook a demo\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.10880487412214279, -0.07465725392103195, 0.0313735157251358, -0.0006203572847880423, -0.01139494776725769, -0.04257902875542641, 0.042020533233881, 0.06425213813781738, 0.002981659257784486, 0.01555728167295456, 0.05199052393436432, -0.009323922917246819, 0.010596154257655144, 0.02666175737977028, 0.12980347871780396, -0.014049636200070381, 0.11807987838983536, -0.10835372656583786, -0.08911594748497009, -0.013339241035282612, -0.0323176346719265, -0.019853392615914345, 0.02664446271955967, -0.03280068188905716, -0.04307076334953308, -0.04990878328680992, -0.027058837935328484, -0.014676276594400406, -0.029523732140660286, -0.07299574464559555, -0.0018299755174666643, 0.028172137215733528, 0.011306419037282467, 0.05354258790612221, -0.014685074798762798, -0.045280821621418, -0.03475506976246834, 0.01915513537824154, 0.0854860246181488, -0.04539823532104492, -0.07920163869857788, -0.08854510635137558, -0.06451012194156647, -0.009534218348562717, 0.09298048913478851, -0.016236836090683937, -0.06166750192642212, 0.015256773680448532, 0.020108003169298172, 0.090944305062294, -0.08733249455690384, -0.0380883663892746, 0.04611128196120262, 0.06444378942251205, -0.046164143830537796, 0.03373100236058235, -0.014537193812429905, 0.023514816537499428, 0.03927821293473244, -0.00989008042961359, -0.051711469888687134, -0.007257914636284113, 0.053281236439943314, 0.033649902790784836, -0.035571493208408356, 0.03513922914862633, -0.12373634427785873, -0.0022834117989987135, -0.003633348271250725, -0.03530936688184738, -0.015395722351968288, -0.012405158020555973, -0.04478879272937775, 0.06124669313430786, 0.00567594775930047, -0.01866333931684494, 0.01566721498966217, -0.0006951035466045141, 0.028021274134516716, -0.06290363520383835, -0.034462157636880875, 0.031428638845682144, 0.0009167968528345227, 0.05617673322558403, -0.039651840925216675, -0.023237187415361404, -0.0016892716521397233, 0.02671501599252224, -0.023002611473202705, 0.0044698938727378845, 0.04173094406723976, 0.009313064627349377, 0.01276072021573782, 0.012635580264031887, 0.02608429081737995, 0.011725564487278461, -0.057443633675575256, 0.018046142533421516, -0.05877342447638512, -0.013061713427305222, 0.0003862710145767778, -0.03285672143101692, -0.04873030632734299, -0.078400157392025, -0.04124686121940613, 0.010773678310215473, 0.057913146913051605, -0.01615699753165245, 0.1271449774503708, 0.011153790168464184, -0.12018566578626633, -0.07239997386932373, -0.00236296933144331, -0.019471053034067154, 0.006216972600668669, 0.019051268696784973, -0.03401009738445282, 0.05812495946884155, 0.13826881349086761, 0.02454354800283909, 0.06660498678684235, 0.06505157053470612, 0.011366854421794415, -0.013042661361396313, 0.06052267551422119, 0.039228469133377075, 0.003831199835985899, 1.1942831586522432e-32, -0.0464959554374218, 0.03837757930159569, -0.05313340947031975, 0.09176424145698547, 0.04286200553178787, 0.01782100833952427, 0.014530160464346409, 0.051946673542261124, -0.06128067150712013, -0.0332319438457489, -0.10428804159164429, 0.09863151609897614, -0.06446002423763275, 0.025299187749624252, 0.015706881880760193, -0.07574870437383652, -0.016233189031481743, 0.01298900693655014, 0.04077167436480522, 0.007469280622899532, 0.08330762386322021, -0.029689399525523186, 0.05848987400531769, 0.09010639041662216, 0.11624927073717117, 0.030202753841876984, 0.08323686569929123, 0.021630380302667618, 0.06140649691224098, 0.033910077065229416, -0.08392808586359024, 0.004003879614174366, -0.05128121003508568, 0.02403988130390644, -0.03933675214648247, -0.03295107185840607, -0.05080210417509079, -0.10462001711130142, -0.07874951511621475, 0.0411592535674572, -0.14221298694610596, 0.005917789414525032, -0.10658121854066849, -0.0705709308385849, 0.026083404198288918, 0.0031540137715637684, 0.024583108723163605, 0.02235136367380619, 0.028964994475245476, 0.03854988515377045, -0.046102192252874374, 0.023732004687190056, 0.02378806471824646, 0.06714212894439697, -0.014180231839418411, -0.04732964560389519, 0.035620544105768204, -0.04988894239068031, 0.0011259994935244322, -0.04253049194812775, -0.011860677972435951, -0.04924197494983673, -0.010940113104879856, -0.02104821614921093, 0.05149020254611969, 0.01103635411709547, 0.0530119314789772, 0.014089599251747131, 0.015278414823114872, 0.03208372741937637, 0.05011240020394325, 0.05234832316637039, -0.002643372630700469, 0.02828613668680191, -0.05044914782047272, 0.011091056279838085, -0.10018091648817062, 0.034863874316215515, -0.033697158098220825, 0.00146833888720721, -0.025536445900797844, -0.012049814686179161, -0.013206742703914642, -0.03078811801970005, 0.0756242647767067, -0.038358088582754135, 0.027942543849349022, -0.03438681364059448, -0.028246629983186722, 0.04473895579576492, -0.04044349491596222, 0.09524824470281601, -0.06369318813085556, 0.08603521436452866, -0.033154770731925964, -9.413479984239807e-33, -0.05173484981060028, 0.01814758963882923, -0.046509984880685806, 0.08177957683801651, 0.009075821377336979, -0.03436526656150818, 0.023523064330220222, -0.04034867137670517, 0.1066787838935852, -0.0031424961052834988, -0.10150952637195587, -0.010169892571866512, 0.0100155184045434, -0.035960402339696884, -0.017205368727445602, 0.037155114114284515, -0.05891073867678642, -0.04095365107059479, 0.019034219905734062, 0.004598177038133144, -0.027617227286100388, 0.056859090924263, -0.10740498453378677, 0.017090024426579475, 0.0005998667911626399, 0.04799313470721245, -0.07615181803703308, 0.05463307350873947, 0.018294714391231537, 0.013287781737744808, -0.012532103806734085, -0.0027962117455899715, -0.027934333309531212, 0.0012727943249046803, 0.023077072575688362, 0.053915031254291534, 0.019731663167476654, 0.0035911656450480223, -0.008552724495530128, -0.0521698035299778, 0.10097803175449371, -0.06205778196454048, -0.04226675257086754, -0.07468905299901962, -0.003893829183652997, 0.017702527344226837, -0.12649138271808624, -0.05237838253378868, -0.061940498650074005, 0.038539446890354156, 0.043063946068286896, -0.007103129755705595, 0.050248757004737854, -0.03553824499249458, -0.08938443660736084, -0.028714681044220924, 0.10507586598396301, 0.021385401487350464, -0.09304564446210861, 0.015941232442855835, 0.05297670513391495, 0.007189646363258362, 0.07240919023752213, 0.07020481675863266, 0.04018033295869827, -0.016687192022800446, 0.07693008333444595, 0.04285196214914322, 0.0013683885335922241, -0.09539608657360077, 0.04056696966290474, -0.05981852859258652, -0.010659458115696907, 0.00786115787923336, 0.02044704556465149, 0.08339254558086395, 0.03521016612648964, -0.11496322602033615, -0.0018297500209882855, -0.027429908514022827, -0.04379967600107193, -0.014192930422723293, 0.055263012647628784, 0.04070224240422249, -0.0918596088886261, 0.05513518676161766, -0.018192162737250328, 0.009173247963190079, -0.004257624503225088, 0.009394029155373573, -0.05867139995098114, 0.015473444014787674, -0.02602308988571167, 0.09675640612840652, 0.013621201738715172, -6.002475316790878e-08, -0.02880685217678547, -0.013418496586382389, 0.050592657178640366, 0.042613450437784195, 0.039650462567806244, -0.061339154839515686, -0.045661818236112595, 0.09351436793804169, 0.02105301059782505, 0.03682993724942207, 0.01348625123500824, -0.02126539871096611, -0.05630873888731003, 0.07400776445865631, 0.07204270362854004, -0.00838862918317318, -0.0229500662535429, -0.02300015278160572, 0.01015360839664936, -0.033016305416822433, 0.05858268588781357, 0.02377857081592083, -0.016024213284254074, -0.03213026747107506, 0.021396847441792488, -0.05616389587521553, -0.049541980028152466, 0.08349408954381943, -0.045848678797483444, -0.028268346562981606, -0.03617168590426445, -0.03615162894129753, 0.06502605229616165, -0.041124798357486725, 0.0049856603145599365, -0.006699837278574705, -0.0769365206360817, -0.08070883899927139, 0.013624104671180248, 0.053694527596235275, 0.01767730712890625, 0.02926512062549591, 0.017249176278710365, -0.0915149673819542, -0.010740791447460651, -0.05031554400920868, -0.07289030402898788, -0.10076996684074402, 0.038090016692876816, 0.004216650500893593, -0.061648014932870865, 0.014124752953648567, 0.06068364158272743, 0.05033526197075844, 0.07866131514310837, -0.008656850084662437, 0.07014095783233643, -0.0029903720133006573, 0.10193053632974625, 0.11059759557247162, 0.026216067373752594, 0.032049987465143204, 0.03799111768603325, 0.012873129919171333]}