{"file_name": "botpenguin.com_glossary_affiliate-marketing", "text": "URL: https://botpenguin.com/glossary/affiliate-marketing\nAffiliate Marketing: Significance, Types & Benefits | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGLOSSARY\nAffiliate Marketing\nTable of Contents\nWhat is Affiliate Marketing?\nWhy should you do Affiliate Marketing?\nWhen to do Affiliate Marketing?\nWhere is Affiliate Marketing done?\nWho Benefits from Affiliate Marketing?\nAffiliate Marketing Terms\nHow Does Affiliate Marketing Work?\nHow to Become an Affiliate Marketer?\nBotPenguin’s Affiliate Marketing Program\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nWhat is Affiliate Marketing?\nImagine if each time you recommended a cafe to a friend, and they decided to visit for a cup of coffee, the cafe owner handed you a small 'thank you' discount or cash! Affiliate Marketing works on a very similar principle.\nAffiliate Marketing, in essence, is about promoting someone's business for a reward. It involves an individual (let's call them an affiliate) teaming up with a company for marketing their products or services.\nWhat's in it for the affiliate, you wonder? Well, for every purchase made via a unique link provided by the company, affiliates receive a piece of the profit- also known as a commission.\nPut simply, being an affiliate means leveraging your audience to sell products or services for a business.\nThe avenues for it? The options are quite diverse: blog posts, YouTube videos, Instagram stories, or even engaging podcasts.\nYou earn a particular 'cut' or percentage from the sale when someone makes a purchase using your custom affiliate link.\nCommission forms the heart of\nAffiliate Marketing\n- it's literally the 'paycheck' for your promotional efforts.\nThe commission structure varies across different programs, but it's typically a chunk of the total sale that the business makes through your affiliate link.\nWhat are Affiliate Marketing Programs?\nAffiliate Marketing Programs are like the rulebook of a sport - designed by businesses to outline the 'how-tos' of the\naffiliate marketing\ngame they curated.\nThe program helps affiliates by providing all the necessary details, such as the commission structure, the terms of collaboration, and promotional resources like affiliate links.\nDive-Deeper into the world of Affiliate Marketing with Us!\nBecome a Partner\nWhy should you do Affiliate Marketing?\nCurious why Affiliate Marketing is an amazing prospect? Let's see the benefits it offers.\nEarnings 24X7\nWith\nAffiliate Marketing\n, you could be earning while catching up on some sleep or binge-watching your favorite series.\nEssentially, once your promotional content, like a well-crafted blog post or a detailed YouTube tutorial, grabs attention and traffic, it could rake in regular commissions over time.\nMinimal Starting Expenses\nAffiliate Marketing doesn't demand you to hit high startup costs. Instead, create engaging, relatable content using your time and dedication without worrying about initial product creation or financial investment.\nNo Troublesome Customer Support\nRemember the times when dealing with customer complaints made you want to pull your hair out?\nWave those annoying after-sales services goodbye. Once a purchase is made through your affiliate link, the company offering the product handles customer grievances while you bask in your commission.\nWork on the Go\nAffiliate Marketing\ngives you the liberty to work from anywhere. All you need is to be hooked on a stable internet connection, making it perfect for digital nomads and those who yearn for flexibility in their work location.\nWhen to do Affiliate Marketing?\nUnderstanding when to dive into affiliate marketing requires keeping some vital checkpoints in mind.\nBuilding a Trustworthy Online Identity\nThe first step towards becoming a successful affiliate is to build a platform where your audience trusts your reviews and recommendations.\nWhether it's a thoughtfully written blog, an engaging YouTube channel, an informative podcast, or an insightful email newsletter - think of it as your foundation.\nGaining Sufficient Traffic\nTo capitalize on\naffiliate marketing\n, you need an audience. Try to ensure a steady flow of traffic on your platform. The more your affiliate product is seen, the higher the likelihood of earning a good commission.\nKnow Your Product\nSuccessful promotion is often driven by\npersonal experience\nand conviction about the product you're touting. Understanding its worth makes it easier to confidently promote it to others.\nChoosing a Reliable Affiliate Program\nAn effective\naffiliate program\noffers an attractive commission rate, reliable tracking of your sales, and a range of resources to assist you along your journey.\nWhere is Affiliate Marketing done?\nDifferent platforms offer various ways to engage in successful\naffiliate marketing\n.\nBlogs\nCelebrate your flair for writing and connect with readers by writing comprehensive product reviews or creating step-by-step tutorials on a blog.\nYouTube Channels\nIf working with video content is your strength, developing a YouTube channel is an excellent idea. Unboxing videos, reviews, or detailed tutorials can become interesting promotional content.\nEmail Marketing\nEmail newsletters present an opportunity for direct,\npersonalized communication\nwith your interested subscribers, making\naffiliate product\npromotion effective.\nSocial Media Platforms\nWhether it's Instagram, Twitter, or Facebook, utilizing social media platforms, where each follower is a potential customer, can be a smart approach to promoting products and driving traffic to your affiliate links.\nWho Benefits from Affiliate Marketing?\nEvaluating the types of people and companies that benefit from affiliate marketing.\nBloggers\nFor bloggers,\naffiliate marketing\noffers an avenue to generate passive income from their blog posts. It's an ideal monetization strategy as it doesn't interrupt the user experience with intrusive ads.\nCompanies\nThrough their affiliate programs, companies get more visibility for their products and only pay when a sale is made. This makes affiliate marketing a low-risk and cost-effective form of advertising.\nOnline Course Creators\nOnline course creators use\naffiliate marketing\nto increase sales of their courses. They recruit affiliates to promote their courses and in return, offer them a cut from each sale.\nSocial Media Influencers\nSocial media influencers use their strong online presence to earn money through affiliate marketing. They promote products to their large followers base and earn a commission for every sale made.\nAffiliate Marketing Terms\nHer are some common terms that are used frequently in affiliate marketing.\nAffiliate Link\nThis is a unique URL that tracks the traffic you send to the company's website. This link is used to credit you for each successfully referred sale.\nClick-Through Rate (CTR)\nThis is the percentage of your audience that clicks on your affiliate links.\nConversion Rate\nThis refers to the percentage of people who click your affiliate link and make a purchase.\nCost Per Action (CPA)\nThis refers to the amount you earn each time a visitor takes a specific action through your affiliate link. This could be a purchase, a sign-up, etc.\nAbsolutely. Here are an additional eight terms often used in\naffiliate marketing\n:\nCookie Duration\nThis refers to the period during which your affiliate link can earn you commissions after a user clicks on it. The duration varies from one\naffiliate program\nto another and can range from a single day to several months.\nReturn Days\nSimilar to cookie duration, return days refers to the number of days a customer has to return to the seller's website and make a purchase, allowing the affiliate to still earn a commission.\nTwo-Tier Affiliate Marketing\nIn this model, affiliates earn commissions on their conversions as well as a percentage of commissions from other affiliates they referred to the program.\nAffiliate Network\nThis is a group of associated companies that often offer related or complementary products and commonly run their\naffiliate programs\nthrough the same platform.\nCommission Rate\nThis is the percentage or fixed amount that an affiliate earns from each sale made through their affiliate link.\nPayment Threshold\nThis is the minimum amount an affiliate must earn in commissions before they can withdraw their earnings.\nPay Per Click (PPC)\nThis is an\naffiliate marketing strategy\nwhere the affiliate earns a commission each time a user clicks on their affiliate link, regardless of whether a sale is made.\nPayout\nThis refers to the payment an affiliate receives after accruing a set amount of earned commissions.\nHow Does Affiliate Marketing Work?\nIn this section, we will explore the mechanics behind the functioning of affiliate marketing and its various components.\nEstablishing Partnerships\nTo begin with,\naffiliates partner\nwith businesses or entrepreneurs who wish to promote their products or services.\nThese businesses provide the affiliates with a unique tracking link, which they use to direct potential customers to the business's website.\nCreating Engaging Content\nAffiliates create informative and engaging content, such as blog posts, videos, or social media posts, to attract an audience.\nWithin this content, they incorporate their unique affiliate link, which leads the audience to the promoted products.\nDriving Traffic towards Affiliate Content\nThe next step for\naffiliates\nis to drive traffic towards their content. They accomplish this by leveraging SEO techniques,\nsocial media marketing\n, email campaigns, and other forms of advertising.\nThey aim to reach a wide audience interested in the specific niche the affiliate is promoting.\nEncouraging Conversions\nAffiliates\nuse persuasive content and skillful placement of their affiliate links to entice the audience to click on them and make a purchase.\nThis often includes well-placed calls-to-action and providing valuable content that showcases the benefits of the promoted product or service.\nEarning Commissions\nLastly, when a visitor clicks on an affiliate link and completes a desired action (such as making a purchase), the affiliate earns a commission.\nThe earnings can vary depending on factors like the product's price, the commission rate set by the business, and the total number of successful conversions.\nHow to Become an Affiliate Marketer?\nIn this section, we'll cover the necessary steps and best practices to become a successful\naffiliate marketer\n.\nChoose Your Niche\nIdentify your area of interest or expertise. A niche allows you to focus on a specific market and build a strong, loyal audience.\nResearch Affiliate Programs\nInvestigate various\naffiliate programs\nand networks that align with your niche. Look for programs offering competitive commissions, quality products, and reliable support.\nCreate Quality Content\nProduce valuable, informative, and engaging content tailored to your target audience. Diversify your content types, such as blog articles, videos, podcasts, or social media posts, to reach and engage a broader audience.\nSet Up Your Website or Blog\nBuild a professional-looking website or blog that serves as a central hub for your content and\naffiliate links\n. Optimize your site for search engines (SEO) to drive organic traffic to your content.\nEstablish an Online Presence\nCreate profiles on popular social media platforms and engage with your audience. Share your content, join relevant groups, and participate in discussions to extend your reach and grow your following.\nDevelop Email Marketing Strategy\nCapture your visitors' email addresses and nurture relationships with them through email marketing campaigns. Provide useful information and occasional promotions to keep subscribers interested and engaged.\nLearn from Experts and Peers\nJoin online communities, attend webinars, or participate in courses to learn from successful\naffiliate marketers\nand stay updated on industry trends.\nMonitor and Analyze Performance\nRegularly analyze the performance of your content, website, and affiliate links. Use tools like\nGoogle Analytics\nto keep track of traffic, conversions, and revenue to identify areas for improvement.\nAdapt and Optimize\nRefine your content, website, and marketing strategies based on the data you gather. Continuously learn and grow your skills to improve your performance and achieve better results.\nBe Persistent and Patient\nAffiliate marketing\nsuccess doesn't happen overnight. Be prepared to invest time and effort into creating quality content, building an audience, and refining your strategies to see significant results.\nBotPenguin’s Affiliate Marketing Program\nThe\nbest affiliate marketing program\ncan vary depending on individual needs and preferences.\nHowever, a popular and highly regarded program is BotPenguin.\nBotPenguin offers a comprehensive and user-friendly Chatbot building platform.\nWith a strong tracking and reporting system, affiliates can accurately monitor their performance and earnings.\nBotPenguin also provides various resources and support to help affiliates succeed, including marketing materials, training, and prompt commission payouts.\nWhether new to\naffiliate marketing\nor an experienced marketer, BotPenguin offers a reliable and rewarding program to maximize your earnings and grow your online business. Try it out!\nEarn Your 1st Affiliate Commision with\nBotPenguin's Affiliate Partnership Program\nJoin Hands with BotPenguin\nFrequently Asked Questions (FAQs)\nHow much money can you make as an affiliate marketer?\nThe amount of money you can make through affiliate marketing varies greatly and depends on numerous factors such as your audience size, niche, commission rate, and conversion rate.\nHow do I become an affiliate marketer with no money?\nYou can start affiliate marketing with no money by creating a free blog or YouTube channel, producing quality content, and using free online marketing techniques to drive traffic.\nHow long does it take to make money with affiliate marketing?\nWhile some affiliates see success early, for many it takes significant time and effort. Factors such as your marketing strategy, niche, audience size, and quality of content play critical roles.\nCan you do affiliate marketing without a website?\nYes, you can do affiliate marketing without a website. You can utilize platforms like YouTube, social media, and email newsletters for your promotional efforts.\nIs affiliate marketing still profitable in 2024?\nAbsolutely. As long as people are buying products online, there will always be a space for affiliates to earn commissions. However, competition has increased, so it's essential to differentiate yourself and provide high-value content to your audience.\nBuild your first AI chatbot for FREE in just 5 minutes!\nGet Started FREE\nSurprise! BotPenguin has fun blogs too\nWe know you’d love reading them, enjoy and learn.\nWhat is a WhatsApp Campaign? (With Real-World Examples)\nUpdated at Nov 15, 2024\n16 min to read\nBotPenguin\nContent Writer, BotPenguin\nA Comprehensive Look at Generative AI Use Cases Across Industries\nUpdated at Nov 14, 2024\n14 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nHow Generative AI Models Help in Enhancing Chatbot Conversations\nUpdated at Nov 14, 2024\n8 min to read\nManish Goyal\nAI Technical Lead, BotPenguin\nTable of Contents\nWhat is Affiliate Marketing?\nWhy should you do Affiliate Marketing?\nWhen to do Affiliate Marketing?\nWhere is Affiliate Marketing done?\nWho Benefits from Affiliate Marketing?\nAffiliate Marketing Terms\nHow Does Affiliate Marketing Work?\nHow to Become an Affiliate Marketer?\nBotPenguin’s Affiliate Marketing Program\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09218285977840424, -0.08694364875555038, 0.0186188742518425, 0.0029215982649475336, 0.006588997785001993, -0.029264504089951515, 0.04619794338941574, 0.07747212052345276, -0.005202239379286766, 0.004714759066700935, 0.0797022208571434, -0.0010533577296882868, 0.015354675240814686, 0.022194186225533485, 0.12874171137809753, -0.007478855084627867, 0.11423786729574203, -0.09661734104156494, -0.08563569188117981, -0.021724481135606766, -0.03312555328011513, -0.02046169526875019, 0.04347826540470123, -0.022846601903438568, -0.02348019927740097, -0.06780175119638443, -0.018396183848381042, -0.0017921181861311197, -0.02653701789677143, -0.08604419976472855, 0.010188611224293709, 0.01675598695874214, 0.013298890553414822, 0.05421236902475357, -0.011369245126843452, -0.044732145965099335, -0.038818344473838806, 0.004475427325814962, 0.08147549629211426, -0.024754110723733902, -0.05170944705605507, -0.08083245903253555, -0.07095634937286377, -0.013410357758402824, 0.07947755604982376, -0.03163346275687218, -0.04973459988832474, 0.04325690492987633, 0.005630525294691324, 0.10419289022684097, -0.07044659554958344, -0.03313777223229408, 0.04074694216251373, 0.03811994194984436, -0.046539027243852615, 0.020468275994062424, -0.05065300315618515, 0.013991482555866241, 0.027360660955309868, -0.003975639585405588, -0.0252374317497015, -0.003078107489272952, 0.05668124556541443, 0.04072444885969162, -0.0630878359079361, 0.02968718484044075, -0.12105757743120193, 0.016745079308748245, -0.022311899811029434, -0.050719451159238815, -0.011960318312048912, -0.0392707958817482, -0.06813061237335205, 0.058423612266778946, 0.005089743994176388, -0.044274620711803436, 0.03269322216510773, -0.006846664473414421, 0.010281985625624657, -0.04343181103467941, -0.026958240196108818, 0.05250256881117821, -0.005752191878855228, 0.04266289994120598, -0.03794807940721512, -0.019838640466332436, 0.0006383671425282955, 0.03773225098848343, -0.03311190754175186, 0.01376801636070013, 0.02318064123392105, 0.0056709786877036095, 0.0071106720715761185, 0.008926804177463055, 0.03925495594739914, 0.027471940964460373, -0.0729566439986229, 0.014972635544836521, -0.0530613549053669, -0.013744013383984566, 0.0017894787015393376, -0.02858670987188816, -0.06655832380056381, -0.07521349936723709, -0.046105675399303436, -0.014116381295025349, 0.0570121668279171, -0.01583882048726082, 0.15073168277740479, 0.03683440759778023, -0.1369820535182953, -0.055624574422836304, -0.003929272759705782, -0.02646821364760399, 0.0018883338198065758, 0.05400112643837929, -0.037909749895334244, 0.07186426222324371, 0.1453504115343094, 0.011169412173330784, 0.05779629200696945, 0.07456488907337189, 0.03389481455087662, 0.0006076793069951236, 0.0607672780752182, 0.019418638199567795, -0.003292824374511838, 1.0689263104970436e-32, -0.07465474307537079, 0.043208617717027664, -0.064551942050457, 0.09383931756019592, 0.02858137898147106, 0.029707947745919228, 0.019603749737143517, 0.028090499341487885, -0.08036027103662491, -0.02931886352598667, -0.12017526477575302, 0.1141468733549118, -0.0693608745932579, 0.06879422813653946, 0.015081807039678097, -0.059652481228113174, -0.011267329566180706, 0.019283737987279892, 0.041887905448675156, -0.004128174856305122, 0.09064134210348129, -0.03048757091164589, 0.050780288875103, 0.09230678528547287, 0.10673186182975769, 0.008160088211297989, 0.061752449721097946, 0.03547436743974686, 0.05248425900936127, 0.028708791360259056, -0.07333134859800339, -0.005362689960747957, -0.02587607316672802, 0.005833070259541273, -0.05958833172917366, -0.039617978036403656, -0.04248367249965668, -0.13461023569107056, -0.06293726712465286, 0.054462920874357224, -0.1514386236667633, 0.02209693007171154, -0.09616430103778839, -0.0601203516125679, 0.023640574887394905, 0.02736418880522251, 0.02846204675734043, 0.021766336634755135, 0.050756439566612244, 0.020183531567454338, -0.029817895963788033, 0.01840713620185852, 0.054542310535907745, 0.04739111289381981, 0.001171971671283245, -0.031583692878484726, 0.02085527963936329, -0.03732942417263985, -0.021163638681173325, -0.0441611222922802, -0.00402261083945632, -0.04240085184574127, -0.009609241969883442, -0.03348923847079277, 0.0313832089304924, 0.024714119732379913, 0.043308645486831665, 0.017027761787176132, 0.016336265951395035, 0.03534660488367081, 0.0412030853331089, 0.0663548931479454, -0.036155980080366135, 0.0313238725066185, -0.04388435184955597, 0.00714595103636384, -0.11813262850046158, 0.049472060054540634, 0.00183800607919693, 0.015146643854677677, -0.011837366037070751, -0.021233269944787025, -0.004308763891458511, -0.019290093332529068, 0.05505847558379173, -0.03673055022954941, 0.022944875061511993, -0.03898480534553528, -0.004366565030068159, 0.048344045877456665, -0.015201862901449203, 0.10238529741764069, -0.09103526175022125, 0.07630731165409088, -0.022909078747034073, -8.869308384413645e-33, -0.05877915397286415, 0.028237342834472656, -0.03724199905991554, 0.0779203251004219, -0.0019100236240774393, -0.014310415834188461, 0.04175729677081108, -0.03551853448152542, 0.09673374146223068, -0.016511254012584686, -0.10343964397907257, -0.0230218805372715, 0.01108569372445345, -0.04736212268471718, -0.0160074383020401, 0.009772569872438908, -0.053123101592063904, -0.006571547128260136, 0.03315787762403488, -0.00033701947540976107, -0.022293144837021828, 0.04578780010342598, -0.08683685958385468, -0.013699039816856384, 0.020003899931907654, 0.04470430314540863, -0.0789426639676094, 0.0698583647608757, 0.015497837215662003, 0.016850244253873825, -0.008908076211810112, 0.008788052946329117, -0.010068350471556187, -0.024498112499713898, 0.011072088032960892, 0.07963710278272629, 0.0073226867243647575, 0.0014587329933419824, -0.004489687271416187, -0.07481475174427032, 0.08616774529218674, -0.058212943375110626, -0.014608638361096382, -0.07673835754394531, -0.017444048076868057, 0.029677128419280052, -0.12691672146320343, -0.06274858117103577, -0.04559703171253204, 0.03560040518641472, 0.03278757631778717, 0.016658179461956024, 0.042791347950696945, -0.04066295921802521, -0.09425109624862671, -0.019356615841388702, 0.0840165913105011, 0.03230253979563713, -0.08658243715763092, 0.008165227249264717, 0.030501818284392357, 0.010942778550088406, 0.07635138928890228, 0.08081930130720139, 0.03478472679853439, -0.01953613944351673, 0.08115418255329132, 0.03242076560854912, -0.017273159697651863, -0.09579192101955414, 0.060928937047719955, -0.05444946140050888, -0.020315194502472878, -0.0131434490904212, -0.0012742339167743921, 0.08575370907783508, 0.03250657767057419, -0.09635664522647858, -0.0006074818084016442, -0.04055776819586754, -0.04904576763510704, -0.000897443329449743, 0.062473710626363754, 0.03560326620936394, -0.08276896178722382, 0.052315760403871536, -0.027525926008820534, 0.021669747307896614, 0.002677039010450244, 0.008466953411698341, -0.042996328324079514, 0.011577706784009933, -0.015436257235705853, 0.08834430575370789, 0.006599667016416788, -5.940533753800992e-08, -0.03164952993392944, -0.012118004262447357, 0.04897984862327576, 0.049253202974796295, 0.03977002203464508, -0.05255855247378349, -0.04704426974058151, 0.06190038472414017, 0.02587818168103695, 0.030170442536473274, 0.008506102487444878, -0.011918539181351662, -0.06461159139871597, 0.07760307937860489, 0.07298660278320312, -0.02585805207490921, -0.02020411193370819, -0.030344590544700623, 0.02134777046740055, -0.02745107002556324, 0.031316593289375305, 0.02807609736919403, -0.037448812276124954, -0.047967854887247086, 0.027590107172727585, -0.05629833787679672, -0.05066167563199997, 0.09054169803857803, -0.010458370670676231, -0.024068741127848625, -0.04501412808895111, -0.03740447759628296, 0.04653937369585037, -0.039486441761255264, -0.04003879427909851, 0.002716069109737873, -0.0704585388302803, -0.08059843629598618, 0.0010034904116764665, 0.048058610409498215, 0.001805604319088161, 0.018048929050564766, 0.02816636487841606, -0.08576266467571259, -0.01305485237389803, -0.04755507409572601, -0.07341636717319489, -0.1175866574048996, 0.05869682505726814, -0.0012773816706612706, -0.04881017655134201, 0.0014317294117063284, 0.05909281596541405, 0.01455787941813469, 0.06872481852769852, -0.022269010543823242, 0.049393411725759506, 0.011325353756546974, 0.0946807712316513, 0.10018464922904968, 0.01702946238219738, 0.0019012538250535727, 0.04335634037852287, 0.01339804194867611]}