{"file_name": "botpenguin.com_blogs_what-is-sms-chatbot", "text": "URL: https://botpenguin.com/blogs/what-is-sms-chatbot\nWhat is SMS Chatbot & How to Get Started with it in 2024\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nWhat is SMS Chatbot & How to Get Started with it in 2024\nPlatforms\nUpdated at Oct 10, 2024\n10 min to read\nBotPenguin\nContent Writer, BotPenguin\nTry BotPenguin\nTable of Contents\nIntroduction\nWhat is an AI SMS Chatbot?\nHow AI SMS Bots Work\nBenefits of SMS Chatbots\nUse Cases of SMS AI Chatbots\nHow to Get Started with SMS Chatbots\nBest Practices for AI SMS Chatbots\nCommon Challenges and How to Overcome Them\nConclusion\nFrequently Asked Questions(FAQs)\nShare\nLink copied\nIntroduction\nSMS chatbots have emerged as powerful tools for businesses to enhance customer engagement and streamline communication.\nAn AI SMS chatbot, also known as a text chatbot or SMS chatbot, is an automated system that can interact with users via text messages, providing instant responses and assistance.\nRecent statistics highlight the growing importance of SMS chatbots. According to a report by Juniper Research (2023), the number of SMS chatbot interactions is expected to reach 193 billion by 2024, representing a 40% increase from 2022.\nThe appeal lies in their accessibility and convenience. With options ranging from free SMS chatbot services to more advanced SMS AI chatbot solutions, businesses of all sizes can leverage this technology.\nSMS bots free up human resources while providing 24/7 customer support. As the demand for instant, personalized communication grows, SMS chatbots are becoming indispensable tools for businesses looking to enhance customer experience and operational efficiency.\nWhat is an AI SMS Chatbot?\nAn AI SMS chatbot is an automated messaging system that uses artificial intelligence to interact with users via text messages.\nThis technology combines natural language processing (NLP) and machine learning to understand and respond to user queries sent through SMS.\nAI SMS chatbots can handle a wide range of tasks, from customer support to appointment scheduling, making them valuable tools for businesses across various industries.\nThese chatbots work by analyzing incoming text messages, interpreting the user's intent, and generating appropriate responses.\nThey can understand context, learn from past interactions, and provide personalized experiences. AI SMS chatbots are particularly useful for reaching customers who prefer text messaging or have limited internet access.\nBusinesses can use AI SMS chatbots to automate customer service, send appointment reminders, conduct surveys, or provide product information.\nThey offer 24/7 availability, ensuring that customers can get assistance anytime. Additionally, these chatbots can handle multiple conversations simultaneously, significantly improving response times and efficiency.\nOne of the key advantages of AI SMS chatbots is their ability to integrate with existing business systems, such as CRM platforms or inventory management tools. This integration allows for seamless data exchange and more comprehensive customer interactions.\nFeatures of AI SMS Chatbots\nUnderstands and interprets human language.\nImproves responses over time based on interactions.\nCan communicate in various languages.\nTailors responses based on user history and preferences.\nConnects with CRM, inventory, and other tools.\nHandles common queries without human intervention.\nTransfers complex issues to live support when needed.\nProvides insights on user interactions and chatbot performance.\nSends reminders, promotions, or updates at specified times.\nAllows for interactive conversations, not just one-way notifications.\nEnsures data protection and adheres to industry regulations.\nHandles increasing volumes of messages as business grows.\nHow AI SMS Bots Work\nSource: HeyMarket\nAI SMS chatbots\nuse natural language processing (NLP) to understand and interpret text messages from users.\nWhen a user sends a text, the bot analyzes the message to identify the intent and relevant information. It then generates a response based on pre-set rules and AI algorithms.\nThis process allows the SMS chatbot to provide accurate and helpful answers. The integration with other systems like CRM can enhance the bot’s functionality, enabling personalized interactions.\nFor example, imagine a customer texting a pizza delivery service, asking, \"What's the status of my order?\"\nThe AI SMS chatbot would analyze the message, recognize the intent, and access the order tracking system. It would then reply with the current status, such as \"Your order is being prepared and will be delivered in 20 minutes.\"\nBenefits of SMS Chatbots\nSource: Omind\nSMS chatbots are automated systems that interact with users through text messages.\nThey provide a range of benefits that can help businesses improve customer service and streamline communication.\nHigh Engagement Rates\nOne of the main benefits of SMS chatbots is their high engagement rates. Text messages have an open rate of over 90%, much higher than emails or social media messages.\nThis means that when you use an SMS chatbot, your messages are more likely to be seen and read by your customers. High engagement rates lead to better customer interaction and satisfaction.\nEasy Accessibility\nThey are incredibly accessible. Almost everyone has a mobile phone with text messaging capabilities.\nThis makes it easy for customers to interact with your business without needing an internet connection or downloading an app.\nAI SMS chatbots can respond quickly to inquiries, providing instant support and information to users.\nDocument\nAnswer Your Customers like a Human\nUsing an AI Chatbot!\nTry BotPenguin\nCost-effective Communication\nUsing it is a cost-effective way to communicate with customers. Traditional customer service methods, like phone calls or emails, can be expensive and time-consuming.\nThey automate responses, reducing the need for a large customer service team. Additionally, there are free SMS chatbot options available that can help small businesses get started without a significant investment.\nPersonalization and Automation\nThey offer a high level of personalization and automation. They can tailor responses based on user data, making each interaction feel personal and relevant.\nIt can use the customer's name and reference previous interactions to provide a more personalized experience. Automation also ensures that responses are consistent and immediate, improving overall customer satisfaction.\nScalability\nThey are highly scalable, making them suitable for businesses of all sizes. Whether you're a small business with a few hundred customers or a large enterprise with millions, SMS chatbots can handle a large volume of interactions simultaneously.\nThis scalability ensures that as your business grows, your customer service capabilities can grow with it without a significant increase in costs or resources.\nData Collection and Insights\nThey can also help businesses collect valuable data and insights from customer interactions.\nBy analyzing the conversations, businesses can gain a better understanding of customer needs, preferences, and pain points.\nThis data can be used to improve products, services, and overall customer experience. Additionally, the data collected by SMS chatbots can help in creating targeted marketing campaigns and personalized offers.\nUse Cases of SMS AI Chatbots\nSMS AI chatbots are transforming how businesses interact with customers by automating processes and providing instant responses.\nLet's explore some key areas where these chatbots are making a significant impact.\nCustomer Support\nOne of the primary uses of an SMS chatbot is in\ncustomer support\n. Businesses can deploy AI SMS chatbots to handle frequently asked questions, provide information, and resolve common issues.\nThis reduces the workload on human agents and ensures that customers receive prompt assistance at any time of the day.\nFor instance, a telecom company might use an SMS text bot to help customers troubleshoot connectivity problems or check their account balance.\nMarketing and Promotions\nSMS AI chatbots\nare highly effective for marketing and promotions. They can send personalized messages to customers about new products, special offers, and upcoming events.\nThese messages are more likely to be read and acted upon than emails. For example, a retail store might use an SMS chatbot to inform customers about a flash sale or to offer a discount code.\nThis direct form of communication can significantly boost engagement and sales.\nAppointment Reminders\nBusinesses that rely on appointments, such as medical offices, salons, and automotive services, can benefit from SMS chatbots for sending reminders.\nAn SMS chatbot can automatically send out reminders to customers about their upcoming appointments, reducing no-shows and improving scheduling efficiency.\nFor example, a dentist’s office could use a text chatbot to remind patients of their appointments and allow them to confirm or reschedule via text.\nSurveys and Feedback\nGathering feedback from customers is crucial for improving services and products. They can be used to conduct surveys and collect feedback efficiently.\nAfter a purchase or service interaction, an SMS chatbot can send a survey link or ask a few quick questions.\nThis method is more engaging and likely to get responses than traditional email surveys. For instance, a restaurant might use an SMS chatbot to ask customers about their dining experience right after their visit.\nSuggested Reading:\nExplore 11 key benefits of SMS marketing for your business\nOrder and Delivery Updates\nThey can provide real-time updates on orders and deliveries, enhancing customer experience. For e-commerce businesses, an SMS chatbot can notify customers when their order is confirmed, shipped, and delivered.\nThis keeps customers informed and reduces the need for them to contact customer service for updates. For example, an online store can use an SMS chatbot to send a text when a package is out for delivery and another when it has arrived.\nHow to Get Started with SMS Chatbots\nThey can significantly improve customer interactions and automate various processes. Follow these steps to set up your SMS chatbot successfully.\nSetting Your Goals\nBefore you start, define what you want to achieve with your SMS chatbot. Are you aiming to improve customer support, boost marketing efforts, or streamline appointment reminders?\nClear goals will guide your design and implementation process. For instance, if your goal is customer support, focus on creating responses to common queries.\nChoosing a Platform or Service Provider\nSelect a platform or service provider that suits your needs. There are many options available, including free SMS chatbot platforms and premium services.\nLook for a platform that offers the features you need, such as AI SMS chatbot capabilities, integration options, and scalability. Evaluate different providers to find the one that best matches your business requirements.\nDesigning Your Chatbot's Conversation Flow\nDesigning the conversation flow is a crucial step. Outline how the SMS chatbot will interact with users. Create a flowchart of possible user inputs and corresponding bot responses.\nEnsure the conversation is natural and easy to follow. Consider common questions and scenarios to make the chatbot as helpful as possible. Testing different flows can help refine the user experience.\nIntegrating with Existing Systems\nIntegrate your SMS chatbot with existing systems like CRM (\nCustomer Relationship Management\n), scheduling tools, or e-commerce platforms. This ensures that the chatbot can access necessary data and provide accurate information.\nFor example, an SMS text bot integrated with your CRM can pull customer details to personalize interactions. Integration enhances the chatbot’s functionality and improves user satisfaction.\nBest Practices for AI SMS Chatbots\nUsing an AI SMS chatbot effectively requires careful planning and execution. Here are some best practices to ensure your SMS chatbot delivers a great user experience.\nKeep Messages Short and Simple\nEnsure your messages are concise and to the point. Users prefer quick, clear communication, especially in text format. Avoid long paragraphs.\nBreak down information into bite-sized pieces. This keeps the interaction efficient and user-friendly, making it easier for customers to understand and respond.\nUse Clear and Friendly Language\nAdopt a tone that is both clear and friendly. Avoid technical jargon and complex words. Your SMS chatbot should communicate in a way that feels natural and approachable.\nThis helps in building a positive relationship with users. Friendly language can make interactions feel more personal and engaging.\nSuggested Reading:\nSuccessful SMS Examples for Real Estate Marketing\nPersonalize Interactions\nPersonalization is key to creating a good user experience. Use the data you have to tailor responses to individual users.\nAn AI SMS chatbot can address users by their names and refer to their past interactions. This makes the conversation feel more relevant and improves customer satisfaction.\nEnsure Quick Response Times\nOne of the main benefits of an SMS chatbot is its ability to provide immediate responses. Make sure your SMS chatbot responds quickly to user queries.\nDelays can frustrate users and reduce the effectiveness of your chatbot. Aim to keep response times within a few seconds to maintain engagement.\nRegularly Update and Improve the Chatbot\nContinuously monitor and update your SMS chatbot to improve its performance.\nCollect feedback from users and analyze the chatbot’s interactions to identify areas for improvement. Regular updates ensure that your text chatbot remains accurate and relevant.\nThis can involve adding new responses, improving existing ones, and updating the chatbot’s knowledge base.\nSuggested Reading:\nHow to Implement Shopify SMS Marketing Successfully\nCommon Challenges and How to Overcome Them\nThey can significantly improve\ncustomer engagement\nand efficiency. However, some challenges may arise. Here’s how to handle them effectively.\nHandling Complex Queries\nChallenge\nThey might struggle with complex or unusual queries.\nSolution\nEnhance your AI SMS chatbot with advanced natural language processing (NLP) capabilities.\nRegularly update its knowledge base and integrate a fallback mechanism to route complex issues to human agents when necessary.\nMaintaining User Engagement\nChallenge\nKeeping users engaged over time can be difficult.\nSolution\nUse personalized messages and interactive elements to maintain user interest. Regularly update your SMS text bot with new content and features.\nOffering incentives, such as discounts or exclusive information, can also help keep users engaged.\nEnsuring Data Privacy and Security\nChallenge\nProtecting user data is crucial and challenging.\nSolution\nImplement strong encryption and follow data protection regulations. Regularly audit your SMS AI chatbot for security vulnerabilities.\nEnsure users are informed about how their data is used and stored. Providing a clear privacy policy can build trust and compliance.\nDocument\nMake Your Own AI Chatbot\nWithout Any Coding!\nGet Started FREE\nConclusion\nIn conclusion, implementing an AI SMS chatbot or text chatbot can significantly enhance your business's communication strategy.\nWhether you opt for a free SMS chatbot or invest in a more advanced SMS AI chatbot, the benefits are clear: improved customer engagement, 24/7 availability, and streamlined operations.\nTo get started, consider platforms like BotPenguin, which offers user-friendly solutions for creating and deploying SMS chat bots.\nBotPenguin's\nversatile features allow businesses to customize their SMS text bot to align with their specific needs and brand voice.\nWhen implementing your SMS bot, free or paid, remember to focus on creating natural, helpful conversations. Regularly analyze and refine your chatbot's responses to ensure it's meeting user needs effectively.\nAs technology advances, SMS chatbots will continue to evolve, offering even more sophisticated interactions. By embracing this technology now, businesses can stay ahead of the curve in customer communication.\nWhether you're looking to implement a simple SMS text bot or a complex AI SMS chatbot, the key is to start. Begin with a clear strategy, choose the right platform, and continuously improve your bot based on user interactions.\nWith the right approach, your SMS chatbot can become an invaluable asset in your customer service arsenal.\nFrequently Asked Questions(FAQs)\nWhat is an SMS chatbot?\nAn SMS chatbot is an automated tool that interacts with users via text messages, providing information, answering questions, and performing tasks without human intervention.\nHow do they work?\nSMS chatbots use natural language processing (NLP) to understand and respond to text messages, providing automated, real-time interactions with users.\nWhat are the benefits of using it?\nBenefits include high engagement rates, easy accessibility, cost-effective communication, personalization, automation, and 24/7 availability for customer support and other services.\nHow can businesses get started with SMS chatbots?\nBusinesses can start by setting clear goals, choosing the right platform, designing conversation flows, and integrating the chatbot with existing systems.\nWhat are common use cases for SMS chatbots?\nCommon use cases include customer support, marketing and promotions, appointment reminders, surveys and feedback, order updates, and event reminders.\nHow can businesses ensure data privacy with SMS chatbots?\nImplement strong encryption, follow data protection regulations, regularly audit for security vulnerabilities, and clearly inform users about data usage and storage practices.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\nTelegram AI Chatbot: Enagage 10x more users for your Business\nUpdated at Nov 13, 2024\n15 min to read\nBotPenguin\nContent Writer, BotPenguin\nMust-Have Shopify Marketing Tools for 2024\nUpdated at Nov 12, 2024\n10 min to read\nRahul Gupta\nAssistant Marketing Manager, BotPenguin\nHow to Increase Sales with Shopify Chatbot Automation\nUpdated at Nov 11, 2024\n10 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nIntroduction\nWhat is an AI SMS Chatbot?\nHow AI SMS Bots Work\nBenefits of SMS Chatbots\nUse Cases of SMS AI Chatbots\nHow to Get Started with SMS Chatbots\nBest Practices for AI SMS Chatbots\nCommon Challenges and How to Overcome Them\nConclusion\nFrequently Asked Questions(FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09810874611139297, -0.06669530272483826, 0.034727148711681366, -0.0005939782131463289, -0.011207188479602337, -0.03370911255478859, 0.021095724776387215, 0.07455175369977951, -0.007429121993482113, 0.02246692404150963, 0.045578449964523315, -0.023718666285276413, 0.033070728182792664, 0.02235473319888115, 0.11906251311302185, -0.012678551487624645, 0.12077277898788452, -0.12937690317630768, -0.07906799018383026, -0.021785616874694824, 0.0032214366365224123, 0.0028277598321437836, 0.05131605267524719, -0.028454972431063652, -0.022503197193145752, -0.028056330978870392, -0.04233520105481148, -0.021440038457512856, -0.017746271565556526, -0.043207332491874695, 0.004563104826956987, 0.03995862230658531, 0.01287128496915102, 0.07877364754676819, -0.03815324231982231, -0.06306889653205872, -0.026165127754211426, 0.00930763315409422, 0.08420035988092422, -0.04179241135716438, -0.08700206130743027, -0.08365491777658463, -0.049762774258852005, -0.01300435233861208, 0.09903238713741302, -0.0024180470500141382, -0.05017285794019699, 0.024314910173416138, 0.013586191460490227, 0.07633252441883087, -0.07085596770048141, -0.03593279421329498, 0.05380352586507797, 0.04639948904514313, -0.05784158036112785, 0.03598986193537712, -0.02514582686126232, 0.026037633419036865, 0.0638047456741333, -0.007286170497536659, -0.029309045523405075, -0.004192472901195288, 0.02919137477874756, 0.027909474447369576, -0.033470217138528824, 0.023680128157138824, -0.1150432899594307, 0.013850481249392033, 0.02562308870255947, -0.024514762684702873, -0.018875006586313248, -0.015437517315149307, -0.03178907930850983, 0.07644084095954895, -0.0066116005182266235, -0.021076427772641182, 0.017797347158193588, 0.0008575823740102351, 0.014348303899168968, -0.05398237705230713, -0.03225483372807503, 0.020579785108566284, 0.015370822511613369, 0.05956447497010231, -0.04239401966333389, -0.03574703633785248, 0.0040580169297754765, 0.0642397478222847, -0.03512119874358177, 0.00017310807015746832, 0.03995565325021744, 0.009570393711328506, 5.734282603953034e-05, 0.040351372212171555, 0.014992844313383102, 0.032461244612932205, -0.08241164684295654, 0.0004559097287710756, -0.04468582570552826, -0.00954079907387495, 0.001576361246407032, -0.028567668050527573, -0.04587157815694809, -0.06017463654279709, -0.048405278474092484, 0.02725330740213394, 0.08815167844295502, -0.014430761337280273, 0.13139796257019043, 0.009855826385319233, -0.10182183980941772, -0.06455172598361969, 0.006209309212863445, -0.01944670081138611, 0.00946107879281044, 0.0015385334845632315, -0.021366138011217117, 0.06239686906337738, 0.1412438452243805, 0.035564739257097244, 0.07161996513605118, 0.05607961118221283, -0.007790659554302692, -0.013113455846905708, 0.07291398197412491, 0.04996918514370918, -0.005025085527449846, 1.0765444689795321e-32, -0.03294592350721359, 0.0558345802128315, -0.038255445659160614, 0.10430716723203659, 0.01856180652976036, 0.021487567573785782, 0.026241078972816467, 0.0374797061085701, -0.05286039412021637, -0.035612691193819046, -0.0925663411617279, 0.08545958995819092, -0.08690671622753143, 0.030447352677583694, 0.025561006739735603, -0.09487651288509369, -0.009611150249838829, -0.00024854965158738196, 0.0687253549695015, 0.00623689778149128, 0.07345034927129745, -0.04104375094175339, 0.0626780316233635, 0.06677745282649994, 0.12893742322921753, 0.04777543246746063, 0.08425357937812805, -0.012926225550472736, 0.06496896594762802, 0.03385879471898079, -0.09575143456459045, 0.0032022648956626654, -0.05106138065457344, 0.034558214247226715, -0.04928202927112579, -0.04520042613148689, -0.04687901586294174, -0.09359835088253021, -0.08182255923748016, 0.03783922269940376, -0.13605503737926483, 0.01097172312438488, -0.117093525826931, -0.0862620621919632, 0.029696861281991005, -0.003704061731696129, 0.006678146310150623, 0.024404732510447502, 0.04765425994992256, 0.02942091040313244, -0.0394689179956913, 0.00830334983766079, 0.03361602872610092, 0.055555131286382675, -0.006043502129614353, -0.039722707122564316, 0.028567887842655182, -0.06113309785723686, -0.011890779249370098, -0.03692690283060074, -0.019693272188305855, -0.05025918036699295, -0.009568741545081139, -0.011906181462109089, 0.04904651641845703, 0.007750569377094507, 0.053037628531455994, 0.010494021698832512, 0.010738668963313103, 0.03638754412531853, 0.03949815779924393, 0.04931306466460228, 0.011241890490055084, 0.031917180866003036, -0.05120478570461273, 0.05498401075601578, -0.08003882318735123, 0.027897384017705917, -0.048989150673151016, 0.014467732049524784, -0.024911193177103996, -0.01252560131251812, -0.012094765901565552, -0.0492916963994503, 0.08824492990970612, -0.03782755136489868, 0.017922282218933105, -0.05183369293808937, -0.012127559632062912, 0.06402790546417236, -0.05297819897532463, 0.09511052072048187, -0.05422285199165344, 0.08491217344999313, -0.03132050111889839, -8.158966699103337e-33, -0.04209369048476219, 0.03348502516746521, -0.052430715411901474, 0.07296473532915115, 0.012991651892662048, -0.03136961907148361, 0.02361786551773548, -0.02796095237135887, 0.0869913399219513, -0.01578795351088047, -0.10180489718914032, -0.012339676730334759, 0.015025103464722633, -0.042567793279886246, -0.007478904910385609, 0.03683602809906006, -0.034653130918741226, -0.0475221648812294, 0.013369932770729065, 0.00843505933880806, -0.034296534955501556, 0.057639338076114655, -0.12837441265583038, 0.0009982003830373287, 0.003212716430425644, 0.03524576127529144, -0.07078693807125092, 0.06697318702936172, 0.02265731431543827, 0.005938448943197727, -0.013868322595953941, -0.007890553213655949, 0.003121058689430356, 0.0007037210161797702, 0.028644919395446777, 0.031091075390577316, 0.0161220021545887, -0.0058134011924266815, 0.015483918599784374, -0.05281477048993111, 0.1142815425992012, -0.039465032517910004, -0.04521390050649643, -0.08472234010696411, -0.010502930730581284, 0.01995573379099369, -0.12244007736444473, -0.03324345126748085, -0.060744334012269974, 0.021057158708572388, 0.05878157913684845, -0.019727202132344246, 0.04685349762439728, -0.04955034330487251, -0.07822594046592712, -0.03964634984731674, 0.10595301538705826, 0.012524637393653393, -0.09005416184663773, 0.017712661996483803, 0.03574454039335251, 0.016151316463947296, 0.07007620483636856, 0.05828924477100372, 0.029893070459365845, -0.017513038590550423, 0.05748641490936279, 0.037037771195173264, -0.01816059648990631, -0.09428167343139648, 0.034326594322919846, -0.07529914379119873, -0.02621724084019661, 0.01945217326283455, 0.020001444965600967, 0.08843939006328583, 0.02915235236287117, -0.10707958787679672, -0.012261162512004375, -0.028268689289689064, -0.03266558796167374, 0.01930408924818039, 0.05441294610500336, 0.02448127791285515, -0.0723077654838562, 0.06747937202453613, -0.03355920687317848, 0.004402596969157457, -0.010962555184960365, 0.014995789155364037, -0.07575297355651855, 0.017392899841070175, -0.00933100562542677, 0.10587215423583984, 0.011328259482979774, -5.778976941428482e-08, -0.02848958596587181, -0.02272787317633629, 0.038866281509399414, 0.02204805240035057, 0.015515622682869434, -0.0497438982129097, -0.03979146480560303, 0.07684116065502167, 0.053061846643686295, 0.022315338253974915, 0.017441904172301292, -0.04197955131530762, -0.0602756068110466, 0.08106032758951187, 0.055980317294597626, -0.020513983443379402, -0.02550785429775715, -0.025466211140155792, 0.013648942112922668, -0.03297847509384155, 0.07948588579893112, 0.014712386764585972, -0.020791202783584595, -0.02659829705953598, 0.023969082161784172, -0.07062288373708725, -0.06062458083033562, 0.07576489448547363, -0.04694249853491783, -0.021887807175517082, -0.030429920181632042, -0.03599030524492264, 0.0661698579788208, -0.04291508346796036, -0.008475745096802711, -0.01577887125313282, -0.04524391517043114, -0.09477100521326065, 0.024989480152726173, 0.03864691033959389, 0.03259936720132828, 0.04161101207137108, 0.011460562236607075, -0.09573043137788773, -0.01881001889705658, -0.06948435306549072, -0.060347482562065125, -0.11512412875890732, 0.033462733030319214, 0.0022029296960681677, -0.062435876578092575, 0.013648678548634052, 0.05161457508802414, 0.03829902410507202, 0.08570528775453568, 0.0035466242115944624, 0.06509328633546829, -0.008633038029074669, 0.09404709190130234, 0.09748110920190811, 0.03252977505326271, 0.03047877363860607, 0.02316858060657978, 0.009815537370741367]}