{"file_name": "botpenguin.com_blogs_which-are-the-7-best-voice-assistants-of-2023", "text": "URL: https://botpenguin.com/blogs/which-are-the-7-best-voice-assistants-of-2023\nWhich are the 7 best Voice Assistants of 2024?\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nWhich are the 7 best Voice Assistants of 2024?\nVoice Tech\nUpdated at Sep 25, 2024\n10 min to read\nBotPenguin\nContent Writer, BotPenguin\nTry BotPenguin\nTable of Contents\nWhat are Voice Assistants?\nTop Voice Assistants of 2024\nHow to choose the best voice assistant?\nTo sum up\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nVoice assistants have become extremely popular because they provide a fun alternative to many common tasks.\nWe can ask them to play music, read the news, operate our electronic devices, check our bank balance, and perform other tasks using simple voice commands.\nAccording to projections, there will be about 8 billion voice assistants by 2024.\nTherefore, sit back and unwind, or ask your voice assistant to read our list of the top 7 voice assistants to check out this year.\nWhat are Voice Assistants?\nVoice assistants are intelligent programs that respond to spoken commands and can be installed on any device, including smartphones, speakers, desktop/laptop computers, tablets, wearable technology, gaming consoles, TV consoles, virtual reality (VR) headsets, automobiles, and internet of things (IoT) gadgets.\nDocument\nAnswer Your Customers like a Human\nUsing an AI Chatbot!\nTry BotPenguin\nTop Voice Assistants of 2024\nIt's getting so handy and sorted to get updates regarding everything around you, reason is an Assistant not in person but a voice Assistant!\nJust say Hey! and see the quickness of these voice assistants whether it's News Updates, Listening to songs , turning of the lights or Calling someone its a go to solution for everything.\nLet's discuss about the top voice assistants one should try-\nSiri\nSiri takes the top spot\non the voice assistants list. It's a high-ranking AI assistant developed by Apple for its array of products, including iPhones, iPads, and Macs.\nSiri is incorporated into a variety of voice assistant devices and uses advanced algorithms that process natural language queries, providing an extensive feature set and a user-friendly interface.\nPros\nMultiple language support\nSeamlessly integrated with Apple ecosystem\nHandles complex requests effectively\nPersonalized responses with context awareness\nCons\nNot compatible with non-Apple devices\nSometimes struggles with understanding accents\nLimited third-party interactions\nMay experience glitches\nSuggested Reading-\nAlexa vs Siri vs Google Assistant: Which is Better?\nFacebook M\nFacebook M is an\nAI-powered virtual assistant\ndesigned by Facebook. It operates within the Facebook ecosystem, particularly in Facebook Messenger.\nM uses machine learning algorithms to complete tasks for users and provide recommendations based on chat threads, thus catering to a smooth social interaction experience for Facebook users.\nPros\nIntegrated within Facebook messenger\nUnderstands and responds to natural language\nCan automate certain tasks\nOffers suggestions based on conversation thread\nCons\nNo longer available independently\nFacebook privacy concerns\nLimited functionalities\nLimited outside the Facebook environment\nAlexa\nPart of the renowned list of voice assistants, Alexa comes from tech giant Amazon. This voice-activated AI assistant is known for its wake-up word technology and is embedded in a variety of voice assistant devices.\nSource: Alexa\nAlexa's impressive natural language processing and extensive library of skills make it worthy of its high-ranking position among voice assistant names.\nPros\nHands-free activation\nExtensive skill set, more than 100,000 skills\nHighly responsive and accurate\nSolid integration with IoT devices\nCons\nData privacy concerns\nLimited without Amazon Prime subscription\nLimited device compatibility\nAlexa's voice sounds robotic\nBlackberry Assistant\nBlackberry Assistant, designed specifically for Blackberry users, is a robust voice command system that supports both voice and text commands.\nIt is capable of managing a host of tasks from arranging meetings, sending messages to creating notes. This assistant is seamlessly integrated with Blackberry devices, making it a natural choice for users of this operating system.\nPros\nSupports both voice and text commands\nClean integration with Blackberry devices\nGood for organizing tasks\nSupports multiple languages\nCons\nFunctionality limited to Blackberry OS\nPoor voice recognition compared to competitors\nLimited third-party integration\nNot as versatile as other assistants\nData Bot\nDataBot is another notable entry in the list of voice assistants. It is versatile, operating across multiple platforms like Windows, Android, and iOS.\nData Bot provides both personal and practical support, serving as a proficient voice assistant for reminders, answering personal queries, and featuring a digital map for travel-related assistance.\nPros\nEasy to use interface\nWide range of functionalities\nTravel-friendly with its digital map features\nUpdated with regular information automatically\nCons\nVoice lacks natural sound\nIn-app purchase for extra features\nNot as advanced as competitors\nRelatively unknown and less supported\nBraina\nBraina is a unique personal assistant and automation software that uses human language interface technology.\nWorking beyond the confines of an AI assistant, Braina is more of an interactive companion that learns user preferences over time and offers advanced features such as dictation and desktop automation.\nPros\nDesktop automation\nLearns user preferences over time\nMultilingual support\nDictation features\nCons\nPaid version required for full features\nOnly available on Windows\nNot fully hands-free, needs mouse interaction\nCan be complex to navigate for beginners\nGoogle Assistant\nGoogle Assistant, launched by Google in 2016, holds a prestigious place among voice assistant names.\nThis AI-powered assistant handles everything from messaging and playing music to performing search operations and reading notifications.\nGoogle Assistant is compatible with multiple voice assistant devices, adding to Google's expanding ecosystem.\nPros\nExcellent voice recognition\nClean integration with Google ecosystem\nOffers personalized experience\nWell versed with multiple languages\nCons\nLimited third-party app integration\nPotential data privacy issues\nRequires Google Home app for full functionality\nMay struggle with complex commands\nTeneo\nTeneo by Artificial Solutions is an AI-powered conversational platform catering to business needs. It allows companies to create highly intelligent\nconversational AI\napplications.\nThis highly advanced platform supports a range of languages and offers easy integration with external systems.\nTeneo is designed to deliver more human-like digital interactions, offering impressive dialogue capabilities.\nPros\nAdvanced conversational abilities\nEasy integration with external systems\nDetailed, powerful analytics\nSupports many languages and platforms\nCons\nComplexity in building dialogue flows\nRequires tech expertise to use\nNot easy for non-programmers to customize\nHigh costs of advanced features\nCortana\nCortana adds to the impressive lineup in the list of voice assistants. As Microsoft's AI assistant, Cortana is adept at providing customized recommendations based on the data it gathers.\nCortana is powered by Bing's search engine, making it a valuable asset in the world of voice assistant devices.\nPros\nHighly customizable and adaptive\nGood integration with Windows\nMulti-platform compatibility\nExcellent voice recognition\nCons\nLimited integration for non-Microsoft services\nIs not as advanced as its rivals\nDefault browser is Bing, not changeable\nStruggles with complex tasks\nELSA Speak\nEdback. ELSA customizes pronunciation exercises based on the user's native language, making it a personalized language training tool.\nPros\nExcellent for language learning\nInstant feedback on pronunciation\nCustomized to user's native language\nBite-sized lessons for convenience\nCons\nOnly English is available\nMany functionalities are premium\nSubscription is costly\nAccents can affect recognitionLSA Speak is an AI-based language learning mobile application specifically designed for improving English pronunciation. It uses advanced speech recognition technology to provide instant fee\nBixby\nBixby, Samsung's proprietary voice assistant, provides interactive voice control for various Samsung devices.\nAs one of the unique voice assistant names, Bixby has a deep context-understanding algorithm and can process varied interactions and diverse voice commands, making it a valuable asset in Samsung's range of voice assistant devices.\nPros\nDeep integration with Samsung devices\nVisual identification capabilities\nMultilingual support\nUnique Quick Commands feature\nCons\nLimited app compatibility\nRelatively slow development\nLimited outside Samsung ecosystem\nLess accurate voice recognition\nSocratic\nSocratic, designed by Google, is an\nAI-powered learning assistant\nthat aids students with their homework. It uses image recognition to understand and solve problems presented to it.\nSocratic is designed to find the best online resources to explain difficult concepts, supporting multiple subjects.\nPros\nExcellent for homework help\nUses AI to find the best online resources\nExplains complicated concepts in simple terms\nSupports multiple subjects\nCons\nLimited non-educational uses\nMay promote dependency in learning\nInternet connection is required\nAvailability to only Android and iOS\nHound\nHound is a worthy member of the group of voice assistants. Developed by SoundHound, this AI assistant is known for its top-notch voice recognition technology.\nHound is capable of providing comprehensive and detailed answers, and supports follow-up questions which are a testament to its advanced technological capabilities.\nPros\nExcellent voice recognition\nDetailed answers to queries\nFast response time\nSupports follow-up questions\nCons\nLimited integration potential\nFewer third-party skills\nDoesn’t support large range of IoT devices\nCertain features behind paywall\nYouper\nYouper is an emotional health assistant powered by AI. This smart mobile app helps users manage their emotional well-being. Amid the increasing stress and mental health challenges, Youper is a handy tool that can help navigate feelings, track mood changes, and provide proactive mental health support.\nPros\nProactive mental health support\nAudio and text-based conversation options\nHelps in identifying patterns in mood\nCan aid in social anxiety issues\nCons\nDeeper features behind paywall\nCannot replace professional therapy\nNot available in all countries\nCan be too simplistic for severe disorders\nHow to choose the best voice assistant?\nChoosing the best voice assistant primarily depends on your individual needs and usage. The most\npopular voice assistants\ninclude Siri, Alexa, Google Assistant, and Cortana, each with their unique strengths.\nWhen deciding which voice assistant is the best for you, consider compatibility with your devices, the extent of voice command functionalities, accuracy of voice recognition, and third-party integration capacity.\nIf privacy is a concern, investigate each assistant's data handling policies. Looking forward to the best voice assistant 2023, advancements in AI technology will bring in new features and improved performance. In conclusion, the best voice assistant will be the one that aligns best with your preferences, requirements, and the ecosystem of devices you use.\nDocument\nGet your own AI Assistant today!\nTry BotPenguin\nTo sum up\nHeaps of\nVoice Assistants\nseem to be in the Industry, and choosing the best is becoming increasingly difficult. You must first decide which voice assistant you prefer. There are three worth using: Amazon's Alexa, Google Assistant, and Apple's Siri, each with advantages and disadvantages. If you're new, we currently prefer Google and Amazon-powered models because they are the most user-friendly.\nTake care to avoid getting bogged down in the details. There is no such thing as a perfect voice assistant. Personal taste, preference, and listening habits will be more important in your choice.\nLooking for a virtual assistant to handle website inquiries and make meeting arrangements? Meet BotPenguin, your intelligent bot assistant! Get things done faster and easier with natural voice commands. Try BotPenguin now and experience a smarter way to work!\nFrequently Asked Questions (FAQs)\nWhat are voice assistants?\nVoice assistants\nare intelligent programs that respond to spoken commands and can be installed on various devices, including smartphones, speakers, computers, tablets, wearables, gaming consoles, TVs, virtual reality headsets, automobiles, and IoT gadgets.\nWhat tasks can Siri perform?\nSiri can perform tasks such as placing calls, sending texts, giving advice, dictating locations, and reading weather reports.\nWhat makes Alexa unique?\nAlexa's most well-known feature is the wake-up word, allowing users to activate it with a single word. Over 100 million devices currently use Alexa.\nHow is Hound different for iOS and Android users?\nHound allows interactive games and can use a search engine to find answers, make calls, send messages, and write emails using Speech-to-Meaning Understanding and Deep Meaning technologies.\nWhat functions can Google Assistant handle?\nGoogle Assistant can type messages and emails, dial contacts, play music, search the web, read notifications, and open apps. It also supports text commands.\nHow can I experience a smarter way to work with a virtual assistant?\nTry Botpenguin, your\nintelligent bot assistant!\nIt can handle website inquiries and make meeting arrangements using natural voice commands.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\nStep-by-Step Guide: Using Siri on WhatsApp\nUpdated at Aug 2, 2024\n5 min to read\nBotPenguin\nContent Writer, BotPenguin\nHow to Master Siri: Voice Commands Made Easy\nUpdated at Jun 18, 2024\n5 min to read\nBotPenguin\nContent Writer, BotPenguin\nSamsung Bixby vs Alexa: A Hands-On Comparison\nUpdated at Sep 9, 2024\n6 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nWhat are Voice Assistants?\nTop Voice Assistants of 2024\nHow to choose the best voice assistant?\nTo sum up\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.13097883760929108, -0.07253299653530121, 0.0408712662756443, -0.007592292502522469, -0.019489839673042297, -0.015131402760744095, 0.024940045550465584, 0.053479619324207306, -0.026196731254458427, 0.008444800972938538, -0.005290636792778969, -0.03163497895002365, 0.006134637165814638, 0.01917673647403717, 0.09823521226644516, -0.023015649989247322, 0.11740075051784515, -0.0901375263929367, -0.0774945616722107, -0.04853636398911476, -0.011433425359427929, 0.015295073390007019, 0.04941432550549507, -0.029099544510245323, -0.005305730737745762, -0.03009045496582985, -0.04238187521696091, -0.03373073413968086, -0.013936796225607395, -0.07358306646347046, -0.004594641737639904, 0.02380388230085373, 0.03930435702204704, 0.03983386978507042, -0.026041753590106964, -0.04064492881298065, -0.014561371877789497, 0.015239008702337742, 0.079996757209301, -0.04641701281070709, -0.0815047174692154, -0.05716792121529579, -0.05411022901535034, -0.036835409700870514, 0.08513109385967255, -0.033273279666900635, -0.06392419338226318, -0.0015496318228542805, 0.02719091810286045, 0.08540762215852737, -0.09041261672973633, -0.05646871402859688, 0.062399569898843765, 0.05745917186141014, -0.06891234219074249, 0.029874274507164955, -0.0003628142876550555, 0.012205402366816998, 0.03971037268638611, 0.012717533856630325, -0.044362545013427734, -0.024213021621108055, 0.029991023242473602, 0.033635213971138, -0.041638556867837906, 0.021021250635385513, -0.1240711361169815, -0.005797042977064848, -0.010302898474037647, -0.02577863074839115, -0.021412484347820282, 0.0005385283147916198, -0.027440639212727547, 0.047488484531641006, 0.03908306732773781, -0.02635473944246769, 0.017975136637687683, -0.03295406699180603, 0.04200877249240875, -0.056210268288850784, 0.004310938064008951, 0.025284476578235626, 0.0014512171037495136, 0.05008337274193764, -0.023082580417394638, -0.044856101274490356, -0.018679149448871613, 0.018238801509141922, -0.028304288163781166, 0.0250410046428442, 0.03858427330851555, 0.021951280534267426, 0.01732768677175045, 0.015195765532553196, 0.040784187614917755, 0.033400438725948334, -0.0736979991197586, -0.02035466395318508, -0.06035809591412544, -0.0074995458126068115, -0.01961228996515274, -0.041729383170604706, -0.07087962329387665, -0.08713958412408829, -0.045317452400922775, 0.01574641652405262, 0.05906263738870621, -0.0221741683781147, 0.12422021478414536, 0.016985973343253136, -0.10189436376094818, -0.06320520490407944, -0.007078827824443579, -0.018535524606704712, 0.016101041808724403, 0.000319389917422086, -0.04655421897768974, 0.05816476047039032, 0.13287201523780823, 0.03402406722307205, 0.037449222058057785, 0.0740269273519516, 0.0031158977653831244, 0.016120418906211853, 0.09881637990474701, 0.028649475425481796, -0.008552703075110912, 9.462622260259902e-33, -0.024187162518501282, 0.06780368089675903, -0.016282672062516212, 0.0879829153418541, 0.02610572800040245, 0.015447569079697132, 0.014512816444039345, 0.0410342738032341, -0.05304880067706108, -0.04396561533212662, -0.10426247119903564, 0.09293296188116074, -0.08060202747583389, 0.019580474123358727, 0.02102193422615528, -0.054597996175289154, -0.016669470816850662, 0.03656166046857834, 0.01466439664363861, -0.0033083714079111814, 0.10696334391832352, -0.016467032954096794, 0.055194247514009476, 0.09462710469961166, 0.1406068205833435, 0.005858269054442644, 0.0709342360496521, 0.009954053908586502, 0.06849200278520584, 0.02197171561419964, -0.11024267971515656, 0.005083807278424501, -0.05251624807715416, 0.025852832943201065, -0.03842602297663689, -0.04049495607614517, -0.05107051879167557, -0.09115002304315567, -0.08116494119167328, 0.05653805658221245, -0.12618491053581238, 0.035524073988199234, -0.07792304456233978, -0.07424262166023254, 0.026655802503228188, -0.014816967770457268, 0.008289172314107418, 0.022816598415374756, 0.0533578135073185, 0.03584202378988266, -0.047247640788555145, 0.021970193833112717, 0.021911218762397766, 0.0681033730506897, 0.009311224333941936, -0.048266004770994186, 0.0533674880862236, -0.02174854464828968, 0.0033149851951748133, -0.0388396680355072, 0.007640470750629902, -0.041121020913124084, -0.011365299113094807, -0.022704659029841423, 0.042444758117198944, 0.010929991491138935, 0.05711294710636139, 0.03163199499249458, 0.01684502512216568, 0.03297783434391022, 0.037370916455984116, 0.03214377164840698, 0.019819842651486397, 0.02620713971555233, -0.039954185485839844, 0.03150245174765587, -0.0904344916343689, 0.005234523210674524, -0.02420509234070778, 0.01724586822092533, -0.018974408507347107, 0.013315155170857906, -0.027971051633358, -0.022265415638685226, 0.08637896925210953, -0.05478987470269203, 0.01922706700861454, -0.06141724810004234, 0.015783807262778282, 0.06465338915586472, -0.028010956943035126, 0.07564912736415863, -0.06925372779369354, 0.09264787286520004, -0.06652116775512695, -7.444759841430732e-33, -0.040912941098213196, 0.03286608308553696, -0.026814742013812065, 0.09835733473300934, -0.013985046185553074, -0.030227309092879295, 0.04431426152586937, -0.023116491734981537, 0.0831962302327156, -0.025925874710083008, -0.08446100354194641, -0.007539631798863411, 0.03669752553105354, -0.04563906788825989, -0.009749209508299828, 0.020892752334475517, -0.038080740720033646, -0.0549948513507843, 0.013762910850346088, 0.0034274065401405096, -0.011875816620886326, 0.04162931069731712, -0.11804071813821793, 0.021936262026429176, -0.006531377322971821, 0.016772931441664696, -0.10342328250408173, 0.04554375633597374, 0.05182097852230072, 0.034234754741191864, -0.029079394415020943, 0.006994529627263546, -0.030819935724139214, 0.011851401999592781, 0.019291043281555176, 0.05724921450018883, -0.0037091912236064672, -0.015022159554064274, 0.0056211138144135475, -0.02626972086727619, 0.10027194023132324, -0.06287656724452972, -0.03272472694516182, -0.0840439647436142, 0.004183056298643351, -0.00958977174013853, -0.11665162444114685, -0.0216786190867424, -0.08474063873291016, 0.0245465487241745, 0.046927060931921005, 0.005410571116954088, 0.01782524399459362, -0.03335987403988838, -0.09311408549547195, -0.04290762543678284, 0.10613877326250076, 0.024689747020602226, -0.04644361883401871, 0.04183708131313324, 0.03439026325941086, 0.022915702313184738, 0.052486542612314224, 0.05499981716275215, 0.02280297875404358, 0.0076863523572683334, 0.06553003937005997, 0.04530428722500801, -0.005754297133535147, -0.10528954863548279, 0.06831955909729004, -0.0428638830780983, -0.012119310908019543, 0.0015809471951797605, -0.014234078116714954, 0.08609083294868469, 0.01899135857820511, -0.11230764538049698, -0.01349811814725399, -0.041959770023822784, -0.04472218081355095, 0.019374080002307892, 0.05438723787665367, 0.03767942264676094, -0.061962276697158813, 0.10006926208734512, -0.004044031724333763, -0.016606900840997696, 0.01349059771746397, 0.022647840902209282, -0.05929482728242874, 0.023888561874628067, -0.0005961249116808176, 0.09731251746416092, 0.004002929665148258, -5.8071009334526025e-08, -0.027271876111626625, 0.001192886265926063, 0.06417271494865417, 0.04121004045009613, 0.030529914423823357, -0.07622402161359787, -0.05036918446421623, 0.0877518430352211, 0.0505744107067585, 0.04157481715083122, 0.02921930141746998, -0.034364424645900726, -0.03565394505858421, 0.07819425314664841, 0.08510380983352661, -0.006872544065117836, -0.027514396235346794, -0.013372411951422691, 0.01470975298434496, -0.04923994839191437, 0.07646548002958298, 0.027982963249087334, -0.030501948669552803, -0.04536895081400871, 0.026035217568278313, -0.0926533043384552, -0.05258631706237793, 0.0877511203289032, -0.05233848839998245, -0.01780072972178459, -0.035048555582761765, -0.028038952499628067, 0.05044945329427719, -0.037731826305389404, 0.013546189293265343, -0.0007973694009706378, -0.056876737624406815, -0.08803047239780426, 0.012304387986660004, 0.04060755670070648, 0.01152518205344677, 0.03907051309943199, -0.00862873811274767, -0.09484052658081055, -0.009425272233784199, -0.053774576634168625, -0.054763440042734146, -0.11537409573793411, 0.05047477409243584, 0.005809571128338575, -0.0473841093480587, 0.014303361997008324, 0.053248852491378784, 0.041034821420907974, 0.09512067586183548, -0.0020530985202640295, 0.04583911970257759, -0.021852675825357437, 0.10242229700088501, 0.1296781599521637, 0.02799319289624691, 0.005895436741411686, 0.014089095406234264, 0.014017108827829361]}