{"file_name": "botpenguin.com_chatbot-industry_ecommerce", "text": "URL: https://botpenguin.com/chatbot-industry/ecommerce\nEcommerce Chatbot | Chatbot for Ecommerce | BotPenguin\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nGet an AI chatbot for your\neCommerce 🛍️ store\nSend cart reminders, get payments, capture leads, & give order updates. Easier checkouts, higher sales.\nBring your store to your the customer’s fingertips with our AI ecommerce chatbot.\nGet Started FREE\nFREE Forever plan. No Credit Card Required.\nTrusted by\n40,000+\nGlobal Brands\nDisplay Products, Sell & Notify with a Generative AI eCommerce Chatbot.\nSell your products like a dream with organized catalogs & product recommendations in chat.\nSend abandoned cart notifications, enable order tracking & much more.\nAnswer Product Queries\nThe ChatGPT-driven eCommerce chatbot trained on your product catalogs, documentation, etc., swiftly responds to customer queries, ensuring instant & accurate information.\nShow Product Catalogs\nDisplay your diverse range of products in stunning & easy-to-navigate catalogs, captivating customers and facilitating smooth product selection in chat.\nSend Product Recommendations\nYour eCommerce chatbot analyzes users tastes & sends personalized product suggestions based on preferences, increasing sales & customer satisfaction.\nPayment Gateway Integrations\nSeamlessly integrate popular payment gateways like Stripe, Razor Pay, etc., enabling secure and hassle-free customer transactions, ensuring a smooth checkout process.\nTake Order Confirmation\nSend order confirmation message right after the customer places the order. Instant confirmation is taken through chat, & the order delivery process is started.\nSend Order Notifications\nUpdate customers about different delivery stages i.e. packaging, shipping, cancellations, delivered, etc., with your eCommerce chatbot. Keep them satisfied till they receive their order.\nAllow Order Tracking\nEnable customers to track their orders in chat. The eCommerce chatbot sends tracking updates instantly, keeping customers in the loop.\nRe-target Abandoned Carts\nRemind your customers to pick up where they left off and complete their orders after they abandon their cart, ensuring higher sales.\nProcess Return, Refund, & Exchange\nStreamline the return, refund, & exchange process with the eCommerce chatbot, allowing customers to initiate & track their requests effortlessly\nCollect Solid Leads\neCommerce AI bot Captures & qualifies leads in chat such as name, email, phone numbers, etc., letting you plan future marketing campaigns. A time & effort saver.\nGet Started FREE\nIntroduce AI Shopping Assistant On Your Online Store\nTrain the ChatGPT-driven eCommerce bot to answer FAQs, recommend products,\nre-engage customers, chat with context, & more.\nOffer Round-the-Clock Support\nOffer 24/7 customer support with an AI bot trained on your purchase process, policies, and product knowledge base with URLs, data sets, FAQ files, & chat history.\nKeyword & Intent-Based Suggestions\nGenerative AI chatbots can suggest products based on keywords and user intent, providing more accurate recommendations.\nAI-Powered Product Search\nThe AI shopping assistant can guide customers to the products theyre looking for quickly & easily, reducing bounce rates and improving conversion rates.\nTalk With Context\nContext-aware AI enables the chatbot to provide personalized support based on customer history. Customers don’t have to repeat themselves again.\nChoose a Brand-Uniform Tone\nMaintain a consistent brand voice by customizing the eCommerce Chatbots tone and language to align with your brands values & communication style.\nSet Up Shop on WhatsApp: eCommerce\nChatbot for WhatsApp\nCreate a one-stop ECommerce shop for all of your consumers’ needs on your .\nWhatsApp, from sending out product brochures to tracking orders.\nSend Product Catalog\nShowcase your products and services to your customers.\nRecover abandoned carts\nRemind customers about their abandoned carts and encourage them to complete their purchase.\nDiscounts and Offers\nProvide exclusive discounts and offers to attract more customers.\nStreamline Return, Refund, & Exchange\nHelp your customers by processing return, refund, & exchange requests in WhatsApp DMs.\nStock Left Alerts\nNotify customers about low stock of their favorite products.\nOrder Tracking\nAllow customers to track their orders in real-time.\nCOD Order placement\nEnable customers to place cash-on-delivery orders for convenience.\nCreate Custom Reminders\nSet personalized reminders for customers unique to your delivery process.\nCreate WhatsApp Bot\nChatbots for eCommerce Store: Benefits that Keeps on Growing\nOutshine your competitors with a generative AI chatbot serving your customers day & night. Reduce cart abandonment, save sales agents’ time, Fasten the checkout process, & more.\nGet More Sales\nIncrease conversion rates and drive more sales by providing product catalogs & tailored suggestions.\nReduce Operational Costs\nAutomate customer support tasks & reduce the need for human intervention, saving on operational expenses.\nSave Your Agents Time\nFree up your sales agents from repetitive inquiries, allowing them to focus on more complex and valuable tasks.\nSave Effort to Outreach\nLet the chatbot handle follow-ups on existing & potential customers, saving time and effort.\nAcquire More Customers\nEngage potential customers with personalized human-like interactions, expanding your customer base.\nBoost Product Visibility\nChatbots have high open rates, ensuring more exposure for your products and promotions.\nSpeed Up the Checkout Process\nStreamline the shopping journey by facilitating product search & buying through chat.\nAdd an eCommerce Chatbot to Your Favorite Platform\nYour customers are scattered across different platforms, so it’s good that BotPenguin’s omnichannel\neCommerce Chatbot works on websites, social sites, and eCommerce platforms.\nWhatsApp\nWhatsApp\nCreate a storefront on your WhatsApp with an eCommerce bot. Enable effortless product selection, cart notifications, nurture with drip & broadcasts, & more.\nMessenger\nMessenger\nImprove customer interaction on Facebook with an eCommerce bot that facilitates sales, answers customer queries, suggests products, & send promotional DMs.\nWebsite\nWebsite\nAdd an eCommerce chatbot to your website to offer shopping assistance to visitors, solve FAQs, show products, and send order notifications, leading to higher conversions.\nWoocommerce\nWoocommerce\nAn omnichannel eCommerce chatbot that integrates with your WooCommerce online store and WhatsApp, providing a one-stop solution for customer assistance and sales.\nShopify\nShopify\nAdd an AI bot to your Shopify store & WhatsApp. Let customers view product catalog, make payments, get order updates, request refunds, returns, & more.\nCreate eCommerce Bot\nGet More Eyes on Your Products with AI-driven\neCommerce Chatbot\nSet up marketing automation with a chatbot for eCommerce & receive better CTR than emails & ads. Get\nseen & sold with targeted nurturing via drip, broadcasts, product notifications, etc.\nSchedule Drip & Broadcast Campaigns\nAutomate targeted marketing campaigns at optimal timings with the eCommerce chatbot, ensuring maximum engagement and conversions.\nAbandoned Cart Discount\nRecover abandoned carts by offering exclusive discounts through the generative AI chatbot, motivating customers to complete their purchase.\nLimited Stock Alerts\nNotify customers about limited stock availability in real-time through the chatbot, encouraging prompt purchases before items run out.\nUpsell & Cross-Sell\nIncrease order value by suggesting complementary products and upgrades to customers during their chatbot interaction.\nSend Coupon Codes\nDeliver personalized coupon codes directly to customers via the chatbot, incentivizing them to make a purchase and enhancing customer satisfaction.\nExit Intent Discount\nRetain potential lost customers by providing enticing discounts when they attempt to leave your website or chat.\nPost Sales Follow-Up\nEnsure customer satisfaction by sending personalized follow-up messages, resolving any issues, and offering additional assistance.\nBirthday Greeting\nCelebrate customers on their special day with personalized birthday greetings and exclusive offers, building customer loyalty and engagement.\nLet the Chatbot Capture Hot Leads & Facilitate Appointment Booking\nUse the eCommerce bot to generate leads with natural conversations. Plus, customers can book appointments from chat.\nSync the captured data over to your CRM.\nCapture & Qualify Leads\nEngage potential customers with personalized and automated conversations to generate and qualify leads.\nSend the Leads Data To Your CRM\nEnsure that all lead data is automatically synced with your CRM for easy tracking and follow-up.\nUpload Your Existing Customer List\nTransfer your prospect or customer list from other platforms to BotPenguin and stay connected with your customer base.\nBook Appointments In Chat\nBotPenguin integrates with Google Calender, Simplybook, & Calendly, & more to help customers appointment appointments 24/7.\nIntegrate With Your Booking Tool\nSeamlessly integrate the chatbot with your existing booking tool to streamline the appointment booking process.\neCommerce Chatbot Powers Up Your customer\nSupport\nKeep the customer support strong with our ChatGPT-driven ECommerce Chatbot doing the heavy lifting.\nHelp customers with product enquiries, order issues, policy FAQs, & more.\nLive Chat with customers\nEngage in real-time conversations and provide instant support to customers through the eCommerce chatbots live chat feature.\nAdd your Customer Support Teams\nCollaborate with your sales teams by adding them to the eCommerce chatbot platform, allowing them to assist customers and drive sales.\nIntegrate With Your Ticketing Systems\nSeamlessly integrate the eCommerce chatbot with your existing ticketing systems, ensuring smooth customer issue management and resolution.\nAdd Tags & Segment Customers\nOrganize and categorize customers based on their interactions and preferences with the chatbot, enabling personalized support and marketing campaigns.\nIntegrate With Your CRM\nConnect the eCommerce chatbot to your preferred (CRM) system, be it HubSpot, Zoho, Agile, etc., keeping a unified customer database & enhancing customer service.\nUnified Inbox\nAccess and manage all customer interactions in a centralized inbox, ensuring efficient communication and consistent support across multiple channels.\nDetailed Customer Profiling\nGather comprehensive customer data through the chatbot, enabling in-depth customer profiling for personalized support and targeted marketing.\nCollect Feedback\nThe eCommerce chatbot can get valuable feedback from customers, allowing you to improve your products, services, and overall customer experience.\nBoost eCommerce Sales & Streamline\nSupport Across Industries\nRake in the cash for your eCommerce store with AI Chatbot. Be it Clothing, skincare, home decor, health,\ngroceries, or more, your AI bot has got your back.\nFashion\nSend trendy recommendations, effortless shopping, style advice, personalized outfits, & updates.\nSkincare & Cosmetics\nGive beauty tips, and personalized skincare routines, and offer expert advice wherever needed.\nHealth & Wellness\nShare wellness tips, personalized health plans, and fitness advice, & facilitate appointment bookings.\nComputer & Consumer Electronics\nGive expert advice on the latest gadgets, show products, give spec details, and find the perfect tech solutions.\nHome Decor\nHelp customers with interior design tips, personalized decor suggestions, and the latest style updates.\nGroceries & Food\nSend grocery catalog in chat, recipe suggestions, meal planning assistance, & give dietary advice anytime.\nDigital Services\nOffer round-the-clock support, collect leads to sell services, provide suggestions, & ensure smooth navigation.\nPet Care\nLet customers take care of their pooches & cats with 24/7 pet care, pet food, collars, & leash catalogs, & more.\nAuto and Parts\nAllow customers to find the right auto parts, get maintenance tips, and expert assistance for their vehicle.\nLaunch Your eCommerce Chatbot in 2 minutes With Business-Ready Templates\nBe it Pizza store or answer queries, you can keep it human friendly with our chatbot templates.\neCommerce Product Catalog\nShowcase and sell your products with an interactive catalog experience.\nAnswer Ecommerce Queries\nKeep it fast and glorious with BotPenguin answering most of the queries.\nPizza Store\nTake orders or help your customers track their delicious pizza.\nEatery Order\nStreamline food ordering process & tracking with an efficient AI bot.\nFlower Delivery\nHelp your customers track their delivery effortlessly.\nCar Rental\nProvide hassle-free car rental services with easy bookings and assistance.\nMake My E-Comemerce Awesome\nEveryone Loves Native Integrations and\nSo Does BotPenguin\nNo need to pay any fee for integrations, like ever. With its 80+ native integrations,\nBotPenguin plays well with others for the best ecommerce experience.\nand more than 80 tools to integrate\nBuild your conversational chatbot today\nFrequently Asked Questions\nWhat is eCommerce chatbot?\nAn eCommerce chatbot is an AI-powered tool that automates tasks like customer support, show product catalogs, accept payments, order status updates, process return & refunds, and order tracking in chat.\nHow do I use ChatGPT for eCommerce?\nYou can train ChatGPT on product data, store policies, domentations, online store url, and FAQs to assist customers, recommend products, and personalize interactions for better eCommerce experiences.\nHow to create eCommerce bot?\nCreate an eCommerce bot by defining its purpose, training it on relevant data, integrating with platforms, and optimizing for customer engagement.\nHow do bots affect e-commerce?\nBots enhance e-commerce by automating tasks, providing personalized experiences, improving customer service, and increasing sales through targeted interactions.\nWhat is the best chatbot for ecommerce?\nBotPenguin stands out for eCommerce with robust features like order tracking, automated customer support, cart abandonment recovery, personalized product recommendations, and seamless payment integrations.\nWhat is online shopping bot?\nAn online shopping bot is an AI-powered tool that assists users in various stages of their shopping journey, from product discovery to checkout and beyond.\nWhat are the benefits of using AI in e-commerce?\nAI in e-commerce improves customer experience with 24/7 support & FAQ resolution, AI Live chat, drives sales with personalized recommendations, AI-driven product search, etc.\nWhat is a chatbot in marketing?\nA chatbot in marketing is an AI tool used to engage customers, run loyalty program, send gift cards, nurture with drip & broadcast campaigns, & more.\nWhat is an example of ecommerce chatbot?\nAn example of an eCommerce chatbot is one that assists customers in finding products, answering queries, and facilitating transactions seamlessly within a messaging platform.\nWhat is B2B chatbot?\nA B2B chatbot is an AI-powered tool designed to assist businesses in managing inquiries, processing orders, and providing support to other businesses.\nHow do I create a WhatsApp bot for ecommerce?\nCreate a WhatsApp bot for eCommerce using platforms like BotPenguin, which offer easy-to-use tools for building and deploying chatbots on WhatsApp.\nHow can I use WhatsApp in ecommerce?\nUse WhatsApp in eCommerce to engage customers, provide support, send order updates, offer personalized recommendations, and facilitate transactions seamlessly through payment gateway integration.\nIs WhatsApp chatbot free?\nYes, BotPenguin allows you to create a WhatsApp chatbot for free, offering 100 conversations per month.\nWhat our Customers say\nDelivering value, earning trust. Hear good words about\nBotPenguin on these platforms\nG2\n\"Their ability to execute in a timely manner. If you want to start an AI Chatbot business then this is the place. - They have a great work environment, and know how important it is to be efficient.\"\n-\nGustav Louv\n5-Star Rating\nView More\nCapterra\n\"We are using BotPenguin for our Facebook bots, responding to Facebook messages automatically. Currently handling millions of messages on a monthly basis and really great product.\"\n-\nTwana D.\n4.6-Star Rating\nView More\nTrustpilot\n\"Its Whatsapp Automation with API is really practical for sales & marketing objective. If it comes with analytics about campaign result it will be awesome.\"\n-\nBD Michae\n5-Star Rating\nView More\nGood Firms\n\"Their timely communication is the reason for the great project management. Our descriptions are precisely translated into needs by BotPenguin, and they possess the necessary skill set to execute features in a timely manner.\"\n-\nYashi Amola\n5-Star Rating\nView More\nCrozdesk\n\"The team at BotPenguin contributed knowledge not just about using Generative AI but also about how these technologies may be customized to meet our needs in the asset and wealth management industry. It was amazing how well they could convert difficult technical ideas into workable, approachable solutions. Furthermore, the team at BotPenguin has shown a remarkable capacity for creative problem-solving, as demonstrated by their approach to challenging project specifications.\"\n-\nPhil Johnson\n5-Star Rating\nView More\nBotPenguin can help your eCommerce platform grow, for free!\nGet Bot Penguin Now\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.0899701714515686, -0.06328573077917099, 0.023398615419864655, 0.012547698803246021, -0.002110965782776475, -0.04771161824464798, 0.054226264357566833, 0.05604659020900726, -0.0061152926646173, 0.0011590957874432206, 0.04304102808237076, -0.025178859010338783, -0.001218286924995482, 0.02396176941692829, 0.12007275968790054, -0.00598920090124011, 0.11563348025083542, -0.10331852734088898, -0.07074295729398727, -0.02464820072054863, -0.02178436890244484, -0.021267054602503777, 0.042729903012514114, -0.03620721027255058, -0.03999743610620499, -0.03856965899467468, -0.039015546441078186, -0.012014931067824364, -0.030216408893465996, -0.07595443725585938, -0.0048504783771932125, 0.032477766275405884, 0.0222131609916687, 0.07608409970998764, -0.002448985818773508, -0.05618451535701752, -0.019661569967865944, 0.007350643631070852, 0.08408266305923462, -0.05075186863541603, -0.06853411346673965, -0.08281543850898743, -0.0692085474729538, -0.0024497502017766237, 0.09102510660886765, -0.010907376185059547, -0.048267584294080734, 0.02313673123717308, 0.024157339707016945, 0.0843939259648323, -0.08607544749975204, -0.030950816348195076, 0.04835870862007141, 0.059115633368492126, -0.06384646892547607, 0.04204145073890686, -0.004032812546938658, 0.01332358829677105, 0.05912076309323311, -0.01286778599023819, -0.03095323033630848, -0.024931954219937325, 0.05626630038022995, 0.02514190785586834, -0.030782131478190422, 0.028316572308540344, -0.12741804122924805, 0.006291170604526997, -0.009714261628687382, -0.02889142744243145, -0.015205343253910542, -0.022077113389968872, -0.060420386493206024, 0.05935389921069145, -0.0027953472454100847, -0.02288784645497799, 0.015694618225097656, -0.013834351673722267, 0.018878621980547905, -0.04545413330197334, -0.041488222777843475, 0.01364975981414318, -0.005121131427586079, 0.06076503545045853, -0.04694638401269913, -0.02985048107802868, 0.011767271906137466, 0.03832404688000679, -0.018283916637301445, -0.0012088186340406537, 0.026507176458835602, -0.004409328103065491, 0.006403305567800999, 0.01342750247567892, 0.02646631933748722, -0.0027195061556994915, -0.063102126121521, 0.0033137009013444185, -0.045784156769514084, -0.013277611695230007, 0.008514605462551117, -0.026656221598386765, -0.04692719131708145, -0.08468137681484222, -0.05555204302072525, 0.023108452558517456, 0.05885964259505272, 0.005061796400696039, 0.13804897665977478, 0.014499212615191936, -0.13302896916866302, -0.07150913774967194, 0.016299661248922348, -0.004326267167925835, 0.009578775614500046, 0.016543885692954063, -0.04167823866009712, 0.055658381432294846, 0.13887615501880646, 0.036199893802404404, 0.07815288007259369, 0.06570947915315628, 0.02181277424097061, -0.021533576771616936, 0.07085783779621124, 0.04861326888203621, 0.0014452271861955523, 1.0825760774303951e-32, -0.03336833044886589, 0.03879648447036743, -0.061421532183885574, 0.07903333008289337, 0.03361004963517189, 0.0439329594373703, 0.02557828649878502, 0.0396026112139225, -0.07169922441244125, -0.03567050024867058, -0.09722532331943512, 0.08611734211444855, -0.08121442794799805, 0.046167708933353424, 0.03126486390829086, -0.08065378665924072, -0.00716185150668025, 0.023440293967723846, 0.06214918941259384, -0.00944653619080782, 0.07438864558935165, -0.039285339415073395, 0.05234387889504433, 0.08269038796424866, 0.11521568894386292, 0.03787166625261307, 0.06637562066316605, 0.012790503911674023, 0.07661184668540955, 0.03769449517130852, -0.06854861229658127, 0.004709156230092049, -0.04214918613433838, 0.042228151112794876, -0.04434744641184807, -0.04224138706922531, -0.04571417346596718, -0.0908493772149086, -0.05915432795882225, 0.04520825669169426, -0.14637789130210876, 0.006696843542158604, -0.09067891538143158, -0.0707377940416336, 0.019330168142914772, -0.009747205302119255, 0.01400936022400856, 0.021283969283103943, 0.04549835994839668, 0.04026137664914131, -0.06508761644363403, 0.018550269305706024, 0.0494491383433342, 0.0495503731071949, -0.01198041532188654, -0.06346505135297775, 0.021724821999669075, -0.053470779210329056, -0.006186941172927618, -0.055360645055770874, -0.02384805493056774, -0.024971816688776016, -0.03147551417350769, -0.03474704548716545, 0.04296319559216499, 0.012384745292365551, 0.05050278455018997, 0.02178768441081047, -0.0028009398374706507, 0.054743021726608276, 0.048051007091999054, 0.0577528215944767, 0.0009857630357146263, 0.028422614559531212, -0.05170159041881561, 0.033398695290088654, -0.10000389069318771, 0.037970248609781265, -0.030676420778036118, -0.002898994367569685, -0.029586289077997208, -0.013059289194643497, -0.016079600900411606, -0.042980920523405075, 0.05908624827861786, -0.05213300883769989, 0.026057587936520576, -0.019910676404833794, -0.01732502691447735, 0.04648561030626297, -0.037385858595371246, 0.08668149262666702, -0.07136694341897964, 0.07531864196062088, -0.04296850040555, -8.496125662226032e-33, -0.04957008361816406, 0.011074662208557129, -0.049802228808403015, 0.09055860340595245, 0.01451190561056137, -0.026153597980737686, 0.03610909730195999, -0.03676801919937134, 0.10079217702150345, -0.022707579657435417, -0.09890902787446976, 0.002383315935730934, 0.014541037380695343, -0.029440928250551224, -0.004259051289409399, 0.02699965238571167, -0.05233130604028702, -0.04167894646525383, 0.03412464261054993, -0.005900203250348568, -0.027566976845264435, 0.04379105940461159, -0.10317908227443695, 0.01462990790605545, 0.002768369857221842, 0.03831332549452782, -0.07782183587551117, 0.04488020017743111, 0.021632062271237373, 0.007471806835383177, -0.014722947031259537, 0.012625014409422874, -0.018434451892971992, 0.02441694587469101, 0.02535167708992958, 0.04428777098655701, 0.013473446480929852, 0.002705014543607831, 0.008684398606419563, -0.05213283374905586, 0.09873634576797485, -0.05048483982682228, -0.05477984622120857, -0.07732223719358444, -0.001874867477454245, 0.028910931199789047, -0.13207963109016418, -0.04890618100762367, -0.04205217957496643, 0.028824711218476295, 0.03531298786401749, 0.0191450547426939, 0.04597943276166916, -0.06779684126377106, -0.09266752004623413, -0.019975123926997185, 0.1009395495057106, 0.02400851994752884, -0.08486591279506683, 0.016335681080818176, 0.03822863847017288, 0.019303031265735626, 0.08278108388185501, 0.06132987141609192, 0.03580288961529732, -0.017611440271139145, 0.07245054841041565, 0.05289348587393761, -0.007739615626633167, -0.1044098511338234, 0.05413973331451416, -0.047783274203538895, -0.013960075564682484, -0.002871923381462693, 0.0033465283922851086, 0.08872939646244049, 0.03968127444386482, -0.09650874882936478, 0.009523420594632626, -0.025204533711075783, -0.0412057600915432, 0.010989347472786903, 0.07413816452026367, 0.03301192447543144, -0.07720037549734116, 0.05562504753470421, -0.05593070760369301, 0.0017613985110074282, -0.0013712890213355422, 0.005784486886113882, -0.06955010443925858, 0.014507541432976723, -0.02016863413155079, 0.09566163271665573, 0.004702284466475248, -5.5673144316870093e-08, -0.021485354751348495, -0.023187048733234406, 0.06365378201007843, 0.05433395132422447, 0.04487662762403488, -0.05255097895860672, -0.037889622151851654, 0.09780875593423843, 0.021580222994089127, 0.021169103682041168, 0.02317960001528263, -0.03934064134955406, -0.04842228442430496, 0.08024642616510391, 0.06853510439395905, -0.025612428784370422, -0.015340122394263744, -0.02460399456322193, 0.020375672727823257, -0.030794082209467888, 0.07307136803865433, 0.02332441881299019, -0.01622968167066574, -0.02091655321419239, 0.007078344002366066, -0.07569622993469238, -0.04574500396847725, 0.07031086832284927, -0.06023730710148811, -0.02404383383691311, -0.028392378240823746, -0.03088790364563465, 0.061344992369413376, -0.031233683228492737, 0.011052206158638, -0.018479665741324425, -0.08191511780023575, -0.07561706751585007, -0.006312488578259945, 0.0514240600168705, 0.013950121589004993, 0.026262156665325165, 0.005446452647447586, -0.1026916578412056, -0.00038751278771087527, -0.05007186159491539, -0.07301149517297745, -0.12027652561664581, 0.03474022448062897, 0.00044457465992309153, -0.05405616760253906, 0.00936185847967863, 0.06656741350889206, 0.04510556161403656, 0.08089608699083328, 0.0035927058197557926, 0.06637220829725266, -0.021556558087468147, 0.09264328330755234, 0.10779673606157303, 0.023309681564569473, 0.023240018635988235, 0.04634018614888191, 0.005776011850684881]}