{"file_name": "botpenguin.com_blogs_whatsapp-whitelabel-chatbot", "text": "URL: https://botpenguin.com/blogs/whatsapp-whitelabel-chatbot\nWhatsApp Whitelabel Chatbot: Benefits for Chatbot Resellers\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nWhatsApp Whitelabel Chatbot: The Benefits for Chatbot Resellers\nPartner\nUpdated at Oct 10, 2024\n8 min to read\nAjay Pratap Sudhakar\nProduct Manager, BotPenguin\nTry BotPenguin\nTable of Contents\nWhat is the WhatsApp Whitelabel Chatbot Program for Resellers?\nBenefits of WhatsApp Whitelabel Chatbot for Resellers\nHow Do You Choose The Right Whatsapp Whitelabel Chatbot Provider?\nFeatures to Look for in An Ideal WhatsApp White Label Partner\nConclusion\nFrequently Asked Questions (FAQs)\nShare\nLink copied\n57% of businesses state that chatbot usage results in a big ROI with minimal investments (\nOutgrow\n). And over 50 million brands are using WhatsApp as a business tool.\nThese businesses can be potential clients for selling your branded WhatsApp chatbots. As time passes, chatbots will become a staple for small and enterprise businesses to provide a conversational experience to their users.\nShould you build your platform from scratch to enter this chatbot market? Yes, if you’ve got the budget and resources for it.\nThe smarter choice is to join the WhatsApp Whitelabel Chatbot program and sell a platform tailored to your users without in-house development costs.\nAdd your branding, logo, & pricing to your WhatsApp chatbot platform and start onboarding business, helping them automate their interactions on WhatsApp.\nWhitelabel chatbot providers handle the tech while you focus on sales and marketing. You’ll gain an instant competitive advantage by providing in-demand solutions and earn massive revenue through bot subscriptions and licensing.\nRead on to learn more about the benefits and process of becoming a profitable chatbot reseller. Additionally, we share the factors that will help you choose the right white-label partner.\nWhat is the WhatsApp Whitelabel Chatbot Program for Resellers?\nThe WhatsApp Whitelabel Chatbot Program for resellers allows individuals or businesses to sell WhatsApp Chatbots developed by another platform as part of their product offering.\nThis ready-to-use software solution enables business customers to leverage WhatsApp Messenger for automated and interactive customer conversations. Here's an overview of the program:\nCustomizable Platform:\nOffers a ready-to-use, customizable chatbot platform for businesses to enhance customer service and engagement.\nRebranding:\nResellers receive a whitelabeled version of the chatbot, allowing them to add their own branding, logo, and pricing.\nCost-Effective:\nProvides a budget-friendly solution to enter the chatbot market without extensive development costs.\nTime-Efficient:\nSaves time using an existing platform’s technology, allowing resellers to focus on sales, marketing, and customer support.\nScalable Solution:\nProvides scalable chatbot solutions to support businesses of all sizes, from small enterprises to large corporations.\nRevenue Opportunities:\nResellers can earn revenue through bot subscriptions, licensing, and providing in-demand chatbot solutions to their clients.\nTechnical Support:\nThe platform provider handles development and maintenance, ensuring smooth operations and updates.\nThe\nWhatsApp Whitelabel Chatbot Program\nis a strategic opportunity for businesses to tap into the growing demand for chatbot solutions. It offers a streamlined path to market entry and revenue generation.\nNext, we will cover the benefits of WhatsApp Whitelabel Chatbot resellers.\nBenefits of WhatsApp Whitelabel Chatbot for Resellers\nWhatsApp Whitelabel chatbots allow resellers to expand their service portfolio, provide a cost-effective solution, and generate recurring revenue with quick time-to-market.\nCustomization options include branding, functionality, conversational flow, analytics, language, and security settings.\nBelow are some of the benefits of whatsapp whitelabel chatbots for resellers.\nExpanded Service Portfolio\nBy\noffering WhatsApp Whitelabel chatbots,\nresellers can diversify their service portfolio and cater to the growing demand for chatbot solutions.\nThis expands their business offerings, attracts new customers, and differentiates them from competitors.\nThe ability to provide ready-to-use chatbot solutions can also open doors to cross-selling and upselling opportunities with existing clients.\nCost-Effective Solution\nDeveloping a chatbot from scratch can be a time-consuming and costly process.\nBy\npartnering with a platform\noffering WhatsApp Whitelabel chatbots, resellers can leverage an existing and proven chatbot technology while avoiding extensive development resources.\nThis significantly reduces the investment costs of building and maintaining a chatbot solution.\nQuick Time-to-Market\nWith a WhatsApp Whitelabel Chatbot, resellers can quickly launch a branded solution, sometimes as quick as 12-24 hours, requiring lengthy development cycles.\nThe platform provider handles the initial chatbot agency platform’s configuration and customization, allowing resellers to focus on sales, marketing, and customer onboarding.\nThis enables resellers to capitalize on the growing chatbot market and start generating revenue in a shorter timeframe.\nRevenue Generation\nSelling WhatsApp Whitelabel Chatbots can be a lucrative reseller business venture.\nAs the demand for chatbot solutions increases across industries, resellers can earn recurring revenue through licensing or subscription-based models.\nWith each successful sale, resellers can earn a margin on the chatbot license or ongoing subscription fees, providing a steady income stream.\nCustomization and Branding\nWhatsApp Whitelabel chatbot\nreseller solutions allow resellers to customize and rebrand the chatbot platform with their logos, branding, and colors.\nThis enables resellers to maintain their brand identity while offering a cutting-edge technology solution.\nThe platform provider's customization options often include the ability to modify the chatbot's integration, pricing, and other features, ensuring a tailored and branded solution for each client.\nOngoing Support and Maintenance\nAs a reseller, you will benefit from the platform provider's support and maintenance services.\nResellers can confidently offer their clients ongoing technical support, updates, and bug fixes, without the need for an in-house technical team.\nThe platform provider typically manages the backend infrastructure, ensuring the chatbot remains functional and up-to-date with WhatsApp Messenger's latest features and updates.\nNext, we will cover choosing the right WhatsApp Whitelabel Chatbot provider.\nDocument\nTake Advantage of the AI Wave & Make\nMoney by Selling Whitelabel AI WhatsApp Chatbots!\nBecome a Partner\nHow Do You Choose The Right Whatsapp Whitelabel Chatbot Provider?\nChoosing the right WhatsApp Whitelabel Chatbot provider is crucial to the success of reselling chatbots.\nWith the growing demand for chatbot solutions, numerous providers offer WhatsApp Whitelabel Chatbots, making it challenging to choose the right one. Here are some key factors to consider:\nExpertise and Reputation\nThe provider's expertise and reputation are essential.\nThe provider should have experience developing, deploying, and maintaining chatbot solutions. Look for a provider with a proven track record of successful projects and satisfied clients.\nThe provider's reputation in the chatbot market is also critical. Check for reviews, testimonials, and ratings from other resellers or clients who have worked with the provider.\nPlatform Features\nThe chosen provider's features should align with your reselling needs. Consider the platform's customization capabilities, user interface, and user experience.\nThe platform should have an easy-to-use interface for quick configuration and chatbot customization.\nThe platform should also offer an expansive range of pre-built chatbot templates that cater to various industries or business verticals.\nTechnical Support\nIt is essential to have a provider that offers robust technical support, especially if you do not possess technical experience.\nThe provider should offer support through different channels, including email, phone, or chat. Ensure the provider responds promptly to queries and resolves technical issues quickly.\nSecurity and Compliance\nWhatsApp Chatbots handle sensitive customer data, making security and compliance critical factors to consider.\nDepending on the industry served, look for a provider that adheres to industry-specific regulations, including GDPR, CCPA, or HIPPA.\nTo safeguard the chatbot and end-user data, the whitelabel partner should also use secure infrastructure, including SSL/TLS encryption and two-factor authentication.\nPricing and Licensing\nThe provider's pricing and licensing model should be transparent and affordable.\nThe pricing should be based on clear parameters, such as the number of users, the volume of messages, or a subscription-based model.\nLook for a provider that offers flexible payment models that align with your reselling needs.\nCheck out what makes BotPenguin the\nbest\nWhite Label WhatsApp Chatbot\nin the market.\nFeatures to Look for in An Ideal WhatsApp White Label Partner\nChoosing the right WhatsApp white label partner is crucial for your business's success. The ideal partner will offer a range of features that enhance your service delivery, streamline operations, and boost customer satisfaction. Below are essential features to consider when selecting a white label partner.\nIntegrate Your Payment Gateway:\nAn ideal white-label partner should allow seamless integration of your preferred payment gateway. This ensures smooth and secure transactions, enhancing user experience and trust.\nSell According to Tax Rules:\nYour white-label partner must offer easy tax configuration options. This feature simplifies tax management, ensures compliance with regional tax laws, and reduces administrative burden.\nIntroduce Top-ups or Add-Ons:\nLook for a white label partner that enables the sale of add-ons. This allows you to offer additional features or services, increasing your revenue potential and customer satisfaction.\nCreate Free Trial:\nOffering a free trial is crucial. An ideal white label partner should allow you to create one to attract potential customers and allow them to test the chatbot platform.\nSubscription Plans:\nAn ideal partner should offer flexible subscription plans. This feature allows you to cater to customer needs, enhancing customer retention and satisfaction through tailored solutions.\nSelect Currency:\nThe ability to select currency is essential. Your white label partner should support multiple currencies, making catering to a global audience easier and simplifying financial transactions.\nMonthly or Quarterly Pricing:\nLook for a white label partner offering monthly and quarterly pricing options. This flexibility helps you accommodate various customer preferences and budgeting constraints, enhancing customer satisfaction.\nControl Integrations:\nAn ideal white label partner should provide control over integrations. This allows you to choose and manage the third-party applications that best suit your business needs, ensuring seamless operations.\nOnboard Unlimited Business:\nA significant feature is creating unlimited sub-accounts. This ensures you can manage multiple clients or departments efficiently, making it an attractive option for growing businesses.\nDocument\nLaunch Your White Label WhatsApp Chatbot Platform\nUnder Your Brand in Less Than 12 Hours\nTry BotPenguin\nConclusion\nChatbots streamline operations and boost customer engagement. But developing your own requires time, money, and expertise.\nTap into the thriving chatbot market by reselling customized bots from proven providers like\nBotPenguin\n. Offer turnkey automation to clients overnight.\nBotPenguin handles the tech; you handle the business. Gain a competitive edge without the overhead of in-house development.\nSimply rebrand BotPenguin's robust and customizable bots. Use our experience deploying solutions across industries—your business benefits from our ongoing maintenance and support.\nCapitalize on the chatbot revolution with minimal risk. BotPenguin's secure and compliant platform means you can launch compliant bots in any vertical.\nDon't let competitors beat you to this lucrative opportunity.\nPartnering with BotPenguin\nequips you with the cutting-edge automation your customers want. Turbocharge your portfolio by reselling bots that deliver value from day one.\nFrequently Asked Questions (FAQs)\nWhy should I become a WhatsApp Whitelabel Chatbot reseller?\nBecoming a reseller allows you to enter the chatbot market quickly and offer in-demand chatbot solutions. You can expand your service portfolio, generate recurring revenue, and cater to the growing need for chatbots.\nWhat are the benefits of selling WhatsApp Whitelabel Chatbots?\nBenefits include saving time and resources on chatbot development, leveraging the expertise of a proven platform, expanding your business offerings, generating additional revenue streams, and increasing client satisfaction with customized and branded chatbots.\nWhat kind of support can I expect as a reseller?\nA reputable WhatsApp Whitelabel Chatbot provider should offer prompt technical support through various channels. This ensures that you receive assistance with configuration, troubleshooting, and any issues that may arise during implementation or usage.\nHow do I market and sell WhatsApp Whitelabel Chatbots?\nYou can leverage your existing network, create targeted marketing campaigns, highlight the benefits of chatbots, offer demonstrations, and showcase successful use cases to attract and educate potential clients about the value of chatbot solutions.\nCan I set my own pricing for the Whitelabel Chatbot?\nTypically, as a reseller, you have the flexibility to set your own pricing for the WhatsApp Whitelabel Chatbot. This allows you to align the pricing with your target market and profitability goals.\nWhat kind of industries can benefit from WhatsApp Whitelabel Chatbots?\nWhatsApp Whitelabel Chatbots have a wide range of applications and can benefit industries including e-commerce, customer service, real estate, healthcare, banking, travel, and more. Any industry that can benefit from automated conversations can leverage chatbots.\nHow can I differentiate myself from other chatbot resellers?\nYou can differentiate yourself by providing excellent customer service, offering tailored and innovative chatbot solutions, showcasing successful implementations, focusing on niche industries, and continuously updating your knowledge and skills in the chatbot market.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\n11 Reselling Business Ideas that costs less than $250 per Year\nUpdated at Oct 11, 2024\n9 min to read\nRahul Gupta\nAssistant Marketing Manager, BotPenguin\n30 Best Affiliate Programs to Join in 2024\nUpdated at Oct 10, 2024\n15 min to read\nBotPenguin\nContent Writer, BotPenguin\n10 Best White Label Ecommerce Software for Reselling in 2024\nUpdated at Oct 15, 2024\n11 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nWhat is the WhatsApp Whitelabel Chatbot Program for Resellers?\nBenefits of WhatsApp Whitelabel Chatbot for Resellers\nHow Do You Choose The Right Whatsapp Whitelabel Chatbot Provider?\nFeatures to Look for in An Ideal WhatsApp White Label Partner\nConclusion\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.09585389494895935, -0.044117167592048645, 0.027188142761588097, -0.0003753704368136823, 0.003777426667511463, -0.02521318756043911, 0.029104046523571014, 0.07075774669647217, -0.006047738250344992, 0.025234540924429893, 0.028423525393009186, -0.017728934064507484, 0.021228337660431862, 0.04160511493682861, 0.11712338030338287, -0.010302802547812462, 0.12646859884262085, -0.12003397196531296, -0.09315833449363708, -0.01636173017323017, -0.011405273340642452, -0.01452942006289959, 0.05042131990194321, -0.021991241723299026, -0.04273098707199097, -0.03210846707224846, -0.044925231486558914, -0.02102043852210045, -0.020996274426579475, -0.044980619102716446, -0.0012489869259297848, 0.02332310751080513, 0.01802697777748108, 0.0761628970503807, -0.03322414681315422, -0.07120618969202042, -0.0152724115177989, 0.009361322037875652, 0.08378838747739792, -0.03966370224952698, -0.07721960544586182, -0.08425888419151306, -0.0701630637049675, -0.012312792241573334, 0.09145733714103699, -0.004758021328598261, -0.04950578883290291, 0.015201776288449764, 0.010564378462731838, 0.07595368474721909, -0.07204529643058777, -0.036937564611434937, 0.039631232619285583, 0.05442395433783531, -0.044924378395080566, 0.04595572501420975, -0.02568640373647213, 0.01153043657541275, 0.06200466677546501, -0.020823512226343155, -0.05437463894486427, -0.024106929078698158, 0.04246542975306511, 0.0379263274371624, -0.03545854613184929, 0.01872973144054413, -0.13220864534378052, -0.002123828511685133, -0.0069275652058422565, -0.039446912705898285, -0.012741325423121452, -0.014765695668756962, -0.006066201254725456, 0.05372365936636925, 0.005038714502006769, -0.025585686787962914, 0.01767025887966156, 0.004530012607574463, 0.020485613495111465, -0.07439112663269043, -0.002811708254739642, 0.02396777831017971, -0.017206134274601936, 0.06409892439842224, -0.02587655559182167, -0.03369744122028351, 0.0022895587608218193, 0.03568027913570404, -0.02500433474779129, -0.005517022218555212, 0.03745914250612259, -0.0014204686740413308, -0.01516649778932333, 0.023287514224648476, 0.02174413949251175, 0.013350998051464558, -0.07012415677309036, 0.01893432065844536, -0.042027540504932404, -0.02056596614420414, -0.000951273599639535, -0.043628398329019547, -0.031085854396224022, -0.07232442498207092, -0.05167694017291069, 0.009878895245492458, 0.06709948182106018, 0.013533801771700382, 0.1459430307149887, 0.017482032999396324, -0.11129658669233322, -0.05715109407901764, 0.008700698614120483, -0.012096459046006203, 0.015849566087126732, 0.0037733784411102533, -0.034465499222278595, 0.04655434563755989, 0.12932834029197693, 0.005433536134660244, 0.0863502249121666, 0.05256522074341774, 0.01749652996659279, 0.0036724391393363476, 0.042377326637506485, 0.036126065999269485, -0.00699953967705369, 1.1444156760860878e-32, -0.03452599421143532, 0.05403011664748192, -0.04828154295682907, 0.08051034808158875, 0.02748275361955166, 0.021949566900730133, 0.020078973844647408, 0.052810389548540115, -0.06039827689528465, -0.03935329243540764, -0.10624434798955917, 0.10749710351228714, -0.07917081564664841, 0.05327877774834633, 0.01710452139377594, -0.08362331241369247, -0.003499508835375309, 0.010220704600214958, 0.06009155884385109, 0.00889747403562069, 0.09040495753288269, -0.029744701460003853, 0.05378111079335213, 0.0861029103398323, 0.12335214018821716, 0.02441844902932644, 0.08088300377130508, 0.0018532832618802786, 0.060880910605192184, 0.034073349088430405, -0.09588687121868134, 0.0015710435109212995, -0.04548336938023567, 0.02095010131597519, -0.04860316589474678, -0.027987278997898102, -0.07688989490270615, -0.10258903354406357, -0.07354552298784256, 0.05263122543692589, -0.1253325492143631, 0.008368396200239658, -0.11471597105264664, -0.061965301632881165, 0.05808530002832413, 0.006106820423156023, 0.018480177968740463, 0.02182183228433132, 0.019670948386192322, 0.04780128598213196, -0.048094917088747025, 0.006736713461577892, 0.025794226676225662, 0.05680306628346443, -0.015906576067209244, -0.04362950846552849, 0.03574550151824951, -0.06817983090877533, -0.004729259293526411, -0.0352686271071434, -0.04426661506295204, -0.042020365595817566, -0.023290440440177917, -0.022656746208667755, 0.03109312430024147, 0.0026224947068840265, 0.047272372990846634, 0.033481478691101074, 0.006844560150057077, 0.05031950771808624, 0.05971260741353035, 0.05483166500926018, -0.004202730022370815, 0.02578657865524292, -0.053014736622571945, 0.03224053606390953, -0.0863112136721611, 0.03634626045823097, -0.052155181765556335, 0.005547035485506058, -0.007386114448308945, -0.0022389665246009827, -0.011943286284804344, -0.027766335755586624, 0.06814704835414886, -0.026373237371444702, 0.032142169773578644, -0.047986119985580444, -0.030383631587028503, 0.04665428772568703, -0.035904183983802795, 0.08628808706998825, -0.05547574162483215, 0.08492294698953629, -0.03741906210780144, -8.895757741991116e-33, -0.03340721130371094, 0.011245227418839931, -0.04377574101090431, 0.0826958641409874, 0.00917445681989193, -0.031864188611507416, 0.036160025745630264, -0.037287935614585876, 0.10875649750232697, -0.02205590158700943, -0.09591972827911377, -0.01269998587667942, 0.008992149494588375, -0.03888960927724838, -0.017811233177781105, 0.031462449580430984, -0.050409186631441116, -0.027698896825313568, 0.019130628556013107, 0.003831676207482815, -0.017124366015195847, 0.07689953595399857, -0.10561756789684296, 0.0028381533920764923, 0.000724770303349942, 0.03811539709568024, -0.07870674878358841, 0.07731673121452332, 0.029142962768673897, 0.02306620217859745, -0.02010251395404339, -0.0043215444311499596, -0.011123090982437134, 7.916744652902707e-05, 0.035586774349212646, 0.04221879690885544, 0.009904732927680016, 0.003198078600689769, 0.006599258165806532, -0.06727517396211624, 0.08987879008054733, -0.04714462161064148, -0.0457519106566906, -0.07537645101547241, -0.005786100868135691, 0.038466550409793854, -0.12795206904411316, -0.0362924225628376, -0.05595467612147331, 0.025676824152469635, 0.057124216109514236, -0.008148042485117912, 0.03548946604132652, -0.052740588784217834, -0.0873858779668808, -0.0413069985806942, 0.09507647901773453, 0.02028862200677395, -0.09044499695301056, 0.025362344458699226, 0.04223297908902168, 0.03480042144656181, 0.07116791605949402, 0.07250762730836868, 0.031554654240608215, -0.025869162753224373, 0.08363323658704758, 0.038297735154628754, -0.01052985992282629, -0.09352871775627136, 0.03729340806603432, -0.07452645152807236, -0.03296878561377525, 0.01197720505297184, 0.0022761134896427393, 0.09451774507761002, 0.03444113954901695, -0.11581847816705704, -0.0060623763129115105, -0.00413150992244482, -0.042097918689250946, -0.003503014100715518, 0.07341218739748001, 0.026091020554304123, -0.07977918535470963, 0.0597764290869236, -0.03355632349848747, 0.00162288558203727, -0.006478491239249706, 0.00424599414691329, -0.07305439561605453, 0.010776030831038952, -0.012658655643463135, 0.08591753244400024, 0.02128949761390686, -5.756904286613462e-08, -0.03232841193675995, -0.008879095315933228, 0.045632172375917435, 0.05758216977119446, 0.01948963850736618, -0.05943865701556206, -0.04292278364300728, 0.07520163804292679, 0.04232601448893547, 0.01964920200407505, 0.005821180995553732, -0.035363033413887024, -0.07312899827957153, 0.09310714155435562, 0.052024103701114655, -0.02443794161081314, -0.018983596935868263, -0.03665302321314812, 0.020425062626600266, -0.03393673524260521, 0.058358244597911835, 0.021833980455994606, -0.011133343912661076, -0.021115293726325035, 0.02746981382369995, -0.07856728881597519, -0.04295919090509415, 0.07417944818735123, -0.042197246104478836, -0.011129144579172134, -0.049767326563596725, -0.04832455515861511, 0.06148453801870346, -0.019077882170677185, 0.02357533574104309, -0.020546168088912964, -0.07484672963619232, -0.06995808333158493, 0.010031857527792454, 0.06391571462154388, 0.03262729197740555, 0.03404004126787186, 0.025742443278431892, -0.09748785197734833, -0.025153793394565582, -0.0704018697142601, -0.07759296149015427, -0.10180338472127914, 0.03897202014923096, 0.00875033438205719, -0.04282539337873459, 0.01574498414993286, 0.05359499529004097, 0.029752375558018684, 0.06665772199630737, -0.010282862931489944, 0.06619331985712051, -0.006398859899491072, 0.09828884899616241, 0.10935454070568085, 0.032876238226890564, 0.030846748501062393, 0.02761491946876049, 0.014986949972808361]}