{"file_name": "botpenguin.com_blogs_chatbots-in-spotlight-top-white-label-chatbot-resellers-2023", "text": "URL: https://botpenguin.com/blogs/chatbots-in-spotlight-top-white-label-chatbot-resellers-2023\nChatbots in Spotlight: Top White Label Chatbot Resellers\nWhy BotPenguin\nProduct\nSolutions\nPricing\nPartners\nResources\nLogin\nGet Started FREE\nIntegrations\nExperience 80+ world-class integrations.\nKey Features\nTake your business to the next level with our awesome key features.\nLive Chat\nStay in the loop with your clientele 24*7!\nUnified Inbox\nServe your customers across all platforms.\nAnalytics\nSpeedtrack your growth with our top-of-the-line analytics tools!\nMobile App\nMake, monitor, & manage your AI chatbots with our mobile app.\nCHATBOT COMPARISONS\nBotPenguin vs. Manychat\nBotPenguin vs. Tidio\nBotPenguin vs. Tawk.to\nBotPenguin vs. Wati\nBotPenguin vs. Interakt\nBotPenguin vs. AiSensy\nBotPenguin vs. Landbot\nWHAT CAN IT DO?\nMarketing Automation\nMake marketing a boon from the automation gods!\nFB Automation\nEngage with your customers on a deeper level.\nWhatsApp Automation\nGet that nifty automation for WhatsApp too!\nAppointment Bookings\nNo more delays, BotPenguin’s got you here!\nCustomer Support\nYour customers are in for a treat with this automation.\nLead Generation\nGain more lead without any extra effort or expenses\nWHO CAN USE IT?\nHealthcare\nGive your patients world-class healthcare service!\nEducation\nMake admissions and automate processes in a jiffy!\nE-commerce\nCreate the best E-commerce service with ease!\nReal Estate\nMake Real Estate great again with BotPenguin!\nConsultants\nBoost up with our one-stop marketing solution!\nSaaS\nTake your SAAS game to the next level with BotPenguin!\nTours & Travels\nProvide extraordinary tour and travel services with BotPenguin!\nInsurance\nLaunch AI-driven Insurance Bot to Promote, Sell, & Manage Policies.\nWHERE CAN IT RUN?\nInstagram Chatbot\nAttract leads, boost sales, and chat 24/7 with Instagram Chatbots.\nWhatsApp Chatbot\nStart conversing like a real person with BotPenguin!\nTelegram Chatbot\nCutting-edge features for you to grow your business on Telegram.\nFacebook Chatbot\nDo everything at once with BotPenguin on Facebook.\nWebsites Chatbot\nBotPenguin grows your website and keeps your customers engaged.\nWordpress Chatbot\nBotPenguin thrives on WordPress and makes it awesome.\nMicrosoft Teams Chatbot\nMaximize your teams productivity with MS Teams Bot.\nShopify Chatbot\nBoost your Shopify Business With BotPenguin’s AI-powered chatbot.\nWooCommerce Chatbot\nSell effortlessly on your WooCommerce store with BotPenguin.\nSquarespace Chatbot\nGet the most out of Squarespace with BotPenguin\nCUSTOM DEVELOPMENT\nWhitelabel ChatGPT\nApply your branding on ChatGPT, Launch your own AI platform\nChatGPT Custom Plugins\nIntegrate your service straight into ChatGPT\nCustom Chatbot Development\nBuild enterprise-grade chatbots with the best\nChatGPT Clone\nAdd functionality and branding on ChatGPT\nHIRE DEVELOPERS\nChatbot Developers\nBuild Lighter, Faster, Smarter-Efficiently\nChatGPT Developers\nRide the GPT wave with trained surfers\nChatGPT Consultants\nAdvice that makes the difference in your AI journey\nPARTNER PROGRAMS\nPartners Home\nJoin hands with us, and welcome growth\nWhatsApp Whitelabel Partners\nConquer the WhatsApp land with BotPenguin’s White Label Platform\nWhitelabel Partners\nSay hi to the best Whitelabel chatbot platform ever\nAffiliate Partners\nEarn more and keep your clients happier\nImplementation Partners\nAs they say, a partner is worth trillions!\nPARTNER PRICING\nWhitelabel Chatbot Pricing\nOur pricing for Whitelabel Chatbot\nImplementation Partnership Pricing\nOur pricing for Implementation Partnership\nOUR RESOURCES\nBlogs\nRead the latest blogs on chatbots, AI, automations & more\nVideos\nWatch tutorials, webinars, and demos to master our chatbots.\nCase Study\nRead how BotPenguin transformed business communication\nE-book\nExplore e-books written by experts for all your business needs!\nHelp Docs\nFind detailed guides and tips for all your chatbot needs.\nNewsroom\nExplore how BotPenguin is making headlines in the chatbot industry.\nCommunity Support\nJoin our vibrant community to unlock exclusive content & expert guidance\nLATEST BLOG\nWhy is BotPenguin the best platform to develop a chatbot?\nIntroducing ChatGPT 4o for BotPenguin\nCreate your first AI Chatbot\nGet Started FREE\nAll blogs\nChatbots in Spotlight: Top White Label Chatbot Resellers [2024]\nComparison\nUpdated at Oct 9, 2024\n10 min to read\nAjay Pratap Sudhakar\nProduct Manager, BotPenguin\nBecome a Partner\nTable of Contents\nWhat is a White Label Chatbot?\nWhy Do You Need a White Label Chatbot Platform?\nTop 6 White Label Chatbots of 2024\nConclusion\nFrequently Asked Questions (FAQs)\nShare\nLink copied\nIf you were to ask me what’s better than using a chatbot, I would say selling one. You have a chance to enter the 7 billion chatbot market with zero research and development costs.\nSounds too good to be true?\nWell, that’s a white label chatbot program for you. You can purchase a ready-made or customized Chabot agency platform and sell chatbot services under your brand name.\nThink about it: As a whitelabel chatbot reseller, you can become an AI chatbot provider and automate custom interactions for millions of businesses worldwide.\nThat’s the easy part. Finding the perfect chatbot program is a tough road because when buying an already-built platform, ensuring it meets the client’s needs becomes much more important.\nIn this article, I’ll list the Top White label Chatbots of 2024 and the features you need to watch out for.\nSo, let’s dive in.\nWhat is a White Label Chatbot?\nWhite label chatbots are pre-built chatbots that you can customize and brand as your own.\nThey remove the original developer's branding, allowing you to add your logo and sell them under your company name. This approach helps small businesses enter the chatbot market without developing their platform.\nNot just branding, you can customize your set of features & integrations, control the pricing with tailored subscription plans, onboard users at your terms, and more.\nAn established AI chatbot platform with a while-label program will allow you to sell branded chatbot solutions for websites, WhatsApp, Instagram, Facebook, and many other channels.\nAdd AI to the mix, and you have a ChatGPT-driven chatbot that delivers a conversational experience across your client’s business.\nAgain, it depends solely on the whitelabel chatbot provider. Hence, finding the right one is a critical decision.\nWhy Do You Need a White Label Chatbot Platform?\nNowadays, businesses seek ways to engage their customers effectively without putting pressure on their employees. Chatbots can be an excellent solution.\nWhitelabel Chatbot platforms are power pack tools at affordable prices. Plus, the margin for resellers is huge.\nWhitelabel chatbots\nare easy to sell to your customers, and you can guarantee them immediate benefits.\nWhite label chatbot resellers must allocate all their efforts to marketing only. The service provider handles the extensive product development, routine updates, and support.\nThey can be instantly built, branded, and executed to fit any business chatbot demand.\nCost-Effectiveness\nWhite label chatbot\nplatforms offer significant benefits, including cost-effectiveness and quick deployment. Unlike the traditional route, which requires a large investment to develop a chatbot platform, resellers face no such hassle.\nThese wallet-friendly services provide a fully developed platform with your branding, pricing, logos, and features. This enables you to enter the growing chatbot market easily.\nMultiple Subscription Packages\nSee Full Pricing\nWhite label chatbot platforms have pre-built subscription plans whose pricing you can edit and change according to your needs.\nThese plans are suitable for small to big businesses so that everybody can equally access them to grow their business and attract more customers.\nManaged-Training, Support, and Development\nThe\nWhite label chatbot service provider\nmanages all the technical aspects like training your team, new feature development, and client support.\nOutsourcing your support team clearly benefits you because chatbot experts with years of experience handle your clients’ issues.\nThis leaves you with only one job — marketing. Promote, sell, and make it rain money.\nEarn Revenue With Chatbot & its Addons\nWhitelabel chatbots are, in essence, chatbots. They will sell like hotcakes during Halloween. If you follow a subscription model, you’ll receive money monthly and yearly on a routine basis.\nPlus, you can sell add-ons of message packs, integrations, channels, etc., to increase the overall price.\nEnter the Chatbot Market in No Time\nAs the whitelabel chatbot reseller, you can begin your journey in a few days if you don’t have any customizations for the white label provider.\nIn ideal cases, you can launch your branded chatbot platform within 24 hours. It is a shortcut where you only have to work on building a brand and onboarding users.\nYour Chatbot Platform Reflects Your Vision\nWhite label chatbot resellers can customize the bot platform with their brand name to meet their clients' demands.\nFor example, suppose you want a different set of features and integration to improve the product’s saleability to your target audience. In that case, the solution provider will develop a unique version of the chatbot platform for you.\nNow, let’s move on to the money part.\nTop 6 White Label Chatbots of 2024\nInterested in getting a WhiteLabel Chatbot? But if you are not sure which platform will be more suitable for your business needs, here is a list of the top white label chatbot builders for you:\nBotPenguin\nBotPenguin is a leading\nwhite label chatbot platform\n. In less than 12 hours, launch your own branded website & WhatsApp chatbot platform under your domain, logo, and pricing and offer your clients a comprehensive suite of automation solutions.\nWith BotPenguin, you can access a fully customizable platform to configure taxes, sell add-ons, offer free trials, and create multiple subscription plans to cater to your clients' needs. Plus, you receive expert tech team assistance, regular updates, and priority support.\nIt is also integrated with ChatGPT for advanced conversational capabilities, increasing the value of your AI-driven chatbot platform.\nAdditionally, your clients can provide 24/7 customer support, send broadcasts, create product catalogs, schedule drip campaigns, and segment users for targeted marketing efforts.\nKey features of BotPenguin’s whitelabel platform:\nConfigure taxes based on your country & business preferences.\nIntegrate your payment gateway for uncapped revenue potential.\nAttract customers with a free trial period.\nCreate custom subscription plans to boost revenue.\nOffer multi-currency support for a localized experience.\nProvide flexible monthly or quarterly pricing options.\nManage integrations with platforms like Zoho, ChatGPT, Google Suite, etc.\nGet unlimited sub-accounts for maximum customer outreach.\nDocument\nShake Hands with BotPenguin to\nBecome a Leading Chatbot Reseller!\nBecome a Partner\nWhether you're a freelancer, digital marketer, web studio, agency, SaaS business, or technical solution provider, BotPenguin's program offers lucrative revenue opportunities and the tools you need to succeed as a white label chatbot reseller in the rapidly growing website and WhatsApp automation market.\nLearn more about becoming a chatbot reseller with\nBotPenguin's white label chatbot program\nhere\nInstabot\nInstabot White Label chatbot builder empowers marketing agencies to enhance their brand presence and unlock new revenue streams.\nAgencies can seamlessly incorporate their branding elements throughout the chatbot-building process, from onboarding to client management.\nAgencies or whitelabel chatbot resellers can infuse their unique identity into the platform by uploading their logo and applying their color palette. InstaBot captures demographic data and provides immediate responses around the clock to boost conversion rates.\nThe platform offers calendar integration for meeting bookings and automates lead qualification and routing. Agencies gain access to end-to-end conversational marketing strategies, yielding higher ROI and client satisfaction.\nFeatures of Instabot's white label chatbot program:\nApply your logo, colors, and branding seamlessly.\nManage all client accounts and streamline billing.\nAdd and track team members and client users.\nEasy for all team members to build and manage bots.\nTrain bots to understand and respond to numerous topics.\nIn-person and team training for platforms and bots.\nMarketing resources to introduce bots to your clients.\nPhone Support: Monday to Friday, 9:00 am - 5:00 pm EST.\n24/7 email customer support for all queries.\nTrack chatbot usage and performance and optimize strategies.\nBook meetings directly through the chatbot platform.\nFor more details, vis\nit Instabot Agencies.\nWith an intuitive interface and robust support resources, agencies can effortlessly harness InstaBot's capabilities to offer exceptional service to their clients.\nOn their website, you can sign up for a comprehensive demo and experience the benefits of InstaBot's White Label program.\nSuggested Reading:\n10 Key Factors for Selecting the Best Whitelabel AI Chatbot\nIntelliticks\nIntelliTicks is perfect for whitelabel chatbot resellers like digital marketing agencies, IT service companies, and enterprises. This program offers a fully customized chat platform with the partner's branding.\nWith three plans available (bronze, silver, and gold), resellers can choose the level of white label customization they desire, including web applications, integration apps, and mobile apps for Android and iOS.\nMaintenance charges are covered under the subscription, while platform usage charges are billed separately. Partners have the flexibility to set their own pricing for clients.\nThe onboarding process typically takes 1-2 days for the Bronze plan and 2-3 weeks for the Gold plan, with priority support provided. IntelliTicks also offers professional chatbot development services at an additional cost.\nThe top features of Intelliticks' white label chatbot builder:\nWhite labeled web and mobile apps with your logo and URL.\nWhite labeled integration apps for platforms like Facebook Messenger, Zapier, HubSpot, and ZOHO CRM.\nManage all client accounts in one place.\nAdd and manage team members and client users.\nProvide round-the-clock customer service.\nAuto-qualify and route leads to the right team members.\nAccess detailed analytics to optimize performance.\nSet your pricing for client accounts.\nReceive priority support for onboarding and troubleshooting.\nProfessional services for custom chatbot setup and training.\nTo learn more about becoming a whitelabel chatbot reseller with IntelliTicks, visit their\nsite.\nEngati\nImage Source: Engati\nEngati is also an amazing white label chatbot builder that helps you build, manage, integrate, train, analyze, and publish your personalized bot in the minimum amount of time.\nIt is a very versatile platform that presently supports eight major messaging platforms- Messenger, Kik, telegram, line, Viber, Skype, Slack, and web chat focusing mainly on customer engagement.\nEngati's White Label program empowers partners to thrive as\nwhitelabel chatbot\nresellers, offering a fully customized and branded platform tailored to local market dominance.\nThe program features a customizable portal, comprehensive bot-building support, personalized training, and flexible pricing models for competitive client offerings.\nWhite label chatbot resellers gain unlimited access to starter packs for quick customer onboarding and revenue generation.\nThe top features of Engati's white label chatbot builder:\nApply your logo and colors to the platform.\nManage all client accounts in one place.\nAdd and manage team members and client users.\nAccess detailed analytics and performance reports.\nSet flexible pricing models for clients.\nReceive personalized training and support services.\nConnect with various third-party platforms easily.\nFor more information, visit\nEngati Partners\n.\nWith priority support from Engati's bot experts and extensive pre-sales assistance, partners can efficiently convert prospects. This collaboration with a globally recognized chatbot platform enables partners to enhance their brand significantly.\nWotnot\nWotNot is a renowned whitelabel chatbot platform that successfully supports your need to create, manage, and grow your chatbot Empire.\nIt helps you build brand identity by allowing you to customize the white label platform according to your needs.\nAs a whitelabel chatbot reseller, you can add the logo, domain name, color, and fonts you want your customers to see. You can also charge your customers according to your rates and manage subscriptions and invoicing.\nThe top features of WotNot's white label chatbot platform:\nAdd your logo, domain, colors, and fonts easily.\nCreate unlimited accounts for substantial revenue growth.\nAccess all features and future updates seamlessly.\nBuild AI chatbots with data training capabilities.\nDefine and package your pricing plans.\nSetup, hosting, and expenses managed for 99.99% uptime.\nLaunch with a custom sub-domain.\nSeamlessly embed within your existing product.\nIntegrate platform features with your product via APIs.\nGet complete support for launching and managing chatbots.\nFor more details, visit\nWotNot's whitelabel chatbot Builder\n.\nThis platform provides the freedom to do your own business without any interference. They can also build new features according to your requirements to help you grow your business and give you a customized chatbot platform.\nSuggested Reading:\n9 Things you must know about Chatbot Reseller Programs [2024]\nChatCompose\nChatCompose is a whitelabel chatbot platform that allows you to build and install chatbots with your brand anytime and anywhere.\nYou can create about 20 chatbots using their premium plan, and the VIP plan offers the opportunity to create unlimited chatbots.\nChatCompose allows you to customize your Chatbot with your designs and schemes and add your logos or brand within the Chatbot. It offers three main styles: Default, Clean and Transparent.\nIt also makes managing all your chatbots in one place easier. You can easily edit and configure them for your clients, and it gives you alerts about important events that the client has received.\nThe top features of ChatCompose's white label chatbot program:\nAdd your designs, logos, colors, and titles.\nCentralize management for all client chatbots.\nNotifications for new leads, purchases, and support requests.\nAdd emails for client notifications.\nSeamlessly integrate with external services.\nChoose from Default, Clean, and Transparent styles.\nCustomizable UI allows full control over chatbot appearance.\nDesign AI-drive conversation and sales scripts.\nDeploy across popular channels and media.\nFor more details, visit\nChatCompose's white label program\n.\nYou can also add an extra email to the platform so your clients can receive notifications about newly generated leads, new purchases, or support requests through the Chatbot.\nDocument\n92% of Consumers Prefer Chatbots. Join as a Reseller Now!\nTry BotPenguin\nConclusion\nBy now, you know the top Whitelabel Chatbot Platforms of 2024. If you plan on investing in a chatbot, you can find one from this list that fits your needs.\nChatbots have recently been rapidly growing as solution software and still need a reason. They act as a support system for your team and bridge the gap between you and your customers.\nMaintaining good relationships with your customers is very important to achieve business success. Chatbots are a trusted partner for your success journey.\nDon't wait! Resell white label chatbots today and become a trusted partner in your clients' success journey\nFrequently Asked Questions (FAQs)\nWhat are White Label Chatbot Resellers?\nWhite label chatbot Resellers are companies that provide customizable chatbot solutions. They allow businesses to rebrand and sell these solutions to their clients as their own products.\nAre White Label Chatbots customizable to fit my clients' needs?\nYes, White Label Chatbots builders are designed to be easily tailored with custom branding, features, and AI-powered capabilities to meet your client's specific requirements.\nWhat are the benefits of partnering with a top White Label Chatbot Platform?\nBenefits include access to cutting-edge chatbot technology, reduced development costs, faster time-to-market, and the potential for increased revenue by offering chatbot solutions to clients.\nCan you integrate White Label Chatbots with your client's existing platforms and tools?\nYes, most White Label Chatbots offer seamless integration with popular platforms and tools, ensuring smooth adoption within your clients' existing infrastructure.\nAre White Label Chatbot Resellers a cost-effective solution for your clients?\nWhite Label Chatbot Resellers can be a cost-effective option, enabling businesses to access advanced chatbot technology without the high costs of developing a custom solution in-house.\nSubscribe to Our Newsletter\nGet the latest business insights straight into your inbox.\nEmail\nEnter your email address\n*\nSubscribe Now\nKeep Reading, Keep Growing\nCheckout our related blogs you will love.\nWhatsApp Ads Vs Facebook Messenger Ads: A Detailed Comparison\nUpdated at Sep 6, 2024\n10 min to read\nRahul Gupta\nAssistant Marketing Manager, BotPenguin\nChatGPT Vs ChatGPT Clone: What's Better for Your Customers\nUpdated at Jul 12, 2024\n10 min to read\nBotPenguin\nContent Writer, BotPenguin\nComparing Chainer with Other Frameworks for Chatbot Creation\nUpdated at Aug 6, 2024\n8 min to read\nBotPenguin\nContent Writer, BotPenguin\nTable of Contents\nWhat is a White Label Chatbot?\nWhy Do You Need a White Label Chatbot Platform?\nTop 6 White Label Chatbots of 2024\nConclusion\nFrequently Asked Questions (FAQs)\nBotPenguin is the best AI Chatbot maker platform. Create a Chatbot for WhatsApp, Website, Facebook Messenger, Telegram, WordPress & Shopify with BotPenguin - 100% FREE! Our chatbot creator helps with lead generation, appointment booking, customer support, marketing automation, WhatsApp & Facebook Automation for businesses. AI-powered No-Code chatbot maker with live chat plugin & ChatGPT integration.\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nMobile app\niOS App\nAndroid App\nFully Operational\nStatus\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nPartners\nWhitelabel Partner\nWhatsapp Whitelabel Partner\nImplementation Partner\nAffiliate Partner\nGet Started\nChatbot For Ecommerce\nChatbot For Real Estate\nChatbot For Education\nChatbot For Travel\nAll Templates\nFree Tools\nWhatsApp Link Generator\nWhatsApp QR Code Generator\nOpenAI API Pricing Calculator\nChatbot ROI Calculator\nAll Free Tools\nIntegrations\nChatGPT\nGoHighLevel\nBitrix 24\nZoho CRM\nZapier\nAll Integrations\nResources\nBlogs\nGlossary\nHelp Center\nWrite for us\nContact Us\nWhat’s New\nProduct Updates\nComparisons\nBotPenguin vs Manychat\nBotPenguin vs Tidio\nBotPenguin vs Tawk.to\nBotPenguin vs Wati\nBotPenguin vs Landbot\nAll Comparisons\nAlternatives\nWhat you get\nLead Generation Bot\nSupport Bot\nAssistant Bot\nPlatforms\nMicrosoft Teams\nNew\nInstagram\nNew\nWhatsapp\nTelegram\nFacebook\nWebsites\nGet Started\nIntegrations\nComparisons\nPartners\nFree Tools\nResources\nWhat you get\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nTerms & Conditions\nPrivacy Policy\nSecurity\nGDPR\nRefund Policy\nCopyright © 2018 - 2024 Relinns Technologies Pvt. Ltd. All RightsReserved.", "embedding": [-0.08386445045471191, -0.07532057911157608, 0.00882981438189745, 0.027537014335393906, 0.02042917162179947, -0.04035019874572754, 0.01780548132956028, 0.05618840456008911, -0.0321945920586586, -0.0085892453789711, 0.021985679864883423, -0.0030267704278230667, 0.01824375055730343, 0.02243037335574627, 0.11033964902162552, 0.010816390626132488, 0.11484193801879883, -0.09422115236520767, -0.0862128883600235, -0.04273809492588043, -0.004850792232900858, -0.01217739563435316, 0.053773146122694016, -0.04302448034286499, -0.035395700484514236, -0.038845036178827286, -0.05132460221648216, -0.018500789999961853, -0.024060556665062904, -0.06834512948989868, 0.019014259800314903, 0.036285459995269775, 0.015842074528336525, 0.0788569450378418, -0.011025238782167435, -0.0502537302672863, -0.04035123065114021, -0.015166927129030228, 0.09369096904993057, -0.050640884786844254, -0.0695788636803627, -0.08415991812944412, -0.05417199060320854, -0.00022015217109583318, 0.07805025577545166, -0.021497240290045738, -0.052696194499731064, 0.015645571053028107, 0.023037461563944817, 0.07712937891483307, -0.12188569456338882, -0.04935993626713753, 0.059521451592445374, 0.07837323844432831, -0.0364493653178215, 0.0644511952996254, -0.032423846423625946, -0.003049000632017851, 0.07618246972560883, -0.02461431734263897, -0.018248455598950386, -0.02346123568713665, 0.0516057126224041, 0.017131401225924492, -0.02104085125029087, 0.01751340553164482, -0.11089137196540833, 0.022412313148379326, -0.008215355686843395, -0.033894408494234085, 0.00040809993515722454, -0.019201204180717468, -0.034607067704200745, 0.06052384525537491, 0.004131149500608444, -0.001539066550321877, 0.013828684575855732, -0.011648237705230713, 0.03460917994379997, -0.04790927842259407, -0.018482455983757973, 0.0165919978171587, -0.004953470546752214, 0.057567842304706573, -0.035967305302619934, -0.04225216805934906, 0.02729485183954239, 0.0291694775223732, -0.04200989753007889, 0.010319209657609463, 0.01574673131108284, -0.0014890667516738176, 0.0031928138341754675, 0.008069582283496857, 0.001897633308544755, 0.0017116476083174348, -0.09734272211790085, 0.0018406715244054794, -0.04530065506696701, -0.0042834095656871796, 0.0029374766163527966, -0.038149990141391754, -0.04942183569073677, -0.08234205096960068, -0.06581749767065048, -0.012274645268917084, 0.06726321578025818, 0.04023246839642525, 0.10640818625688553, 0.039230357855558395, -0.09655091911554337, -0.05144210904836655, 0.00710247503593564, -0.007566390093415976, 0.03409311920404434, 0.01087328139692545, -0.02273307740688324, 0.05800296738743782, 0.13733983039855957, 0.027835166081786156, 0.07585633546113968, 0.04801855608820915, 0.011782570742070675, -0.027996165677905083, 0.07143113762140274, 0.0594877265393734, -0.0218488872051239, 1.1571008029677958e-32, -0.04302838072180748, 0.036086443811655045, -0.05124510079622269, 0.07061702758073807, 0.02344648726284504, 0.03446653112769127, 0.02197919599711895, 0.04896668344736099, -0.08186256885528564, -0.024685068055987358, -0.09645123034715652, 0.12499059736728668, -0.0761985257267952, 0.04421209171414375, 0.024868730455636978, -0.10905160754919052, -0.004275741521269083, 0.02895410917699337, 0.042212486267089844, -0.01660577952861786, 0.08043718338012695, -0.01970617286860943, 0.050201836973428726, 0.0927828848361969, 0.09685526043176651, 0.04270858317613602, 0.06187820807099342, -0.01468330342322588, 0.06669507920742035, 0.03754430264234543, -0.07420649379491806, 0.020592395216226578, -0.026870016008615494, 0.03358253836631775, -0.044256485998630524, -0.03910339996218681, -0.059862811118364334, -0.10394662618637085, -0.05997610092163086, 0.07055849581956863, -0.13342295587062836, 0.018212448805570602, -0.11172453314065933, -0.09326499700546265, -0.009332303889095783, 0.021319910883903503, -0.006480043288320303, 0.0024831625632941723, 0.056872643530368805, 0.011196956038475037, -0.05042054131627083, 0.002240949310362339, 0.026162361726164818, 0.04672431945800781, 8.349806012120098e-05, -0.03978477790951729, 0.009505652822554111, -0.06559614837169647, 0.01139061152935028, -0.053017377853393555, -0.04194306209683418, -0.04846574738621712, -0.030095819383859634, -0.022234594449400902, 0.03201392665505409, -0.0024347160942852497, 0.0681517943739891, 0.03554035723209381, -0.008030161261558533, 0.06653717160224915, 0.061911847442388535, 0.03858615830540657, -0.0036076887045055628, 0.03749259188771248, -0.033092815428972244, 0.0022092212457209826, -0.08671355992555618, 0.02008957974612713, -0.04018699377775192, 0.000397786614485085, -0.03859809413552284, -0.015257774852216244, -0.022050509229302406, -0.02334882691502571, 0.07501815259456635, -0.034009627997875214, 0.019251450896263123, -0.022331716492772102, -0.022709043696522713, 0.04045620933175087, -0.05229759216308594, 0.0813114270567894, -0.07017067819833755, 0.07479944825172424, -0.07582739740610123, -8.600034220050938e-33, -0.056528203189373016, 0.008894632570445538, -0.04034768044948578, 0.08075613528490067, 0.015895187854766846, -0.01584654673933983, 0.037482231855392456, -0.039307817816734314, 0.10103429853916168, -0.008396639488637447, -0.09362218528985977, -0.009080489166080952, 0.0028297004755586386, -0.01739063486456871, -0.004836962558329105, 0.015757856890559196, -0.052761707454919815, -0.050044089555740356, -0.00048506323946639895, -0.004237600602209568, -0.03195815533399582, 0.06929698586463928, -0.14474530518054962, 0.017667477950453758, -0.008167235180735588, 0.043185509741306305, -0.06637892127037048, 0.06323843449354172, 0.03156498074531555, 0.022310374304652214, -0.012025916017591953, 0.021649513393640518, -0.03101395256817341, 0.001404992421157658, 0.03031463362276554, 0.06484485417604446, 0.019636880606412888, -0.03456689044833183, -0.008114637807011604, -0.043628912419080734, 0.08005930483341217, -0.04555423930287361, -0.06403826177120209, -0.06205381080508232, -0.008136154152452946, 0.017069267109036446, -0.1295994371175766, -0.02442285418510437, -0.05868568643927574, 0.03599381074309349, 0.04188685119152069, 0.013212957419455051, 0.060254983603954315, -0.0627700611948967, -0.10249084234237671, -0.04142764210700989, 0.09012943506240845, 0.02216058410704136, -0.07748857885599136, 0.039849672466516495, 0.03609966114163399, 0.007724977098405361, 0.0614110603928566, 0.06472720950841904, 0.027531804516911507, -0.0035470309667289257, 0.09206222742795944, 0.036948174238204956, -0.017950350418686867, -0.09484542906284332, 0.06465443968772888, -0.045585617423057556, -0.017525173723697662, 0.009552419185638428, -0.006300507113337517, 0.08913783729076385, 0.03729855641722679, -0.0704893246293068, 0.005141705274581909, -0.027159560471773148, -0.03417380526661873, 0.014293107204139233, 0.06319770216941833, 0.03498264029622078, -0.05481832101941109, 0.038626380264759064, -0.023644570261240005, 0.019707437604665756, -0.0020268524531275034, 0.0005669290549121797, -0.07631266862154007, -0.003720704233273864, -0.03893599286675453, 0.08864592760801315, 0.012263860553503036, -6.106698435814906e-08, -0.0416080579161644, -0.006638014689087868, 0.05199968069791794, 0.08662115037441254, 0.049273066222667694, -0.020118558779358864, -0.023901795968413353, 0.11451564729213715, 0.04142795875668526, 0.040923990309238434, 0.016589216887950897, -0.03183843195438385, -0.05218960717320442, 0.0823255330324173, 0.07333077490329742, -0.011122580617666245, -0.019583338871598244, -0.006531477440148592, 0.014536130242049694, -0.024130133911967278, 0.045540448278188705, 0.05073743313550949, 0.007090199738740921, -0.021297743543982506, 0.02105862647294998, -0.07255905121564865, -0.01779322326183319, 0.0764806792140007, -0.038705505430698395, -0.007085056975483894, -0.03359111025929451, -0.031187746673822403, 0.08101801574230194, -0.04152509942650795, 0.013408319093286991, -0.007392610888928175, -0.06171104311943054, -0.06069948896765709, 0.00017927898443304002, 0.04638613760471344, 0.01759236678481102, 0.04079798609018326, 0.01524802390486002, -0.09675687551498413, -0.036580927670001984, -0.05215417221188545, -0.10157021880149841, -0.09886018931865692, 0.047558579593896866, 0.005790629889816046, -0.05372263863682747, 0.010055274702608585, 0.05043412744998932, 0.03903776407241821, 0.07429362088441849, 0.0002873197663575411, 0.0480375736951828, -0.013563057407736778, 0.08977504074573517, 0.1055024042725563, 0.06503427773714066, 0.028523847460746765, 0.025179751217365265, 0.013635309413075447]}